
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.РежимВыбора Тогда
		
		Элементы.Список.РежимВыбора = Истина;
		
		Если Параметры.Отбор.Свойство("Владелец")
			И ЗначениеЗаполнено(Параметры.Отбор.Владелец) Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Подразделения %1'"),
				Параметры.Отбор.Владелец);
			
		КонецЕсли;
		
		Если Параметры.МножественныйВыбор = Истина Тогда
			Элементы.Список.МножественныйВыбор = Истина;
			Элементы.Список.РежимВыделения = РежимВыделенияТаблицы.Множественный;
		Иначе
			Элементы.Список.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
		КонецЕсли;
		
	КонецЕсли;
	
	//Бюджетирование.ПриСозданииНаСервереФормыСДинамическимСписком(ЭтотОбъект, "Список",,,, "Владелец");
	//УстановитьПараметрыДинамическогоСписка(ЭтотОбъект, Список);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.КоманднаяПанельФормы;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПараметрыДинамическогоСписка(Форма, Список)
	
	//ВыделенныеСтроки = Форма.Элементы.Дерево.ВыделенныеСтроки;
	//Если ВыделенныеСтроки.Количество() > 0 Тогда
	//	Подразделение = ВыделенныеСтроки[0];
	//Иначе
	//	Подразделение = ПредопределенноеЗначение("Справочник.ПодразделенияОрганизаций.ПустаяСсылка");
	//КонецЕсли;
	//
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Владелец", Подразделение, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	//БюджетированиеКлиентСервер.ОбновитьНадписьФиксированногоОтбора(Форма);
	
КонецПроцедуры

&НаСервере
Функция ЭтоГруппаПодразделений(Подразделение)
	
	//Возврат Подразделение.ЭтоГруппа;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	//ВыделенныеСтроки = Элементы.Дерево.ВыделенныеСтроки;
	//Если ВыделенныеСтроки.Количество() > 0 Тогда
	//	Подразделение = ВыделенныеСтроки[0];
	//	Если НЕ ЗначениеЗаполнено(Подразделение) ИЛИ ЭтоГруппаПодразделений(Подразделение) Тогда
	//		Отказ = Истина;
	//	КонецЕсли; 
	//Иначе
	//	Отказ = Истина;
	//КонецЕсли;
	//
	//Если Отказ Тогда
	//	ПоказатьПредупреждение(, НСтр("ru='Команда не может быть выполнена для указанного объекта.'")); 
	//КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки, ИспользуютсяСтандартныеНастройки)
	//Бюджетирование.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, Настройки);
КонецПроцедуры

&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	//
	//Бюджетирование.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, , СтандартнаяОбработка);
	//
КонецПроцедуры 

&НаКлиенте
Процедура ДеревоПриАктивизацииСтроки(Элемент)
	//УстановитьПараметрыДинамическогоСписка(ЭтотОбъект, Список);
КонецПроцедуры

#КонецОбласти
