
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)



	ЗначенияДляЗаполнения  = Новый Структура("Организация", "Организация");
	Бюджетирование.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);

	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = Бюджетирование.ПерваяДоступнаяОрганизация();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ИзменениеОрганизации" ИЛИ ИмяСобытия = "ИзменениеФизическихЛиц"
		Или ИмяСобытия = "ДокументЗагрузочнаятаблицаПослеЗаписи" Тогда
		
		ПодключитьОбработчикОжидания("ОбновитьСотрудники",
			БюджетированиеРасширенныйКлиент.ПериодОжиданияЗапускаАвтоматическогоРасчета(), Истина);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияПриАктивизацииСтроки(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ФизическиеЛицаПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ФизическиеЛицаПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ФизическиеЛицаПоПодразделениям(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВсеФизическиеЛица(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПозицииШтатногоРасписания(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВсеДокументы(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти