
&НаКлиенте
Процедура КомандаЗаполнитьПоставляемыеДанные(Команда)

	ПоказатьВопрос(
		Новый ОписаниеОповещения("ЗаполнитьПоставляемыеДанныеПодтверждение", ЭтаФорма),
		"Для предопределенных видов начислений будут обновлены поля ""УстанавливаютсяКоэффициенты"", ""Доступные периоды хранения значений"", продолжить?",
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ЗаполнитьПоставляемыеДанныеПодтверждение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоставляемыеДанныеНаСервере();
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.ВидыНачислений"));

	ПоказатьОповещениеПользователя("Данные обновлены");
	
КонецПроцедуры // ЗаполнитьПоставляемыеДанныеПодтверждение()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ЗаполнитьПоставляемыеДанныеНаСервере()

	Справочники.ВидыНачислений.ЗаполнитьПоставляемыеДанные();	

КонецПроцедуры // ЗаполнитьПоставляемыеДанныеНаСервере()
	