
#Область КлючевыеРеквизитыЗаполненияФормы

Процедура КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(Форма, ОтображатьПредупреждение = Неопределено, МассивОписанийРеквизитов = Неопределено, МассивИменТаблиц = Неопределено) Экспорт
	
	Если Не Форма.ПолучитьФункциональнуюОпциюФормы("ИспользоватьРасчетБюджетированияРасширенная") Тогда
		Возврат;
	КонецЕсли; 

	Если ОтображатьПредупреждение = Неопределено Тогда
		Если МассивИменТаблиц = Неопределено Тогда 
			МассивИменТаблиц = Форма.КлючевыеРеквизитыЗаполненияФормыТаблицыОчищаемыеПриИзменении();
		КонецЕсли;	
		ОтображатьПредупреждение = КлючевыеРеквизитыЗаполненияФормыОтображатьПредупреждениеПриРедактировании(Форма, МассивИменТаблиц);
	КонецЕсли;
	
	Если МассивОписанийРеквизитов = Неопределено Тогда 
		МассивОписанийРеквизитов = Форма.КлючевыеРеквизитыЗаполненияФормыОписаниеКлючевыхРеквизитов();
	КонецЕсли;	
	Для каждого Описание Из МассивОписанийРеквизитов Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы,
			Описание.ЭлементФормы,
			"ОтображениеПредупрежденияПриРедактировании",
			ОтображатьПредупреждение);
	КонецЦикла;
КонецПроцедуры 

Функция КлючевыеРеквизитыЗаполненияФормыОтображатьПредупреждениеПриРедактировании(Форма, МассивИменТаблиц)
	
	ОтображатьПредупреждениеПриРедактировании = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
	Для каждого ИмяТаблицы Из МассивИменТаблиц Цикл
		Таблица  = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, ИмяТаблицы);
		Если Таблица.Количество() > 0 Тогда
			ОтображатьПредупреждениеПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Отображать;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОтображатьПредупреждениеПриРедактировании;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбновитьПредставлениеПараметровМодификации(Элементы, СтрокаПараметра) Экспорт
	
	Подсказка = "";
	Строки = Новый Массив;
	ЕстьДругиеПараметры = Ложь;
	
	Сч = 0;
	Для Каждого Стр Из СтрокаПараметра.ПараметрыМодификации Цикл
		Если Стр.Значение.Представление <> Неопределено Тогда
			
			Если Сч < 2 И Стр.Значение.БыстрыйДоступ Тогда
				Если Сч > 0 Тогда
					Строки.Добавить(Символы.ПС);
				КонецЕсли;
				Строки.Добавить(Новый ФорматированнаяСтрока(Стр.Значение.Представление,,,,Стр.Ключ));
				Строки.Добавить(": " + Строка(Стр.Значение.Значение));
				Сч = Сч + 1;
			Иначе
				ЕстьДругиеПараметры = Истина;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьДругиеПараметры Тогда
		Строки.Добавить(" ");
		Строки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Еще...'"),,,,"ДругиеПараметры"));
	КонецЕсли;
	
	Если Строки.Количество() = 0 Тогда
		Возврат Ложь;
	Иначе
		Элемент = Элементы[СтрокаПараметра.ИмяЭлементаФормыПараметра];
		Элемент.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(Строки);
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ОписаниеОбязательногоПоляДокумента(ИмяПоля, ПутьКРеквизиту) Экспорт
	Возврат Новый Структура("ИмяПоля, ПутьКРеквизиту", ИмяПоля, ПутьКРеквизиту);
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Создает описание расчетного документа.
// Структура с полями, которые содержат имена таблиц данных формы документа
//		НачисленияИмя
//		НачисленияПерерасчетИмя
//		НачисленияПоДоговорамИмя
//		УдержанияИмя
//		НДФЛИмя
//		ВзносыИмя
//		ПогашениеЗаймовИмя.
// 
Функция ОписаниеЗагрузочногоДокумента() Экспорт
	
	ПоляОписания = 
	"МесяцНачисленияИмя,
	|ПериодРегистрацииВШапке,
	|ДатаНачалаИмя,
	|ДатаОкончанияИмя,
	|НачисленияИмя,
	|ОбязательныеПоля,
	|ПроверяемыеПериоды,
	|ДатаНачалаСобытияИмя,
	|ЭтоЗагрузкаДанных,
	|ОписанияТаблиц";
	
	Описание = Новый Структура(ПоляОписания);
	Описание.МесяцНачисленияИмя = "МесяцНачисления";
	Описание.ЭтоЗагрузкаДанных = Истина;
	
	// Обязательные поля описываются в виде массива описаний.
	// Обязательное поле по умолчанию - Организация.
	Описание.ОбязательныеПоля = Новый Массив;
	Описание.ОбязательныеПоля.Добавить(ОписаниеОбязательногоПоляДокумента("Организация", "Объект.Организация"));
	
	// Зависимости периодов(дата начала периода не может быть больше даты окончания).
	Описание.ПроверяемыеПериоды = Новый Массив;
	
	Описание.ОписанияТаблиц = Новый Структура;
	
	Возврат Описание;
	
КонецФункции

Функция ОписаниеТаблицыЗагрузочныхДанных() Экспорт
	
	ОписаниеТаблицы = Новый Структура(
	"ИмяТаблицы,
	|ИмяПоляДляВставкиПоказателей,
	|СодержитПолеСотрудник,
	|ИмяРеквизитаСотрудник,
	|ПутьКДанным,
	|ИмяРеквизитаПериод,
	|ПроверяемыеРеквизиты,
	|ИмяРеквизитаДатаНачала,
	|ИмяРеквизитаДатаОкончания,
	|ИмяПоляОклад");
	
	ОписаниеТаблицы.СодержитПолеИсходныйДокумент = Ложь;
	
	ОписаниеТаблицы.ИмяТаблицы 						= "Начисления";
	ОписаниеТаблицы.ИмяПоляДляВставкиПоказателей 	= "";
	ОписаниеТаблицы.СодержитПолеФизическоеЛицо 		= Ложь;
	ОписаниеТаблицы.ИмяРеквизитаФизическоеЛицо 		= "ФизическоеЛицо";
	ОписаниеТаблицы.ПутьКДанным 					= "Объект.Начисления";
	ОписаниеТаблицы.ИмяРеквизитаДатаНачала 			= "ДатаНачала";
	ОписаниеТаблицы.ИмяРеквизитаДатаОкончания 		= "ДатаОкончания";
	ОписаниеТаблицы.ИмяРеквизитаПериод 				= "ПериодРегистрации";
	ОписаниеТаблицы.ИмяПоляОклад 					= "Оклад";
	
	
	Возврат ОписаниеТаблицы;
	
КонецФункции

#КонецОбласти