#Область СлужебныеПроцедурыИФункции

Функция ИспользоватьМногопотоковоеЗаполнениеДокументов() Экспорт 
	
	
КонецФункции

Функция НастройкиМногопотоковогоЗаполненияДокументов() Экспорт
	
	
КонецФункции

Процедура ПодготовитьДанныеДляЗаполнения(ОписаниеДокумента, Организация, МесяцНачисления, ДополнительныеПараметры) Экспорт 
	
	
	
КонецПроцедуры

Процедура ОжидатьЗавершенияФоновыхЗаданий(СписокЗаданий, НевыполненныеЗадания)
	
	
КонецПроцедуры

Процедура РассчитатьПакетФизическихЛиц(ОписаниеДокумента, Организация, МесяцНачисления, СписокЗаданий, ВыполняемыеЗадания, ДополнительныеПараметры)
	
	
КонецПроцедуры

Процедура СформироватьВременныеТаблицыФизическихЛиц(ИменаВТ, МенеджерВременныхТаблиц, ФизическиеЛица, ФизическиеЛицаДополнительныйДоход = Неопределено) Экспорт
	
	
КонецПроцедуры

#КонецОбласти
