
#Область СлужебныеПроцедурыИФункции

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	// Основной раздел Бюджетирование
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийПоСтатьям, "АнализПоЗатратамНаПерсонал");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.АнализБюджетовПрогнозов, "Важный");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РасчетыПоказателейБюджета, "РасчетыПоказателейБюджетаПлоский");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.АнализБюджетовПрогнозов, "Важный");

	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РасчетыПоказателейБюджета, "РасчетыПоказателейБюджетаСГруппировками");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.АнализБюджетовПрогнозов, "Важный");
	
	// Формируем см. также раздела Зарплата.
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализНачисленийПоСтатьям, "АнализПоЗатратамНаПерсонал");
	Вариант.Размещение.Очистить();
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.АнализБюджетовПрогнозов, "СмТакже");
	
КонецПроцедуры

#Область УстаревшиеПроцедурыИФункции

// Устарела. Следует отказаться от использования.
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	Возврат;
КонецПроцедуры

#КонецОбласти

#КонецОбласти
