
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("РегистрСведений.СтавкиНалогов.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ОткрытьФорму("РегистрСведений.СтавкиНалогов.ФормаСписка",
					, 
					, 
					, 
					, 
					ПараметрыВыполненияКоманды.НавигационнаяСсылка);

КонецПроцедуры
