

&НаСервере
Процедура ИнициализироватьСписок()
	
	//УстановитьОтборСПометкойУдаления(ЭтотОбъект, Ложь);

	//СКД = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ПолучениеВерсийОбъекта");
	//
	//КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	//ИсточникДоступныхНастроекКомпоновкиДанных = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД);
	//КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроекКомпоновкиДанных);
	//
	//АдресСКД = ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);
	//АдресНастроекСКД = ПоместитьВоВременноеХранилище(КомпоновщикНастроек.ПолучитьНастройки(), УникальныйИдентификатор);
	//Список.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("АдресСКД", АдресСКД);
	//Список.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("АдресНастроекСКД", АдресНастроекСКД);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоВладельцу(Форма, СписокВладельцев = Неопределено)

	Элементы = Форма.Элементы;
	Список = Форма.Список; 
	
	Если СписокВладельцев = Неопределено Тогда
		СписокОтобранныхВладельцев = Новый Массив();
		СписокОтобранныхВладельцев.Добавить(Форма.Отборы.Владелец); 
		ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВСписке.Равно;
	ИначеЕсли ТипЗнч(Форма.Владельцы) = Тип("ФиксированныйМассив") Тогда 
		ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВСписке;
		СписокОтобранныхВладельцев = Новый Массив(Форма.Владельцы);	
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Владелец", СписокОтобранныхВладельцев, Истина);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыПараметровФормы()

	СтруктураОтборов = Новый Структура;
	СтруктураОтборов.Вставить("ПоВладельцу",  Ложь);
	СтруктураОтборов.Вставить("ТипВладелеца", Неопределено);
	
	Если Параметры.Отбор.Свойство("ПоВладельцу") Тогда
		СтруктураОтборов.ПоВладельцу = Параметры.Отбор.ПоВладельцу;
		Параметры.Отбор.Удалить("ПоВладельцу");
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("ТипВладелеца") Тогда
		СтруктураОтборов.ТипВладелеца = Параметры.Отбор.ТипВладелеца;
		ВладельцыОтбора = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Параметры.Отбор.ТипВладелеца);
		Владельцы = Новый ФиксированныйМассив(ВладельцыОтбора);
		Параметры.Отбор.Удалить("ТипВладелеца");
		ИспользоватьОтборПоТипуВладельца = Истина; 
	КонецЕсли;
	
	Отборы = Новый ФиксированнаяСтруктура(СтруктураОтборов);
	
	Если СтруктураОтборов.ПоВладельцу И ИспользоватьОтборПоТипуВладельца = Истина Тогда
		УстановитьОтборПоВладельцу(ЭтотОбъект, Владельцы);   
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//СтруктураПараметровФормы = Новый Структура("РежимВыбора,МножественныйВыбор,ЗакрыватьПриВыборе,ОбъектВерсионирования,ПоВладельцу,ТипВладелеца,отбор");
	//ЗаполнитьЗначенияСвойств(СтруктураПараметровФормы, Параметры);
	//
	//ПараметрыФормы = Новый ФиксированнаяСтруктура(СтруктураПараметровФормы);
	//
	//ИнициализироватьСписок();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ФормаКоманднаяПанель;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//УстановитьОтборыПараметровФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	ОповеститьОВыборе(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОповеститьОВыборе(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//Вставить содержимое обработчика
КонецПроцедуры
