
#Область ПроцедурыИФункцииИспользуемыеПриКонструированииЗапросов

// Возвращает фрагмент текста запроса, отделяющего один запрос от другого.
//
Функция РазделительЗапросов() Экспорт
	
	Возврат "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
КонецФункции

#КонецОбласти 

#Область УправлениеДоступом

Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	БюджетированиеРасширенный.ПриЗаполненииВидовДоступа(ВидыДоступа);
	
КонецПроцедуры

Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	БюджетированиеРасширенный.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание);
	
КонецПроцедуры

Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	БюджетированиеРасширенный.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	
КонецПроцедуры

Процедура ПриЗаполненииОграниченияДоступа(Список, Ограничение) Экспорт
	
	БюджетированиеРасширенный.ПриЗаполненииОграниченияДоступа(Список, Ограничение);
	
КонецПроцедуры

Процедура ПриЗаполненииИспользованияВидаДоступа(ИмяВидаДоступа, Использование) Экспорт
	
	БюджетированиеРасширенный.ПриЗаполненииИспользованияВидаДоступа(ИмяВидаДоступа, Использование);
	
КонецПроцедуры

Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт

	БюджетированиеРасширенный.ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления);

КонецПроцедуры

#КонецОбласти 

#Область БлокФункцийПолученияЗначенийПоУмолчанию

Процедура ПолучитьЗначенияПоУмолчанию(ЗаполняемыеЗначения, ДатаЗначений) Экспорт
	БюджетированиеРасширенный.ПолучитьЗначенияПоУмолчанию(ЗаполняемыеЗначения, ДатаЗначений);
КонецПроцедуры

// Массив поддерживаемых идентификаторов значений по умолчанию.
Функция СписокДоступныхЗначенийПоУмолчанию() Экспорт
	Возврат БюджетированиеРасширенный.СписокДоступныхЗначенийПоУмолчанию();
КонецФункции

#КонецОбласти

#Область УправлениеОтборамиВФормахСДинамическимСписком

Процедура НастроитьМодифицирующийПараметрОтбора(СтрокаПараметра, Список, МетаданныеОбъекта, Элементы) Экспорт
	БюджетированиеРасширенный.НастроитьМодифицирующийПараметрОтбора(СтрокаПараметра, Список, МетаданныеОбъекта, Элементы);
КонецПроцедуры

Процедура ДополнитьОписаниеМодифицирующегоПараметраОтбора(ИмяПараметра, ОписаниеПараметра, ИмяМодификации) Экспорт
	БюджетированиеРасширенный.ДополнитьОписаниеМодифицирующегоПараметраОтбора(
		ИмяПараметра, ОписаниеПараметра, ИмяМодификации);
КонецПроцедуры

#КонецОбласти