
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	Бюджетирование.ЗаполнитьНаборыЗначенийДоступа(ЭтотОбъект, Таблица);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Вставить содержимое обработчика.
КонецПроцедуры 

Процедура ПриКопировании(ОбъектКопирования)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// регистр КоэффициентыНачислений
	Движения.СтавкиНалогов.Записывать 	= Истина;
	Движение 							= Движения.СтавкиНалогов.Добавить();
	Движение.Сценарий 					= Сценарий;
	Движение.Период 					= Дата;
	Движение.ВидВнебюджетногоФонда		= ВидВнебюджетногоФонда;
	Движение.СтавкаНалога 				= СтавкаНалога;
	Движение.ГраницаНалога 				= ГраницаНалога;
	Движение.СтавкаНалогаПослеГраницы 	= СтавкаНалогаПослеГраницы;
	Движение.СтавкаНалогаПрочее 		= СтавкаНалогаПрочее;
	Движение.СтавкаНалогаКорректировка 	= СтавкаНалогаКорректировка;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры и функции.





#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
