

#Область СлужебныеПроцедурыИФункции

Функция ПозицииШтатногоРасписанияПодразделения(Знач ПозицииШтатногоРасписания) Экспорт
	
	Если ТипЗнч(ПозицииШтатногоРасписания) = Тип("Массив") Тогда
		СписокПозицийШтатногоРасписания = ПозицииШтатногоРасписания;
	Иначе
		СписокПозицийШтатногоРасписания = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПозицииШтатногоРасписания);
	КонецЕсли;
	
	
	Возврат Бюджетирование.ПозицииШтатногоРасписанияПодразделения(СписокПозицийШтатногоРасписания);
	
КонецФункции

Функция СоответствиеПозицийШтатногоРасписанияПодразделений(Знач Подразделение, Знач ПозицииШтатногоРасписания) Экспорт

	Если ТипЗнч(ПозицииШтатногоРасписания) = Тип("Массив") Тогда
		СписокПозицийШтатногоРасписания = ПозицииШтатногоРасписания;
	Иначе
		СписокПозицийШтатногоРасписания = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПозицииШтатногоРасписания);
	КонецЕсли;
	
	Возврат Бюджетирование.ПринадлежностьПозицииШтатногоРасписанияПодразделению(Подразделение, СписокПозицийШтатногоРасписания);

КонецФункции
	
#КонецОбласти