#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем МенеджерВременныхТаблиц;
Перем МесяцНачисления;
Перем МесяцыРасчета;
Перем ПериодРасчета;
Перем Организация;
Перем Подразделение;
Перем МестоВозникновенияЗатрат;
Перем Сценарий;
Перем ВременныйРегистратор;
Перем НаборыЗаписей;
Перем НаборыЗаписейНакопляемые;
Перем РасчетБазыНачислений;
Перем РасчетОдногоМесяца;
Перем НастройкиУчета; 
Перем ВидРасчета;
Перем ЭтоРасчетРезерва;
Перем ИсточникРасчета;

Перем ОтборВЗапросахПоПодразделению;
Перем ОтборВЗапросахПоМестуВозникновенияЗатрат;
Перем ОтборВЗапросахПоФизическимЛицам;

Перем ВычеркиваемыеСтроки;
Перем ОпределяющиеПоказатели;
Перем ДатыНачалаСобытия;
Перем ВычеркнутыеПериоды;

Перем РасчитанныеПоказатели Экспорт;
Перем РезультатыРасчетов Экспорт;

Перем ИсключаемыйРегистратор Экспорт;
Перем ВызыватьИсключение Экспорт;

Перем НастройкиРасчета Экспорт;
Перем НастройкиНачислений Экспорт;
Перем НастройкиДатаВыплатыБюджетирования;

Перем ПересчетФизическихЛиц;
Перем ФизлицаПоПериодам;

Перем ДополнительныеСвойства Экспорт;

Перем Начисления;
Перем ВидыРасчетаНачислений;
//Перем ТаблицаНалогов;

Перем ФильтрПолученияПериодическихДанныхФизическихЛиц;
Перем ТаблицаПолученияПериодическихДанныхФизическихЛиц;

Перем СписокФизическихЛиц;
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ИнициализацияОбъекта

// Инициализация менеджера расчета показателей.
// Предназначен для служебного использования.
// Потребителям вместо него рекомендуется использовать РасчетБюджетированиеРасширенный.СоздатьМенеджерРасчета.
//
// Параметры
//	ПериодРасчета - тип СтандартныйПериод, период начисления показателей.
//	ОрганизацияПараметр - тип СправочникСсылка.Организации.
//
Процедура Инициализировать(ПериодРасчетаПараметр, ПараметрыИнициализации) Экспорт
	
	ПериодРасчета = ПериодРасчетаПараметр; 
	
	ВидРасчета 			 = ПараметрыИнициализации.ВидРасчета;
	Сценарий 			 = ПараметрыИнициализации.Сценарий; 
	
	ЭтоРасчетРезерва = Неопределено;
	Если Не ПараметрыИнициализации.Свойство("ЭтоРасчетРезерва", ЭтоРасчетРезерва)
			ИЛИ ЭтоРасчетРезерва = Неопределено Тогда
		ЭтоРасчетРезерва = Ложь;		
	Иначе	
		ЭтоРасчетРезерва = ПараметрыИнициализации.ЭтоРасчетРезерва;
	КонецЕсли;	
	
	МесяцНачисления 	 = НачалоМесяца(ПериодРасчета.ДатаНачала);
	
	Если ЭтоРасчетРезерва Тогда
		ИсточникРасчета  = ПараметрыИнициализации.ИсточникРасчета;
	КонецЕсли;
	
	Пока МесяцНачисления <= ПериодРасчета.ДатаОкончания Цикл
		МесяцыРасчета.Добавить(МесяцНачисления);
		МесяцНачисления = ДобавитьМесяц(МесяцНачисления, 1);
	КонецЦикла;
	
	Организация = ПараметрыИнициализации.Организация; 
	
	РасчитанныеПоказатели = Новый Структура(
		"Начисления,
		|Взносы,
		|");
		
	НастройкиРасчета = Новый Структура(
		"РассчитыватьНачисления,
		|РассчитыватьВзносы,
		|РасчетПоказателей,
		|ФизическиеЛица,
		|");
	

	НастройкиНачислений = Новый Структура(
		"РассчитыватьНачисления,
		|");
	
	УстановитьНастройкиРасчетаПоУмолчанию();
	
	РасчитанныеПоказатели.Взносы = ТаблицаВзносы();
	
	Если Не ЭтоРасчетРезерва Тогда
		РасчитанныеПоказатели.Начисления = ТаблицаНачислений();
		ПересчетФизическихЛиц            = ТаблицаПересчетаФизическихЛиц(); 
	Иначе
		Если ВидРасчета = Перечисления.ВидыРасчетаБюджетныхПоказателей.ПоОплате Тогда
			РасчитанныеПоказатели.Начисления           = ТаблицаНачислений();
			НастройкиРасчета.РассчитыватьНачисления    = Ложь;
			НастройкиНачислений.РассчитыватьНачисления = Ложь;
		Иначе
			НастройкиРасчета.РассчитыватьНачисления    = Истина;
			НастройкиНачислений.РассчитыватьНачисления = Истина;
		КонецЕсли;
		НастройкиРасчета.РассчитыватьВзносы = Истина;
		НастройкиРасчета.РасчетПоказателей  = Истина;
		НастройкиРасчета.ФизическиеЛица     = Неопределено;
	КонецЕсли;	
		
	РезультатыРасчетов = ОбщегоНазначения.СкопироватьРекурсивно(РасчитанныеПоказатели);
	
КонецПроцедуры

// Возвращает структуру НастройкиРасчета, определяющую поведение менеджера расчета, в положение по умолчанию.
//
Процедура УстановитьНастройкиРасчетаПоУмолчанию() Экспорт
		
	НастройкиРасчета.РассчитыватьНачисления = Истина;
	НастройкиРасчета.РассчитыватьВзносы = Истина;
	НастройкиРасчета.РасчетПоказателей = Истина;
	НастройкиРасчета.ФизическиеЛица = Неопределено;
	
	НастройкиНачислений.РассчитыватьНачисления = Истина;
	
КонецПроцедуры

// Устанавливает менеджер временных таблиц, в том случае если необходимо работать с уже существующими временными таблицами.
//
// Параметры
//	МенеджерВременныхТаблицПараметр - тип МенеджерВременныхТаблиц.
//
Процедура УстановитьМенеджерВременныхТаблиц(МенеджерВременныхТаблицПараметр) Экспорт
	МенеджерВременныхТаблиц = МенеджерВременныхТаблицПараметр;
КонецПроцедуры

#КонецОбласти

#Область ОповещенияСообщенияСлужебные

Процедура ОтправитьОповещениеПолучателю(Параметр1, Параметр2)
	
	Сообщение = Новый СообщениеПользователю();
    Сообщение.Текст = НСтр("ru = 'Параметр1 / Параметр2 : ")
						     + Параметр1 + " / " + Параметр2;
    Сообщение.Поле = "ПериодРасчета";
    Сообщение.УстановитьДанные(ЭтотОбъект);
    Сообщение.Сообщить();
	
КонецПроцедуры	

#КонецОбласти

#Область КонструкторыКоллекций

Функция ТаблицаФизическихЛиц() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ФизическиеЛица", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	Таблица.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	Таблица.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));
	
	Возврат Таблица;
	
КонецФункции

Функция ТаблицаНачислений() Экспорт
		
	Возврат Обработки.МенеджерРасчетаБюджетирования.ТаблицаНачислений();
	
КонецФункции

Функция ТаблицаВзносы() Экспорт
		
	Возврат Обработки.МенеджерРасчетаБюджетирования.ТаблицаВзносы();
	
КонецФункции

//Функция ТаблицаНалогов() Экспорт

//	Возврат Обработки.МенеджерРасчетаБюджетирования.ТаблицаНалогов();
//	
//КонецФункции	

#КонецОбласти

#Область ЗаполнениеДокументаПолностью

// Заполняет документ, выполняющий начисление показателей.
// Состав заполняемых коллекций определяется структурой НастройкиРасчета.
// Если НастройкиРасчета.СохранятьИсправления = Истина, 
//	то исправленные строки, содержащиеся в коллекциях объекта Показатели, будут сохранены.
// Для расчета полученных коллекций необходимо выполнить РассчитатьПоказатели().
//
// Параметры
//	ТаблицаСотрудников - тип ТаблицаЗначений, см. ТаблицаСотрудников()
//	Отборы - тип Структура, см. СоздатьОтборы(), необязательный
//
Процедура ЗаполнитьПоказателиОтбора(ТаблицаСотрудников, ОтборМенеджераРасчета = Неопределено, НачисленияПериоды = Неопределено) Экспорт
	
	Если Не ОтборМенеджераРасчета = Неопределено И ТипЗнч(ОтборМенеджераРасчета) = Тип("Структура") Тогда
		
		Подразделение = Неопределено;
		Если ОтборМенеджераРасчета.Свойство("Подразделение", Подразделение) И Не Подразделение = Неопределено Тогда
			ОтборВЗапросахПоПодразделению = Истина;
		КонецЕсли;
		
		МестоВозникновенияЗатрат = Неопределено;
		Если ОтборМенеджераРасчета.Свойство("МестоВозникновенияЗатрат", МестоВозникновенияЗатрат) И Не МестоВозникновенияЗатрат = Неопределено Тогда
			ОтборВЗапросахПоМестуВозникновенияЗатрат = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ТаблицаСотрудников)=Тип("ТаблицаЗначений") И ТаблицаСотрудников.Количество() > 0 Тогда
		
		ОтборВЗапросахПоФизическимЛицам = Истина;
		
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

 #Область РасчетВсехКоллекций

Процедура РассчитатьПоказатели() Экспорт
	
	//ЗаполнитьТаблицыПересчетаПоИсточникамИзменений();
	//ЗаполнитьВыполняемыеДействияБухучетаПриРасчетеКоллекций();

	Если ВидРасчета = Перечисления.ВидыРасчетаБюджетныхПоказателей.ПоНачислению
			ИЛИ ВидРасчета = Перечисления.ВидыРасчетаБюджетныхПоказателей.ПустаяСсылка() Тогда
		Если ЭтоРасчетРезерва Тогда
			РассчитатьНачисленияРезерваСлужебный();		
		Иначе		
			РассчитатьНачисленияПоказателейСлужебный();
		КонецЕсли;	
	Иначе
		Если ЭтоРасчетРезерва Тогда
			РассчитатьОплатуРезерваСлужебный();
		Иначе	
			РассчитатьОплатуПоказателейСлужебный();
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область КонструкторыКоллекций

Функция СоздатьОтборы() Экспорт
	
	Отбор = Новый Структура(
		"Подразделение, МестоВозникновенияЗатрат");
		
	Возврат Отбор;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Область ЗначенияПоказателей

#Область ЗначенияПоказателейНачислений

#Область РасчетОплатыПоказателей

Процедура РассчитатьОплатуПоказателейСлужебный()

	ИмяЗамера = "РасчетПоказателейБюджетовПрогнозов.НачислитьПоказатели";
	Замер = НачатьЗамерВремени();
	
	ОплатыНачисленийФОТ();
	
	ОплатыНачисленийПремий();

	ОплатыНачисленийВзносов();
	
	ЗакончитьЗамерВремени(ИмяЗамера, Замер);
	
КонецПроцедуры

Процедура РассчитатьОплатуРезерваСлужебный()

	ИмяЗамера = "РасчетПоказателейБюджетовПрогнозов.ОплатаВзносовРезерва";
	Замер = НачатьЗамерВремени();
	
	РассчитатьОплатуСтраховыхВзносовРезерва();
	
	ЗакончитьЗамерВремени(ИмяЗамера, Замер);
	
КонецПроцедуры	

#КонецОбласти

#Область РасчетНачисленийПоказателей

Процедура РассчитатьНачисленияРезерваСлужебный()

	ИмяЗамера = "РасчетПоказателейБюджетовПрогнозов.НачислитьРезерв";
	Замер = НачатьЗамерВремени();
	
	РассчитатьНачисленияСтраховыхВзносовРезерва();
	
	ЗакончитьЗамерВремени(ИмяЗамера, Замер);
	
КонецПроцедуры

Процедура РассчитатьНачисленияПоказателейСлужебный()
	
	ИмяЗамера = "РасчетПоказателейБюджетовПрогнозов.РассчитатьПоказатели";
	Замер = НачатьЗамерВремени();
	
	РассчитатьНачисления();
	
	РассчитатьПремии();
	
	Если Сценарий.ВидыБюджетногоАнализа = Перечисления.ВидыБюджетногоАнализа.Бюджет Тогда
		РассчитатьВзносыБюджета();
	Иначе
		РассчитатьВзносыПрогноза();
	КонецЕсли;	
	
	ЗакончитьЗамерВремени(ИмяЗамера, Замер);
	
КонецПроцедуры

#КонецОбласти

#Область РасчетОплатНачисленийФОТ

Процедура ОплатыНачисленийФОТ()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяЗамера = "РасчетПоказателейБюджетовПрогнозов.РасчетЕжемесячныхПремий";
	Замер = НачатьЗамерВремени();
	
	ПодготовитьТаблицуФизлицПоПериодам(); 
	
	ДопУсловие = "";
	
	Если ОтборВЗапросахПоПодразделению И ЗначениеЗаполнено(Подразделение) Тогда
		ДопУсловие = ДопУсловие + "
								   |				И Подразделение = &Подразделение ";
	КонецЕсли;
	
	Если ОтборВЗапросахПоМестуВозникновенияЗатрат И ЗначениеЗаполнено(МестоВозникновенияЗатрат) Тогда
		ДопУсловие = ДопУсловие + "
								   |				И МестоВозникновенияЗатрат = &МестоВозникновенияЗатрат ";
	КонецЕсли;	

	Если ОтборВЗапросахПоФизическимЛицам 
			И Не НастройкиРасчета.ФизическиеЛица = Неопределено 
			И ТипЗнч(НастройкиРасчета.ФизическиеЛица) = Тип("Массив")
			И НастройкиРасчета.ФизическиеЛица.Количество() > 0 Тогда
		ДопУсловие = ДопУсловие + "
								   |				И ФизическоеЛицо В (&ФизическиеЛица) ";
	КонецЕсли;	
	
	Если Не ТипЗнч(ФизлицаПоПериодам) = Тип("ТаблицаЗначений") И Не ФизлицаПоПериодам.Количество() > 0 Тогда 
		ПодготовитьТаблицуФизлицПоПериодам();	
	КонецЕсли;
	
	Для Каждого МесяцЗначение Из МесяцыРасчета Цикл
		
		НастройкиДатаВыплатыБюджетирования = РасчетБюджетированияРасширенныйВызовСервера.СведенияОНастройкахБюджетированиеРасширенная(Организация, НачалоГода(МесяцЗначение), Сценарий);
		
		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТаблицаФизЛицПоПериодам.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ТаблицаФизЛицПоПериодам.Период КАК Период,
			|	ТаблицаФизЛицПоПериодам.Организация КАК Организация,
			|	ТаблицаФизЛицПоПериодам.Подразделение КАК Подразделение,
			|	ТаблицаФизЛицПоПериодам.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
			|	ТаблицаФизЛицПоПериодам.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
			|	ТаблицаФизЛицПоПериодам.КодГрейда КАК КодГрейда,
			|	ТаблицаФизЛицПоПериодам.НачалоПериода КАК НачалоПериода,
			|	ТаблицаФизЛицПоПериодам.ОкончаниеПериода КАК ОкончаниеПериода
			|ПОМЕСТИТЬ ВТТаблицаФизЛицПоПериодам
			|ИЗ
			|	&ТаблицаФизЛицПоПериодам КАК ТаблицаФизЛицПоПериодам
			|ГДЕ
			|	ТаблицаФизЛицПоПериодам.Период = &ДатаСреза";
		
		Запрос.УстановитьПараметр("ТаблицаФизЛицПоПериодам", ФизлицаПоПериодам);
		Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(МесяцЗначение));
		Запрос.Выполнить();
		
		НачисленияИзШтатногоРасписания = Новый Массив;
		НачисленияИзШтатногоРасписания.Добавить(Справочники.ВидыНачислений.Оклад);
		НачисленияИзШтатногоРасписания.Добавить(Справочники.ВидыНачислений.РезервНаСреднийЗаработок);
		НачисленияИзШтатногоРасписания.Добавить(Справочники.ВидыНачислений.ДоплатаЗаФункционалОбразовательнойДеятельности);
		НачисленияИзШтатногоРасписания.Добавить(Справочники.ВидыНачислений.ДоплатаЗаПреподаваниеНаИнЯзыке);
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ДанныеОкладов.Регистратор КАК Регистратор,
		               |	ДанныеОкладов.ПериодМесяц КАК Период,
		               |	ДанныеОкладов.ПериодПланирования КАК ПериодПланирования,
		               |	ДанныеОкладов.Сценарий КАК Сценарий,
		               |	ДанныеОкладов.ВидРасчета КАК ВидРасчета,
		               |	ДанныеОкладов.Организация КАК Организация,
		               |	ДанныеОкладов.Подразделение КАК Подразделение,
		               |	ДанныеОкладов.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
		               |	ДанныеОкладов.ФизическоеЛицо КАК ФизическоеЛицо,
		               |	ДанныеОкладов.ВидВнебюджетногоФонда КАК ВидВнебюджетногоФонда,
		               |	ДанныеОкладов.ТипНалога КАК ТипНалога,
		               |	ДанныеОкладов.ВидНачисления КАК ВидНачисления,
		               |	ДанныеОкладов.ПериодДействия КАК ПериодДействия,
		               |	СУММА(ДанныеОкладов.СуммаПредыдущегоМесяца) КАК СуммаПредыдущегоМесяца,
		               |	СУММА(ДанныеОкладов.УпрСуммаПредыдущегоМесяца) КАК УпрСуммаПредыдущегоМесяца,
		               |	СУММА(ДанныеОкладов.СуммаТекущегоМесяца) КАК СуммаТекущегоМесяца,
		               |	СУММА(ДанныеОкладов.УпрСуммаТекущегоМесяца) КАК УпрСуммаТекущегоМесяца,
		               |	СУММА(ДанныеОкладов.СуммаСледующегоМесяца) КАК СуммаСледующегоМесяца,
		               |	СУММА(ДанныеОкладов.УпрСуммаСледующегоМесяца) КАК УпрСуммаСледующегоМесяца
		               |ПОМЕСТИТЬ ВТДанныеОкладов
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.Регистратор КАК Регистратор,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ПериодМесяц КАК ПериодМесяц,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ПериодПланирования КАК ПериодПланирования,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.Сценарий КАК Сценарий,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ВидРасчета КАК ВидРасчета,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.Организация КАК Организация,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.Подразделение КАК Подразделение,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ВидВнебюджетногоФонда КАК ВидВнебюджетногоФонда,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ТипНалога КАК ТипНалога,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ВидНачисления КАК ВидНачисления,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ПериодДействия КАК ПериодДействия,
		               |		0 КАК СуммаПредыдущегоМесяца,
		               |		0 КАК УпрСуммаПредыдущегоМесяца, 
					   |        ВЫБОР КОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.ВидНачисления В (&НачисленияИзШтатногоРасписания)
					   |        	ТОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.СуммаОборот
					   |			ИНАЧЕ 0
		               |		КОНЕЦ КАК СуммаТекущегоМесяца, 
					   |        ВЫБОР КОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.ВидНачисления В (&НачисленияИзШтатногоРасписания)
					   |        	ТОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.УпрСуммаОборот
					   |			ИНАЧЕ 0
		               |		КОНЕЦ КАК УпрСуммаТекущегоМесяца,
		               |		0 КАК СуммаСледующегоМесяца,
		               |		0 КАК УпрСуммаСледующегоМесяца
		               |	ИЗ
		               |		РегистрНакопления.РасчетыПоказателейБюджетовПрогнозов.Обороты(
		               |				&ДатаНачала,
		               |				&ДатаОкончания,
		               |				Авто,
		               |				Организация = &Организация И Сценарий = &Сценарий
		               |					И ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаБюджетныхПоказателей.ПоНачислению)
		               |					%ДопУсловие% ) КАК РасчетыПоказателейБюджетовПрогнозовОбороты
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.Регистратор,
		               |		&ДатаНачала,
		               |		&ДатаНачала,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.Сценарий,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ВидРасчета,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.Организация,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.Подразделение,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.МестоВозникновенияЗатрат,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ФизическоеЛицо,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ВидВнебюджетногоФонда,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ТипНалога,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ВидНачисления,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ПериодДействия, 
					   |        ВЫБОР КОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.ВидНачисления В (&НачисленияИзШтатногоРасписания)
					   |        	ТОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.СуммаОборот
					   |			ИНАЧЕ 0
		               |		КОНЕЦ, 
					   |        ВЫБОР КОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.ВидНачисления В (&НачисленияИзШтатногоРасписания)
					   |        	ТОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.УпрСуммаОборот
					   |			ИНАЧЕ 0
		               |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0
		               |	ИЗ
		               |		РегистрНакопления.РасчетыПоказателейБюджетовПрогнозов.Обороты(
		               |				ДОБАВИТЬКДАТЕ(&ДатаНачала, МЕСЯЦ, -1),
		               |				ДОБАВИТЬКДАТЕ(&ДатаОкончания, МЕСЯЦ, -1),
		               |				Авто,
		               |				Организация = &Организация И Сценарий = &Сценарий
		               |					И ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаБюджетныхПоказателей.ПоНачислению)
		               |					%ДопУсловие% ) КАК РасчетыПоказателейБюджетовПрогнозовОбороты
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.Регистратор,
		               |		&ДатаНачала,
		               |		&ДатаНачала,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.Сценарий,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ВидРасчета,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.Организация,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.Подразделение,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.МестоВозникновенияЗатрат,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ФизическоеЛицо,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ВидВнебюджетногоФонда,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ТипНалога,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ВидНачисления,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ПериодДействия,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
					   |        ВЫБОР КОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.ВидНачисления В (&НачисленияИзШтатногоРасписания)
					   |        	ТОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.СуммаОборот
					   |			ИНАЧЕ 0
		               |		КОНЕЦ, 
					   |        ВЫБОР КОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.ВидНачисления В (&НачисленияИзШтатногоРасписания)
					   |        	ТОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.УпрСуммаОборот
					   |			ИНАЧЕ 0
		               |		КОНЕЦ
		               |	ИЗ
		               |		РегистрНакопления.РасчетыПоказателейБюджетовПрогнозов.Обороты(
		               |				ДОБАВИТЬКДАТЕ(&ДатаНачала, МЕСЯЦ, 1),
		               |				ДОБАВИТЬКДАТЕ(&ДатаОкончания, МЕСЯЦ, 1),
		               |				Авто,
		               |				Организация = &Организация И Сценарий = &Сценарий
		               |					И ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаБюджетныхПоказателей.ПоНачислению)
		               |					%ДопУсловие% ) КАК РасчетыПоказателейБюджетовПрогнозовОбороты) КАК ДанныеОкладов
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ДанныеОкладов.Регистратор,
		               |	ДанныеОкладов.ПериодМесяц,
		               |	ДанныеОкладов.ПериодПланирования,
		               |	ДанныеОкладов.Сценарий,
		               |	ДанныеОкладов.ВидРасчета,
		               |	ДанныеОкладов.Организация,
		               |	ДанныеОкладов.Подразделение,
		               |	ДанныеОкладов.МестоВозникновенияЗатрат,
		               |	ДанныеОкладов.ФизическоеЛицо,
		               |	ДанныеОкладов.ВидВнебюджетногоФонда,
		               |	ДанныеОкладов.ТипНалога,
		               |	ДанныеОкладов.ВидНачисления,
		               |	ДанныеОкладов.ПериодДействия";
		
		Если ОтборВЗапросахПоПодразделению И ЗначениеЗаполнено(Подразделение) Тогда
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
		КонецЕсли;
		
		Если ОтборВЗапросахПоМестуВозникновенияЗатрат И ЗначениеЗаполнено(МестоВозникновенияЗатрат) Тогда
			Запрос.УстановитьПараметр("МестоВозникновенияЗатрат", МестоВозникновенияЗатрат);
		КонецЕсли;	

		Если ОтборВЗапросахПоФизическимЛицам 
				И Не НастройкиРасчета.ФизическиеЛица = Неопределено 
				И ТипЗнч(НастройкиРасчета.ФизическиеЛица) = Тип("Массив")
				И НастройкиРасчета.ФизическиеЛица.Количество() > 0 Тогда
			Запрос.УстановитьПараметр("ФизическиеЛица", НастройкиРасчета.ФизическиеЛица);
		КонецЕсли;	
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ДопУсловие%", ДопУсловие);
		
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("НачисленияИзШтатногоРасписания", НачисленияИзШтатногоРасписания);
		Запрос.УстановитьПараметр("Организация", 	Организация);
		Запрос.УстановитьПараметр("Сценарий", 		Сценарий);
		Запрос.УстановитьПараметр("ДатаНачала", 	НачалоМесяца(МесяцЗначение));
		Запрос.УстановитьПараметр("ДатаОкончания", 	КонецМесяца(МесяцЗначение));
		Запрос.Выполнить();
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ВТТаблицаФизЛицПоПериодам.ФизическоеЛицо КАК ФизическоеЛицо,
		               |	ВТТаблицаФизЛицПоПериодам.Период КАК Период,
		               |	ВТТаблицаФизЛицПоПериодам.Организация КАК Организация,
		               |	ВТТаблицаФизЛицПоПериодам.Подразделение КАК Подразделение,
		               |	ВТТаблицаФизЛицПоПериодам.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
		               |	ВТТаблицаФизЛицПоПериодам.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
		               |	ВТТаблицаФизЛицПоПериодам.КодГрейда КАК КодГрейда,
					   |    ВТДанныеОкладов.ВидНачисления КАК ВидНачисления,
		               |	ВТТаблицаФизЛицПоПериодам.НачалоПериода КАК НачалоПериода,
		               |	ВТТаблицаФизЛицПоПериодам.ОкончаниеПериода КАК ОкончаниеПериода,
		               |	ВТДанныеОкладов.СуммаПредыдущегоМесяца КАК СуммаПредыдущегоМесяца,
		               |	ВТДанныеОкладов.УпрСуммаПредыдущегоМесяца КАК УпрСуммаПредыдущегоМесяца,
		               |	ВТДанныеОкладов.СуммаТекущегоМесяца КАК СуммаТекущегоМесяца,
		               |	ВТДанныеОкладов.УпрСуммаТекущегоМесяца КАК УпрСуммаТекущегоМесяца,
		               |	ВТДанныеОкладов.СуммаСледующегоМесяца КАК СуммаСледующегоМесяца,
		               |	ВТДанныеОкладов.УпрСуммаСледующегоМесяца КАК УпрСуммаСледующегоМесяца,
		               |	ВЫБОР
		               |		КОГДА МЕСЯЦ(ВТТаблицаФизЛицПоПериодам.Период) = 1
		               |				И ВТДанныеОкладов.СуммаСледующегоМесяца = 0
		               |			ТОГДА ВТДанныеОкладов.СуммаТекущегоМесяца
		               |		КОГДА МЕСЯЦ(ВТТаблицаФизЛицПоПериодам.Период) = 1
		               |				И ВТДанныеОкладов.СуммаСледующегоМесяца > 0
		               |			ТОГДА ВТДанныеОкладов.СуммаТекущегоМесяца * 3 / 10
		               |		КОГДА МЕСЯЦ(ВТТаблицаФизЛицПоПериодам.Период) = 12
		               |			ТОГДА ВТДанныеОкладов.СуммаПредыдущегоМесяца * 7 / 10 + ВТДанныеОкладов.СуммаТекущегоМесяца
		               |		КОГДА НЕ МЕСЯЦ(ВТТаблицаФизЛицПоПериодам.Период) = 12
		               |				И НЕ МЕСЯЦ(ВТТаблицаФизЛицПоПериодам.Период) = 1
		               |			ТОГДА ВЫБОР
		               |					КОГДА ВТДанныеОкладов.СуммаТекущегоМесяца = 0
		               |						ТОГДА 0
		               |					ИНАЧЕ ВТДанныеОкладов.СуммаПредыдущегоМесяца * 7 / 10
		               |				КОНЕЦ + ВЫБОР
		               |					КОГДА ВТДанныеОкладов.СуммаСледующегоМесяца = 0
		               |						ТОГДА ВТДанныеОкладов.СуммаТекущегоМесяца
		               |					ИНАЧЕ ВТДанныеОкладов.СуммаТекущегоМесяца * 3 / 10
		               |				КОНЕЦ
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК СуммаОплаты
		               |ИЗ
		               |	ВТТаблицаФизЛицПоПериодам КАК ВТТаблицаФизЛицПоПериодам
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОкладов КАК ВТДанныеОкладов
		               |		ПО ВТТаблицаФизЛицПоПериодам.ФизическоеЛицо = ВТДанныеОкладов.ФизическоеЛицо
		               |			И ВТТаблицаФизЛицПоПериодам.Период = ВТДанныеОкладов.Период
		               |			И ВТТаблицаФизЛицПоПериодам.Организация = ВТДанныеОкладов.Организация
		               |			И ВТТаблицаФизЛицПоПериодам.Подразделение = ВТДанныеОкладов.Подразделение
		               |			И ВТТаблицаФизЛицПоПериодам.МестоВозникновенияЗатрат = ВТДанныеОкладов.МестоВозникновенияЗатрат";
		
		
		#Область ЗаполнениеТаблицДляПередачиДокументуРасчета
		
		РезультатНачислений = Запрос.Выполнить(); 
			
			УдаляемыеВТТаблицы = Новый Массив;
			УдаляемыеВТТаблицы.Добавить("ВТТаблицаФизЛицПоПериодам");
			УдаляемыеВТТаблицы.Добавить("ВТДанныеОкладов");
			
			Бюджетирование.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдаляемыеВТТаблицы); 
			
		Если Не РезультатНачислений.Пустой() Тогда 
			
			ВыборкаРезультатовНачислений = РезультатНачислений.Выбрать();
			Пока ВыборкаРезультатовНачислений.Следующий() Цикл
				
				ФизическоеЛицо = ВыборкаРезультатовНачислений.ФизическоеЛицо;
				//1. Оклад
				Если Не НачисленияИзШтатногоРасписания.Найти(ВыборкаРезультатовНачислений.ВидНачисления) = Неопределено Тогда 
					НовоеНачисление = РасчитанныеПоказатели.Начисления.Добавить();
					НовоеНачисление.ФизическоеЛицо 				= ФизическоеЛицо;
					НовоеНачисление.МесяцНачисления 			= ВыборкаРезультатовНачислений.Период;  
					НовоеНачисление.ПериодДействия	 			= ВыборкаРезультатовНачислений.НачалоПериода; 
					НовоеНачисление.ПериодРегистрации 			= ВыборкаРезультатовНачислений.НачалоПериода;
		            НовоеНачисление.Организация 				= ВыборкаРезультатовНачислений.Организация;
		            НовоеНачисление.Подразделение 				= ВыборкаРезультатовНачислений.Подразделение;
		            НовоеНачисление.МестоВозникновенияЗатрат	= ВыборкаРезультатовНачислений.МестоВозникновенияЗатрат;
					Если ЗначениеЗаполнено(НовоеНачисление.ПозицияШтатногоРасписания) Тогда
						НовоеНачисление.Должность 				= ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания.Должность;	
					КонецЕсли;	
		            НовоеНачисление.ПозицияШтатногоРасписания 	= ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания;
		            НовоеНачисление.КодГрейда 					= ВыборкаРезультатовНачислений.КодГрейда;
		            НовоеНачисление.ДатаНачала 					= ВыборкаРезультатовНачислений.НачалоПериода;
		            НовоеНачисление.ДатаОкончания 				= ВыборкаРезультатовНачислений.ОкончаниеПериода;
					НовоеНачисление.ВидНачисления 				= ВыборкаРезультатовНачислений.ВидНачисления;
					НовоеНачисление.Сумма	 					= ВыборкаРезультатовНачислений.СуммаОплаты;
					НовоеНачисление.Результат 					= ВыборкаРезультатовНачислений.СуммаОплаты;
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;		
		
		#КонецОбласти
	
	КонецЦикла;	
		
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗакончитьЗамерВремени(ИмяЗамера, Замер);
	
КонецПроцедуры

Процедура ОплатыНачисленийВзносов() 
	
	УстановитьПривилегированныйРежим(Истина);

	ИмяЗамера = "РасчетПоказателейБюджетовПрогнозов.ОплатаВзносовНалогов";
	Замер = НачатьЗамерВремени();
	
	//СписокПремий = Новый Массив;
	//СписокПремий.Добавить(Справочники.ВидыНачислений.ЕжемесячнаяПремия);
	//СписокПремий.Добавить(Справочники.ВидыНачислений.КвартальнаяПремия);
	//СписокПремий.Добавить(Справочники.ВидыНачислений.ПремияЗаПолугодие);
	//СписокПремий.Добавить(Справочники.ВидыНачислений.ГодоваяПремия);
	//СписокПремий.Добавить(Справочники.ВидыНачислений.Зарплата);
    СписокПремий = СписокНачисленийПремий();
    СписокПремий.Добавить(Справочники.ВидыНачислений.Зарплата);
	
	ТипыНалогов = Новый Массив;
	ТипыНалогов.Добавить(Справочники.ВидыНачислений.СтраховыеВзносыВПФР);
	ТипыНалогов.Добавить(Справочники.ВидыНачислений.СтраховыеВзносыВФСС);
	ТипыНалогов.Добавить(Справочники.ВидыНачислений.СтраховыеВзносыВФФОМС);
	ТипыНалогов.Добавить(Справочники.ВидыНачислений.СтраховыхВзносовНаТравматизм);
	
	ПодготовитьТаблицуФизлицПоПериодам(); 
	
	ДопУсловие = "";
	
	Если ОтборВЗапросахПоПодразделению И ЗначениеЗаполнено(Подразделение) Тогда
		ДопУсловие = ДопУсловие + "
								   |				И Подразделение = &Подразделение ";
	КонецЕсли;
	
	Если ОтборВЗапросахПоМестуВозникновенияЗатрат И ЗначениеЗаполнено(МестоВозникновенияЗатрат) Тогда
		ДопУсловие = ДопУсловие + "
								   |				И МестоВозникновенияЗатрат = &МестоВозникновенияЗатрат ";
	КонецЕсли;	

	Если ОтборВЗапросахПоФизическимЛицам 
			И Не НастройкиРасчета.ФизическиеЛица = Неопределено 
			И ТипЗнч(НастройкиРасчета.ФизическиеЛица) = Тип("Массив")
			И НастройкиРасчета.ФизическиеЛица.Количество() > 0 Тогда
		ДопУсловие = ДопУсловие + "
								   |				И ФизическоеЛицо В (&ФизическиеЛица) ";
	КонецЕсли;	
	
	Если Не ТипЗнч(ФизлицаПоПериодам) = Тип("ТаблицаЗначений") И Не ФизлицаПоПериодам.Количество() > 0 Тогда 
		ПодготовитьТаблицуФизлицПоПериодам();	
	КонецЕсли;
	
	Для Каждого МесяцЗначение Из МесяцыРасчета Цикл
		
		НастройкиДатаВыплатыБюджетирования = РасчетБюджетированияРасширенныйВызовСервера.СведенияОНастройкахБюджетированиеРасширенная(Организация, НачалоГода(МесяцЗначение), Сценарий);
		
		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТаблицаФизЛицПоПериодам.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ТаблицаФизЛицПоПериодам.Период КАК Период,
			|	ТаблицаФизЛицПоПериодам.Организация КАК Организация,
			|	ТаблицаФизЛицПоПериодам.Подразделение КАК Подразделение,
			|	ТаблицаФизЛицПоПериодам.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
			|	ТаблицаФизЛицПоПериодам.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
			|	ТаблицаФизЛицПоПериодам.КодГрейда КАК КодГрейда,
			|	ТаблицаФизЛицПоПериодам.НачалоПериода КАК НачалоПериода,
			|	ТаблицаФизЛицПоПериодам.ОкончаниеПериода КАК ОкончаниеПериода
			|ПОМЕСТИТЬ ВТТаблицаФизЛицПоПериодам
			|ИЗ
			|	&ТаблицаФизЛицПоПериодам КАК ТаблицаФизЛицПоПериодам
			|ГДЕ
			|	ТаблицаФизЛицПоПериодам.Период = &ДатаСреза";
		
		Запрос.УстановитьПараметр("ТаблицаФизЛицПоПериодам", ФизлицаПоПериодам);
		Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(МесяцЗначение));
		Запрос.Выполнить();
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	&ДатаНачала КАК Период,
		               |	&ДатаНачала КАК ПериодПланирования,
		               |	РасчетыПоказателейБюджетовПрогнозовОбороты.Сценарий КАК Сценарий,
		               |	РасчетыПоказателейБюджетовПрогнозовОбороты.ВидРасчета КАК ВидРасчета,
		               |	РасчетыПоказателейБюджетовПрогнозовОбороты.Организация КАК Организация,
		               |	РасчетыПоказателейБюджетовПрогнозовОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
		               |	РасчетыПоказателейБюджетовПрогнозовОбороты.Подразделение КАК Подразделение,
		               |	РасчетыПоказателейБюджетовПрогнозовОбороты.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
		               |	РасчетыПоказателейБюджетовПрогнозовОбороты.ВидВнебюджетногоФонда КАК ВидВнебюджетногоФонда,
		               |	РасчетыПоказателейБюджетовПрогнозовОбороты.ТипНалога КАК ТипНалога,
		               |	РасчетыПоказателейБюджетовПрогнозовОбороты.ВидНачисления КАК ВидНачисления,
		               |	РасчетыПоказателейБюджетовПрогнозовОбороты.ПериодДействия КАК ПериодДействия,
		               |	РасчетыПоказателейБюджетовПрогнозовОбороты.СуммаОборот КАК СуммаНалогаПредыдущегоМесяца
					   |ПОМЕСТИТЬ ВТВзносыСПремий
		               |ИЗ
		               |	РегистрНакопления.РасчетыПоказателейБюджетовПрогнозов.Обороты(
		               |			ДОБАВИТЬКДАТЕ(&ДатаНачала, МЕСЯЦ, -1),
		               |			ДОБАВИТЬКДАТЕ(&ДатаОкончания, МЕСЯЦ, -1),
		               |			Авто,
		               |			Организация = &Организация И Сценарий = &Сценарий
					   |                %ДопУсловие%
		               |				И ТипНалога В (&ТипыНалогов)
		               |				И ВидНачисления В (&СписокПремий)) КАК РасчетыПоказателейБюджетовПрогнозовОбороты";
		
		Если ОтборВЗапросахПоПодразделению И ЗначениеЗаполнено(Подразделение) Тогда
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
		КонецЕсли;
		
		Если ОтборВЗапросахПоМестуВозникновенияЗатрат И ЗначениеЗаполнено(МестоВозникновенияЗатрат) Тогда
			Запрос.УстановитьПараметр("МестоВозникновенияЗатрат", МестоВозникновенияЗатрат);
		КонецЕсли;	

		Если ОтборВЗапросахПоФизическимЛицам 
				И Не НастройкиРасчета.ФизическиеЛица = Неопределено 
				И ТипЗнч(НастройкиРасчета.ФизическиеЛица) = Тип("Массив")
				И НастройкиРасчета.ФизическиеЛица.Количество() > 0 Тогда
			Запрос.УстановитьПараметр("ФизическиеЛица", НастройкиРасчета.ФизическиеЛица);
		КонецЕсли;	
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ДопУсловие%", ДопУсловие);
		
		Запрос.Текст = ТекстЗапроса; 
		Запрос.УстановитьПараметр("Организация", 	Организация);
		Запрос.УстановитьПараметр("Сценарий",       Сценарий);
		Запрос.УстановитьПараметр("ТипыНалогов",    ТипыНалогов);
		Запрос.УстановитьПараметр("СписокПремий",   СписокПремий);
		Запрос.УстановитьПараметр("ДатаНачала", 	НачалоМесяца(МесяцЗначение));
		Запрос.УстановитьПараметр("ДатаОкончания", 	КонецМесяца(МесяцЗначение));
		Запрос.Выполнить();
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	НачисленныеНалоги.ПериодМесяц КАК Период,
		               |	НачисленныеНалоги.ПериодПланирования КАК ПериодПланирования,
		               |	НачисленныеНалоги.Сценарий КАК Сценарий,
		               |	НачисленныеНалоги.ВидРасчета КАК ВидРасчета,
		               |	НачисленныеНалоги.Организация КАК Организация,
		               |	НачисленныеНалоги.Подразделение КАК Подразделение,
		               |	НачисленныеНалоги.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
		               |	НачисленныеНалоги.ФизическоеЛицо КАК ФизическоеЛицо,
		               |	СУММА(НачисленныеНалоги.СуммаОкладаТекущегоМесяца) КАК СуммаОкладаТекущегоМесяца,
		               |	СУММА(НачисленныеНалоги.СуммаОкладаПредыдущегоМесяца) КАК СуммаОкладаПредыдущегоМесяца,
		               |	СУММА(НачисленныеНалоги.СуммаСтраховыхВзносовНаТравматизмТекущегоМесяца) КАК СуммаСтраховыхВзносовНаТравматизмТекущегоМесяца,
		               |	СУММА(НачисленныеНалоги.СуммаСтраховыхВзносовНаТравматизмПредыдущегоМесяца) КАК СуммаСтраховыхВзносовНаТравматизмПредыдущегоМесяца,
		               |	СУММА(НачисленныеНалоги.СуммаСтраховыеВзносыВФФОМСТекущегоМесяца) КАК СуммаСтраховыеВзносыВФФОМСТекущегоМесяца,
		               |	СУММА(НачисленныеНалоги.СуммаСтраховыеВзносыВФФОМСПредыдущегоМесяца) КАК СуммаСтраховыеВзносыВФФОМСПредыдущегоМесяца,
		               |	СУММА(НачисленныеНалоги.СуммаСтраховыеВзносыВПФРТекущегоМесяца) КАК СуммаСтраховыеВзносыВПФРТекущегоМесяца,
		               |	СУММА(НачисленныеНалоги.СуммаСтраховыеВзносыВПФРПредыдущегоМесяца) КАК СуммаСтраховыеВзносыВПФРПредыдущегоМесяца,
		               |	СУММА(НачисленныеНалоги.СуммаСтраховыеВзносыВФССТекущегоМесяца) КАК СуммаСтраховыеВзносыВФССТекущегоМесяца,
		               |	СУММА(НачисленныеНалоги.СуммаСтраховыеВзносыВФССПредыдущегоМесяца) КАК СуммаСтраховыеВзносыВФССПредыдущегоМесяца
		               |ПОМЕСТИТЬ ВТНачисленныеНалоги
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ПериодМесяц КАК ПериодМесяц,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ПериодПланирования КАК ПериодПланирования,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.Сценарий КАК Сценарий,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ВидРасчета КАК ВидРасчета,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.Организация КАК Организация,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.Подразделение КАК Подразделение,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
		               |		ВЫБОР
		               |			КОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.ТипНалога = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.ПустаяСсылка)
		               |					И РасчетыПоказателейБюджетовПрогнозовОбороты.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.Оклад)
		               |				ТОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.СуммаОборот
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК СуммаОкладаТекущегоМесяца,
		               |		0 КАК СуммаОкладаПредыдущегоМесяца,
		               |		ВЫБОР
		               |			КОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.ТипНалога = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.СтраховыхВзносовНаТравматизм)
		               |					И РасчетыПоказателейБюджетовПрогнозовОбороты.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.ПустаяСсылка)
		               |				ТОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.СуммаОборот
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК СуммаСтраховыхВзносовНаТравматизмТекущегоМесяца,
		               |		0 КАК СуммаСтраховыхВзносовНаТравматизмПредыдущегоМесяца,
		               |		ВЫБОР
		               |			КОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.ТипНалога = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.СтраховыеВзносыВФФОМС)
		               |					И РасчетыПоказателейБюджетовПрогнозовОбороты.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.ПустаяСсылка)
		               |				ТОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.СуммаОборот
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК СуммаСтраховыеВзносыВФФОМСТекущегоМесяца,
		               |		0 КАК СуммаСтраховыеВзносыВФФОМСПредыдущегоМесяца,
		               |		ВЫБОР
		               |			КОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.ТипНалога = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.СтраховыеВзносыВПФР)
		               |					И РасчетыПоказателейБюджетовПрогнозовОбороты.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.ПустаяСсылка)
		               |				ТОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.СуммаОборот
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК СуммаСтраховыеВзносыВПФРТекущегоМесяца,
		               |		0 КАК СуммаСтраховыеВзносыВПФРПредыдущегоМесяца,
		               |		ВЫБОР
		               |			КОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.ТипНалога = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.СтраховыеВзносыВФСС)
		               |					И РасчетыПоказателейБюджетовПрогнозовОбороты.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.ПустаяСсылка)
		               |				ТОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.СуммаОборот
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК СуммаСтраховыеВзносыВФССТекущегоМесяца,
		               |		0 КАК СуммаСтраховыеВзносыВФССПредыдущегоМесяца
		               |	ИЗ
		               |		РегистрНакопления.РасчетыПоказателейБюджетовПрогнозов.Обороты(
		               |				&ДатаНачала,
		               |				&ДатаОкончания,
		               |				Авто,
		               |				Организация = &Организация И Сценарий = &Сценарий  
					   |                    %ДопУсловие%
		               |					И ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаБюджетныхПоказателей.ПоНачислению)
		               |					И (ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.Оклад)
		               |						ИЛИ ТипНалога В (&ТипыНалогов)
		               |							И ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.ПустаяСсылка))) КАК РасчетыПоказателейБюджетовПрогнозовОбороты
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		&ДатаНачала,
		               |		&ДатаНачала,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.Сценарий,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ВидРасчета,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.Организация,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.Подразделение,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.МестоВозникновенияЗатрат,
		               |		РасчетыПоказателейБюджетовПрогнозовОбороты.ФизическоеЛицо,
		               |		0,
		               |		ВЫБОР
		               |			КОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.ТипНалога = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.ПустаяСсылка)
		               |					И РасчетыПоказателейБюджетовПрогнозовОбороты.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.Оклад)
		               |				ТОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.СуммаОборот
		               |			ИНАЧЕ 0
		               |		КОНЕЦ,
		               |		0,
		               |		ВЫБОР
		               |			КОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.ТипНалога = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.СтраховыхВзносовНаТравматизм)
		               |					И РасчетыПоказателейБюджетовПрогнозовОбороты.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.ПустаяСсылка)
		               |				ТОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.СуммаОборот
		               |			ИНАЧЕ 0
		               |		КОНЕЦ,
		               |		0,
		               |		ВЫБОР
		               |			КОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.ТипНалога = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.СтраховыеВзносыВФФОМС)
		               |					И РасчетыПоказателейБюджетовПрогнозовОбороты.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.ПустаяСсылка)
		               |				ТОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.СуммаОборот
		               |			ИНАЧЕ 0
		               |		КОНЕЦ,
		               |		0,
		               |		ВЫБОР
		               |			КОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.ТипНалога = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.СтраховыеВзносыВПФР)
		               |					И РасчетыПоказателейБюджетовПрогнозовОбороты.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.ПустаяСсылка)
		               |				ТОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.СуммаОборот
		               |			ИНАЧЕ 0
		               |		КОНЕЦ,
		               |		0,
		               |		ВЫБОР
		               |			КОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.ТипНалога = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.СтраховыеВзносыВФСС)
		               |					И РасчетыПоказателейБюджетовПрогнозовОбороты.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.ПустаяСсылка)
		               |				ТОГДА РасчетыПоказателейБюджетовПрогнозовОбороты.СуммаОборот
		               |			ИНАЧЕ 0
		               |		КОНЕЦ
		               |	ИЗ
		               |		РегистрНакопления.РасчетыПоказателейБюджетовПрогнозов.Обороты(
		               |				ДОБАВИТЬКДАТЕ(&ДатаНачала, МЕСЯЦ, -1),
		               |				ДОБАВИТЬКДАТЕ(&ДатаОкончания, МЕСЯЦ, -1),
		               |				Авто,
		               |				Организация = &Организация И Сценарий = &Сценарий  
					   |                    %ДопУсловие%
		               |					И ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаБюджетныхПоказателей.ПоНачислению)
		               |					И (ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.Оклад)
		               |						ИЛИ ТипНалога В (&ТипыНалогов)
		               |							И ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.ПустаяСсылка))) КАК РасчетыПоказателейБюджетовПрогнозовОбороты) КАК НачисленныеНалоги
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	НачисленныеНалоги.ПериодМесяц,
		               |	НачисленныеНалоги.ПериодПланирования,
		               |	НачисленныеНалоги.Сценарий,
		               |	НачисленныеНалоги.ВидРасчета,
		               |	НачисленныеНалоги.Организация,
		               |	НачисленныеНалоги.Подразделение,
		               |	НачисленныеНалоги.МестоВозникновенияЗатрат,
		               |	НачисленныеНалоги.ФизическоеЛицо";
		
		Если ОтборВЗапросахПоПодразделению И ЗначениеЗаполнено(Подразделение) Тогда
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
		КонецЕсли;
		
		Если ОтборВЗапросахПоМестуВозникновенияЗатрат И ЗначениеЗаполнено(МестоВозникновенияЗатрат) Тогда
			Запрос.УстановитьПараметр("МестоВозникновенияЗатрат", МестоВозникновенияЗатрат);
		КонецЕсли;	

		Если ОтборВЗапросахПоФизическимЛицам 
				И Не НастройкиРасчета.ФизическиеЛица = Неопределено 
				И ТипЗнч(НастройкиРасчета.ФизическиеЛица) = Тип("Массив")
				И НастройкиРасчета.ФизическиеЛица.Количество() > 0 Тогда
			Запрос.УстановитьПараметр("ФизическиеЛица", НастройкиРасчета.ФизическиеЛица);
		КонецЕсли;	
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ДопУсловие%", ДопУсловие);
		
		Запрос.Текст = ТекстЗапроса;

		Запрос.УстановитьПараметр("ТипыНалогов", 	ТипыНалогов);
		Запрос.УстановитьПараметр("Организация", 	Организация);
		Запрос.УстановитьПараметр("Сценарий", 		Сценарий);
		Запрос.УстановитьПараметр("ДатаНачала", 	НачалоМесяца(МесяцЗначение));
		Запрос.УстановитьПараметр("ДатаОкончания", 	КонецМесяца(МесяцЗначение));
		Запрос.Выполнить();
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	&ДатаАнализа КАК Период,
		               |	РасчетыПоказателейБюджетовПрогнозовОбороты.Организация КАК Организация,
		               |	РасчетыПоказателейБюджетовПрогнозовОбороты.Подразделение КАК Подразделение,
		               |	РасчетыПоказателейБюджетовПрогнозовОбороты.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
		               |	РасчетыПоказателейБюджетовПрогнозовОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
		               |	СУММА(РасчетыПоказателейБюджетовПрогнозовОбороты.СуммаОборот) КАК СуммаДМСЗаГод
		               |ПОМЕСТИТЬ ВТНачислениеДМСЗаГод
		               |ИЗ
		               |	РегистрНакопления.РасчетыПоказателейБюджетовПрогнозов.Обороты(
		               |			НАЧАЛОПЕРИОДА(&ДатаАнализа, ГОД),
		               |			КОНЕЦПЕРИОДА(&ДатаАнализа, ГОД),
		               |			Авто,
		               |			Организация = &Организация
		               |				И Сценарий = &Сценарий
		               |				И ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаБюджетныхПоказателей.ПоНачислению)
		               |				И ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.ДМС)) КАК РасчетыПоказателейБюджетовПрогнозовОбороты
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РасчетыПоказателейБюджетовПрогнозовОбороты.Организация,
		               |	РасчетыПоказателейБюджетовПрогнозовОбороты.Подразделение,
		               |	РасчетыПоказателейБюджетовПрогнозовОбороты.МестоВозникновенияЗатрат,
		               |	РасчетыПоказателейБюджетовПрогнозовОбороты.ФизическоеЛицо";
		
		Если ОтборВЗапросахПоПодразделению И ЗначениеЗаполнено(Подразделение) Тогда
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
		КонецЕсли;
		
		Если ОтборВЗапросахПоМестуВозникновенияЗатрат И ЗначениеЗаполнено(МестоВозникновенияЗатрат) Тогда
			Запрос.УстановитьПараметр("МестоВозникновенияЗатрат", МестоВозникновенияЗатрат);
		КонецЕсли;	
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ДопУсловие%", ДопУсловие);
		
		Запрос.Текст = ТекстЗапроса;

		Запрос.УстановитьПараметр("Организация", 	Организация);
		Запрос.УстановитьПараметр("Сценарий", 		Сценарий);
		Запрос.УстановитьПараметр("ДатаАнализа", 	НачалоМесяца(МесяцЗначение));
		Запрос.Выполнить();
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	КоэффициентыПремийТекущегоГода.Период КАК Период,
		               |	МАКСИМУМ(КоэффициентыПремийТекущегоГода.КоэффициентСтраховыхВзносовНаТравматизмПервогоГодаБюджетногоЦикла) КАК КоэффициентСтраховыхВзносовНаТравматизмПервогоГодаБюджетногоЦикла,
		               |	МАКСИМУМ(КоэффициентыПремийТекущегоГода.КоэффициентСтраховыеВзносыВПФРПервогоГодаБюджетногоЦикла) КАК КоэффициентСтраховыеВзносыВПФРПервогоГодаБюджетногоЦикла,
		               |	МАКСИМУМ(КоэффициентыПремийТекущегоГода.КоэффициентСтраховыеВзносыВФССПервогоГодаБюджетногоЦикла) КАК КоэффициентСтраховыеВзносыВФССПервогоГодаБюджетногоЦикла,
		               |	МАКСИМУМ(КоэффициентыПремийТекущегоГода.КоэффициентСтраховыеВзносыВФФОМСПервогоГодаБюджетногоЦикла) КАК КоэффициентСтраховыеВзносыВФФОМСПервогоГодаБюджетногоЦикла
		               |ПОМЕСТИТЬ ВТКоэффициентыПервогоГодаБюджетногоЦикла
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		&ДатаСреза КАК Период,
		               |		ВЫБОР
		               |			КОГДА КоэффициентыНачисленийСрезПоследних.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.СтраховыхВзносовНаТравматизм)
		               |					И КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.ПервыйГодБюджетногоЦикла)
		               |				ТОГДА КоэффициентыНачисленийСрезПоследних.Коэффициент
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК КоэффициентСтраховыхВзносовНаТравматизмПервогоГодаБюджетногоЦикла,
		               |		ВЫБОР
		               |			КОГДА КоэффициентыНачисленийСрезПоследних.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.СтраховыеВзносыВПФР)
		               |					И КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.ПервыйГодБюджетногоЦикла)
		               |				ТОГДА КоэффициентыНачисленийСрезПоследних.Коэффициент
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК КоэффициентСтраховыеВзносыВПФРПервогоГодаБюджетногоЦикла,
		               |		ВЫБОР
		               |			КОГДА КоэффициентыНачисленийСрезПоследних.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.СтраховыеВзносыВФСС)
		               |					И КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.ПервыйГодБюджетногоЦикла)
		               |				ТОГДА КоэффициентыНачисленийСрезПоследних.Коэффициент
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК КоэффициентСтраховыеВзносыВФССПервогоГодаБюджетногоЦикла,
		               |		ВЫБОР
		               |			КОГДА КоэффициентыНачисленийСрезПоследних.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.СтраховыеВзносыВФФОМС)
		               |					И КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.ПервыйГодБюджетногоЦикла)
		               |				ТОГДА КоэффициентыНачисленийСрезПоследних.Коэффициент
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК КоэффициентСтраховыеВзносыВФФОМСПервогоГодаБюджетногоЦикла
		               |	ИЗ
		               |		РегистрСведений.КоэффициентыНачислений.СрезПоследних(&ДатаНачалаГода, Сценарий = &Сценарий) КАК КоэффициентыНачисленийСрезПоследних
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		&ДатаСреза,
		               |		0,
		               |		0,
		               |		0,
		               |		0
		               |	ИЗ
		               |		Справочник.Сценарии КАК Сценарий
		               |	ГДЕ
		               |		Сценарий.Ссылка = &Сценарий) КАК КоэффициентыПремийТекущегоГода
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	КоэффициентыПремийТекущегоГода.Период";
		
		Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(МесяцЗначение));
		Запрос.УстановитьПараметр("ДатаНачалаГода", НачалоГода(МесяцЗначение));
		Запрос.УстановитьПараметр("Сценарий",  Сценарий);
		Запрос.Выполнить();
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДанныеФизЛицПоПериодам.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДанныеФизЛицПоПериодам.Период КАК Период,
			|	ДанныеФизЛицПоПериодам.Период КАК ПериодРегистрации,
			|	ДанныеФизЛицПоПериодам.Период КАК МесяцНачисления,
			|	ДанныеФизЛицПоПериодам.Организация КАК Организация,
			|	ДанныеФизЛицПоПериодам.Подразделение КАК Подразделение,
			|	ДанныеФизЛицПоПериодам.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
			|	ДанныеФизЛицПоПериодам.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
			|	ДанныеФизЛицПоПериодам.КодГрейда КАК КодГрейда,
			|	ДанныеФизЛицПоПериодам.НачалоПериода КАК НачалоПериода,
			|	ДанныеФизЛицПоПериодам.ОкончаниеПериода КАК ОкончаниеПериода,
			|	ВЫБОР
			|		КОГДА ВТНачисленныеНалоги.СуммаОкладаТекущегоМесяца ЕСТЬ NULL
			|			ТОГДА 0
			|		ИНАЧЕ ВТНачисленныеНалоги.СуммаОкладаТекущегоМесяца
			|	КОНЕЦ КАК СуммаОкладаТекущегоМесяца,
			|	ВЫБОР
			|		КОГДА ВТНачисленныеНалоги.СуммаОкладаПредыдущегоМесяца ЕСТЬ NULL
			|			ТОГДА 0
			|		ИНАЧЕ ВТНачисленныеНалоги.СуммаОкладаПредыдущегоМесяца
			|	КОНЕЦ КАК СуммаОкладаПредыдущегоМесяца,
			|	ВЫБОР
			|		КОГДА ВТНачисленныеНалоги.СуммаСтраховыхВзносовНаТравматизмТекущегоМесяца ЕСТЬ NULL
			|			ТОГДА 0
			|		ИНАЧЕ ВТНачисленныеНалоги.СуммаСтраховыхВзносовНаТравматизмТекущегоМесяца
			|	КОНЕЦ КАК СуммаСтраховыхВзносовНаТравматизмТекущегоМесяца,
			|	ВЫБОР
			|		КОГДА ВТНачисленныеНалоги.СуммаСтраховыхВзносовНаТравматизмПредыдущегоМесяца ЕСТЬ NULL
			|			ТОГДА 0
			|		ИНАЧЕ ВТНачисленныеНалоги.СуммаСтраховыхВзносовНаТравматизмПредыдущегоМесяца
			|	КОНЕЦ КАК СуммаСтраховыхВзносовНаТравматизмПредыдущегоМесяца,
			|	ВЫБОР
			|		КОГДА ВТНачисленныеНалоги.СуммаСтраховыеВзносыВФФОМСТекущегоМесяца ЕСТЬ NULL
			|			ТОГДА 0
			|		ИНАЧЕ ВТНачисленныеНалоги.СуммаСтраховыеВзносыВФФОМСТекущегоМесяца
			|	КОНЕЦ КАК СуммаСтраховыеВзносыВФФОМСТекущегоМесяца,
			|	ВЫБОР
			|		КОГДА ВТНачисленныеНалоги.СуммаСтраховыеВзносыВФФОМСПредыдущегоМесяца ЕСТЬ NULL
			|			ТОГДА 0
			|		ИНАЧЕ ВТНачисленныеНалоги.СуммаСтраховыеВзносыВФФОМСПредыдущегоМесяца
			|	КОНЕЦ КАК СуммаСтраховыеВзносыВФФОМСПредыдущегоМесяца,
			|	ВЫБОР
			|		КОГДА ВТНачисленныеНалоги.СуммаСтраховыеВзносыВПФРТекущегоМесяца ЕСТЬ NULL
			|			ТОГДА 0
			|		ИНАЧЕ ВТНачисленныеНалоги.СуммаСтраховыеВзносыВПФРТекущегоМесяца
			|	КОНЕЦ КАК СуммаСтраховыеВзносыВПФРТекущегоМесяца,
			|	ВЫБОР
			|		КОГДА ВТНачисленныеНалоги.СуммаСтраховыеВзносыВПФРПредыдущегоМесяца ЕСТЬ NULL
			|			ТОГДА 0
			|		ИНАЧЕ ВТНачисленныеНалоги.СуммаСтраховыеВзносыВПФРПредыдущегоМесяца
			|	КОНЕЦ КАК СуммаСтраховыеВзносыВПФРПредыдущегоМесяца,
			|	ВЫБОР
			|		КОГДА ВТНачисленныеНалоги.СуммаСтраховыеВзносыВФССТекущегоМесяца ЕСТЬ NULL
			|			ТОГДА 0
			|		ИНАЧЕ ВТНачисленныеНалоги.СуммаСтраховыеВзносыВФССТекущегоМесяца
			|	КОНЕЦ КАК СуммаСтраховыеВзносыВФССТекущегоМесяца,
			|	ВЫБОР
			|		КОГДА ВТНачисленныеНалоги.СуммаСтраховыеВзносыВФССПредыдущегоМесяца ЕСТЬ NULL
			|			ТОГДА 0
			|		ИНАЧЕ ВТНачисленныеНалоги.СуммаСтраховыеВзносыВФССПредыдущегоМесяца
			|	КОНЕЦ КАК СуммаСтраховыеВзносыВФССПредыдущегоМесяца,
			|	ВТКоэффициентыПервогоГодаБюджетногоЦикла.КоэффициентСтраховыхВзносовНаТравматизмПервогоГодаБюджетногоЦикла КАК КоэффициентСтраховыхВзносовНаТравматизмПервогоГодаБюджетногоЦикла,
			|	ВТКоэффициентыПервогоГодаБюджетногоЦикла.КоэффициентСтраховыеВзносыВПФРПервогоГодаБюджетногоЦикла КАК КоэффициентСтраховыеВзносыВПФРПервогоГодаБюджетногоЦикла,
			|	ВТКоэффициентыПервогоГодаБюджетногоЦикла.КоэффициентСтраховыеВзносыВФССПервогоГодаБюджетногоЦикла КАК КоэффициентСтраховыеВзносыВФССПервогоГодаБюджетногоЦикла,
			|	ВТКоэффициентыПервогоГодаБюджетногоЦикла.КоэффициентСтраховыеВзносыВФФОМСПервогоГодаБюджетногоЦикла КАК КоэффициентСтраховыеВзносыВФФОМСПервогоГодаБюджетногоЦикла,
			|	ВЫБОР
			|		КОГДА ВТНачислениеДМСЗаГод.СуммаДМСЗаГод ЕСТЬ NULL
			|			ТОГДА 0
			|		ИНАЧЕ ВТНачислениеДМСЗаГод.СуммаДМСЗаГод
			|	КОНЕЦ КАК СуммаДМСЗаГод
			|ИЗ
			|	ВТТаблицаФизЛицПоПериодам КАК ДанныеФизЛицПоПериодам
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленныеНалоги КАК ВТНачисленныеНалоги
			|		ПО ДанныеФизЛицПоПериодам.Период = ВТНачисленныеНалоги.Период
			|			И ДанныеФизЛицПоПериодам.ФизическоеЛицо = ВТНачисленныеНалоги.ФизическоеЛицо
			|			И ДанныеФизЛицПоПериодам.Организация = ВТНачисленныеНалоги.Организация
			|			И ДанныеФизЛицПоПериодам.Подразделение = ВТНачисленныеНалоги.Подразделение
			|			И ДанныеФизЛицПоПериодам.МестоВозникновенияЗатрат = ВТНачисленныеНалоги.МестоВозникновенияЗатрат
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыПервогоГодаБюджетногоЦикла КАК ВТКоэффициентыПервогоГодаБюджетногоЦикла
			|		ПО ДанныеФизЛицПоПериодам.Период = ВТКоэффициентыПервогоГодаБюджетногоЦикла.Период
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачислениеДМСЗаГод КАК ВТНачислениеДМСЗаГод
			|		ПО ДанныеФизЛицПоПериодам.Период = ВТНачислениеДМСЗаГод.Период
			|			И ДанныеФизЛицПоПериодам.ФизическоеЛицо = ВТНачислениеДМСЗаГод.ФизическоеЛицо
			|			И ДанныеФизЛицПоПериодам.Организация = ВТНачислениеДМСЗаГод.Организация
			|			И ДанныеФизЛицПоПериодам.Подразделение = ВТНачислениеДМСЗаГод.Подразделение
			|			И ДанныеФизЛицПоПериодам.МестоВозникновенияЗатрат = ВТНачислениеДМСЗаГод.МестоВозникновенияЗатрат
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТВзносыСПремий.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВТВзносыСПремий.Период КАК Период,
			|	ВТВзносыСПремий.Период КАК ПериодРегистрации,
			|	ВТВзносыСПремий.Период КАК МесяцНачисления,
			|	ВТВзносыСПремий.Организация КАК Организация,
			|	ВТВзносыСПремий.Подразделение КАК Подразделение,
			|	ВТВзносыСПремий.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
			|	ВТТаблицаФизЛицПоПериодам.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
			|	ВТТаблицаФизЛицПоПериодам.ПозицияШтатногоРасписания.Должность КАК Должность,
			|	ВТТаблицаФизЛицПоПериодам.КодГрейда КАК КодГрейда,
			|	ВТВзносыСПремий.ВидВнебюджетногоФонда КАК ВидВнебюджетногоФонда,
			|	ВТВзносыСПремий.ТипНалога КАК ТипНалога,
			|	ВТВзносыСПремий.ВидНачисления КАК ВидНачисления,
			|	ВТВзносыСПремий.ПериодДействия КАК ПериодДействия,
			|	ВТТаблицаФизЛицПоПериодам.НачалоПериода КАК ДатаНачала,
			|	ВТТаблицаФизЛицПоПериодам.ОкончаниеПериода КАК ДатаОкончания,
			|	ВТВзносыСПремий.СуммаНалогаПредыдущегоМесяца КАК Результат,
			|	ВТВзносыСПремий.СуммаНалогаПредыдущегоМесяца КАК Сумма
			|ИЗ
			|	ВТВзносыСПремий КАК ВТВзносыСПремий
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТаблицаФизЛицПоПериодам КАК ВТТаблицаФизЛицПоПериодам
			|		ПО ВТВзносыСПремий.Период = ВТТаблицаФизЛицПоПериодам.Период
			|			И ВТВзносыСПремий.ФизическоеЛицо = ВТТаблицаФизЛицПоПериодам.ФизическоеЛицо
			|			И ВТВзносыСПремий.Организация = ВТТаблицаФизЛицПоПериодам.Организация
			|			И ВТВзносыСПремий.Подразделение = ВТТаблицаФизЛицПоПериодам.Подразделение
			|			И ВТВзносыСПремий.МестоВозникновенияЗатрат = ВТТаблицаФизЛицПоПериодам.МестоВозникновенияЗатрат";
		
		РезультатыЗапросов = Запрос.ВыполнитьПакет();
		
		НалогиВзносы = РезультатыЗапросов[0].Выгрузить();
		ВзносыСПремий = РезультатыЗапросов[1].Выгрузить();
			
		УдаляемыеВТТаблицы = Новый Массив;
		УдаляемыеВТТаблицы.Добавить("ВТТаблицаФизЛицПоПериодам");
		УдаляемыеВТТаблицы.Добавить("ВТНачисленныеНалоги");
		УдаляемыеВТТаблицы.Добавить("ВТКоэффициентыПервогоГодаБюджетногоЦикла");
		УдаляемыеВТТаблицы.Добавить("ВТВзносыСПремий");
			
		Бюджетирование.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдаляемыеВТТаблицы); 
		
		#Область ОплатаВзносов
		
		Для Каждого СтрокаНалогаВзноса Из НалогиВзносы Цикл
		
			МесяцУплатыНалоговСНачисленийДекабря = Неопределено; 
			Если НастройкиДатаВыплатыБюджетирования.Свойство("МесяцУплатыНалоговСНачисленийДекабря", МесяцУплатыНалоговСНачисленийДекабря)
					И Не МесяцУплатыНалоговСНачисленийДекабря = Неопределено Тогда
			КонецЕсли;		
						
			//1. Налог на травматизм
			НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, СтрокаНалогаВзноса); 
			НоваяСтрокаВзносов.МесяцНачисления = СтрокаНалогаВзноса.Период;
			НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыхВзносовНаТравматизм");  
			НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФСС");
					
			Если Месяц(СтрокаНалогаВзноса.Период) = 1 
				И Формат(СтрокаНалогаВзноса.Период, "ДФ=""ММММ""") = Строка(МесяцУплатыНалоговСНачисленийДекабря) Тогда
					
				НоваяСтрокаВзносов.Результат = СтрокаНалогаВзноса.СуммаСтраховыхВзносовНаТравматизмТекущегоМесяца
												* СтрокаНалогаВзноса.КоэффициентСтраховыхВзносовНаТравматизмПервогоГодаБюджетногоЦикла / 100; 
											
			ИначеЕсли Месяц(СтрокаНалогаВзноса.Период) = 1 
				И МесяцУплатыНалоговСНачисленийДекабря = Перечисления.МесяцыГода.Декабрь Тогда
						
				НоваяСтрокаВзносов.Результат = 0; 
												
			ИначеЕсли Месяц(СтрокаНалогаВзноса.Период) = 12 
				И Формат(СтрокаНалогаВзноса.Период, "ДФ=""ММММ""") = Строка(МесяцУплатыНалоговСНачисленийДекабря) Тогда
				
				НоваяСтрокаВзносов.Результат = СтрокаНалогаВзноса.СуммаСтраховыхВзносовНаТравматизмПредыдущегоМесяца
												+ СтрокаНалогаВзноса.СуммаСтраховыхВзносовНаТравматизмТекущегоМесяца;
			Иначе
				НоваяСтрокаВзносов.Результат = СтрокаНалогаВзноса.СуммаСтраховыхВзносовНаТравматизмПредыдущегоМесяца;
			КонецЕсли;	
						
			//1. Налог на ПФР
			НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, СтрокаНалогаВзноса); 
			НоваяСтрокаВзносов.МесяцНачисления = СтрокаНалогаВзноса.Период;
			НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВПФР");  
			НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ПФР");
					
			Если Месяц(СтрокаНалогаВзноса.Период) = 1 
				И Формат(СтрокаНалогаВзноса.Период, "ДФ=""ММММ""") = Строка(МесяцУплатыНалоговСНачисленийДекабря) Тогда
						
				НоваяСтрокаВзносов.Результат = СтрокаНалогаВзноса.СуммаСтраховыеВзносыВПФРТекущегоМесяца
												* СтрокаНалогаВзноса.КоэффициентСтраховыеВзносыВПФРПервогоГодаБюджетногоЦикла / 100; 
											
			ИначеЕсли Месяц(СтрокаНалогаВзноса.Период) = 1 
				И МесяцУплатыНалоговСНачисленийДекабря = Перечисления.МесяцыГода.Декабрь Тогда
						
				НоваяСтрокаВзносов.Результат = 0; 
												
			ИначеЕсли Месяц(СтрокаНалогаВзноса.Период) = 12 
				И Формат(СтрокаНалогаВзноса.Период, "ДФ=""ММММ""") = Строка(МесяцУплатыНалоговСНачисленийДекабря) Тогда
	
				НоваяСтрокаВзносов.Результат = СтрокаНалогаВзноса.СуммаСтраховыеВзносыВПФРПредыдущегоМесяца
													+ СтрокаНалогаВзноса.СуммаСтраховыеВзносыВПФРТекущегоМесяца;
			Иначе
				НоваяСтрокаВзносов.Результат = СтрокаНалогаВзноса.СуммаСтраховыеВзносыВПФРПредыдущегоМесяца;
			КонецЕсли;	
						
			//1. Налог на ФОМС
			НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, СтрокаНалогаВзноса); 
			НоваяСтрокаВзносов.МесяцНачисления = СтрокаНалогаВзноса.Период;
			НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВФФОМС");  
			НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФФОМС");
					
			Если Месяц(СтрокаНалогаВзноса.Период) = 1 
				И Формат(СтрокаНалогаВзноса.Период, "ДФ=""ММММ""") = Строка(МесяцУплатыНалоговСНачисленийДекабря) Тогда
						
				НоваяСтрокаВзносов.Результат = СтрокаНалогаВзноса.СуммаСтраховыеВзносыВФФОМСТекущегоМесяца
												* СтрокаНалогаВзноса.КоэффициентСтраховыеВзносыВФФОМСПервогоГодаБюджетногоЦикла / 100; 
											
			ИначеЕсли Месяц(СтрокаНалогаВзноса.Период) = 1 
				И МесяцУплатыНалоговСНачисленийДекабря = Перечисления.МесяцыГода.Декабрь Тогда
						
				НоваяСтрокаВзносов.Результат = 0; 
												
			ИначеЕсли Месяц(СтрокаНалогаВзноса.Период) = 12 
				И Формат(СтрокаНалогаВзноса.Период, "ДФ=""ММММ""") = Строка(МесяцУплатыНалоговСНачисленийДекабря) Тогда
	
				НоваяСтрокаВзносов.Результат = СтрокаНалогаВзноса.СуммаСтраховыеВзносыВФФОМСПредыдущегоМесяца
												+ СтрокаНалогаВзноса.СуммаСтраховыеВзносыВФФОМСТекущегоМесяца;
			Иначе
				НоваяСтрокаВзносов.Результат = СтрокаНалогаВзноса.СуммаСтраховыеВзносыВФФОМСПредыдущегоМесяца;
			КонецЕсли;	
						
			//1. Налог на ФСС
			НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, СтрокаНалогаВзноса); 
			НоваяСтрокаВзносов.МесяцНачисления = СтрокаНалогаВзноса.Период;
			НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВФСС");  
			НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФСС");
				
			Если Месяц(СтрокаНалогаВзноса.Период) = 1 
				И Формат(СтрокаНалогаВзноса.Период, "ДФ=""ММММ""") = Строка(МесяцУплатыНалоговСНачисленийДекабря) Тогда
						
				НоваяСтрокаВзносов.Результат = СтрокаНалогаВзноса.СуммаСтраховыеВзносыВФССТекущегоМесяца
												* СтрокаНалогаВзноса.КоэффициентСтраховыеВзносыВФССПервогоГодаБюджетногоЦикла / 100; 
											
			ИначеЕсли Месяц(СтрокаНалогаВзноса.Период) = 1 
				И МесяцУплатыНалоговСНачисленийДекабря = Перечисления.МесяцыГода.Декабрь Тогда
						
				НоваяСтрокаВзносов.Результат = 0; 
												
			ИначеЕсли Месяц(СтрокаНалогаВзноса.Период) = 12 
				И Формат(СтрокаНалогаВзноса.Период, "ДФ=""ММММ""") = Строка(МесяцУплатыНалоговСНачисленийДекабря) Тогда
	
				НоваяСтрокаВзносов.Результат = СтрокаНалогаВзноса.СуммаСтраховыеВзносыВФССПредыдущегоМесяца
												+ СтрокаНалогаВзноса.СуммаСтраховыеВзносыВФССТекущегоМесяца;
			Иначе
				НоваяСтрокаВзносов.Результат = СтрокаНалогаВзноса.СуммаСтраховыеВзносыВФССПредыдущегоМесяца;
			КонецЕсли;
			
			//2. Выплаты ДМС
			МесяцПервогоПлатежаЗаДМС = Неопределено; 
			Если НастройкиДатаВыплатыБюджетирования.Свойство("МесяцПервогоПлатежаЗаДМС", МесяцПервогоПлатежаЗаДМС)
					И Не МесяцПервогоПлатежаЗаДМС = Неопределено Тогда
			КонецЕсли;		
			
			МесяцВторогоПлатежаЗаДМС = Неопределено; 
			Если НастройкиДатаВыплатыБюджетирования.Свойство("МесяцВторогоПлатежаЗаДМС", МесяцВторогоПлатежаЗаДМС)
					И Не МесяцВторогоПлатежаЗаДМС = Неопределено Тогда
			КонецЕсли;		
			
			Если Формат(СтрокаНалогаВзноса.Период, "ДФ=""ММММ""") = Строка(МесяцПервогоПлатежаЗаДМС) 
					ИЛИ Формат(СтрокаНалогаВзноса.Период, "ДФ=""ММММ""") = Строка(МесяцВторогоПлатежаЗаДМС) Тогда
				НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, СтрокаНалогаВзноса); 
				НоваяСтрокаВзносов.МесяцНачисления = СтрокаНалогаВзноса.Период;
				НоваяСтрокаВзносов.Должность = СтрокаНалогаВзноса.ПозицияШтатногоРасписания.Должность;
				НоваяСтрокаВзносов.Результат = СтрокаНалогаВзноса.СуммаДМСЗаГод/2;
				НоваяСтрокаВзносов.ВидНачисления = ПредопределенноеЗначение("Справочник.ВидыНачислений.ДМС") ;
			КонецЕсли;
			
		КонецЦикла;
		
		#КонецОбласти
		
		#Область ОплатаВзносовСПремий
		
		Для Каждого СтрокаВзносыСПремии Из ВзносыСПремий Цикл
		
			НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, СтрокаВзносыСПремии); 
				
		КонецЦикла	
		
		#КонецОбласти
			
	КонецЦикла;	
		
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗакончитьЗамерВремени(ИмяЗамера, Замер);
		
КонецПроцедуры	

Процедура ОплатыНачисленийПремий()
	
	УстановитьПривилегированныйРежим(Истина);

	ИмяЗамера = "РасчетПоказателейБюджетовПрогнозов.ОплатаПремий";
	Замер = НачатьЗамерВремени();
	
	Если Не ТипЗнч(ФизлицаПоПериодам) = Тип("ТаблицаЗначений") И Не ФизлицаПоПериодам.Количество() > 0 Тогда 
		ПодготовитьТаблицуФизлицПоПериодам();	
	КонецЕсли;
		
	ДопУсловие = "";
	
	Если ОтборВЗапросахПоПодразделению И ЗначениеЗаполнено(Подразделение) Тогда
		ДопУсловие = ДопУсловие + "
								   |                И Подразделение = &Подразделение ";
	КонецЕсли;
	
	Если ОтборВЗапросахПоМестуВозникновенияЗатрат И ЗначениеЗаполнено(МестоВозникновенияЗатрат) Тогда
		ДопУсловие = ДопУсловие + "
								   |                И МестоВозникновенияЗатрат = &МестоВозникновенияЗатрат ";
	КонецЕсли;	

	Если ОтборВЗапросахПоФизическимЛицам 
			И Не НастройкиРасчета.ФизическиеЛица = Неопределено 
			И ТипЗнч(НастройкиРасчета.ФизическиеЛица) = Тип("Массив")
			И НастройкиРасчета.ФизическиеЛица.Количество() > 0 Тогда
		ДопУсловие = ДопУсловие + "
								   |                И ФизическоеЛицо В (&ФизическиеЛица) ";
	КонецЕсли;	
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Для Каждого МесяцЗначение Из МесяцыРасчета Цикл 
		
		Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ТаблицаФизЛицПоПериодам.ФизическоеЛицо КАК ФизическоеЛицо,
				|	ТаблицаФизЛицПоПериодам.Период КАК Период,
				|	ТаблицаФизЛицПоПериодам.Организация КАК Организация,
				|	ТаблицаФизЛицПоПериодам.Подразделение КАК Подразделение,
				|	ТаблицаФизЛицПоПериодам.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
				|	ТаблицаФизЛицПоПериодам.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
				|	ТаблицаФизЛицПоПериодам.КодГрейда КАК КодГрейда,
				|	ТаблицаФизЛицПоПериодам.НачалоПериода КАК НачалоПериода,
				|	ТаблицаФизЛицПоПериодам.ОкончаниеПериода КАК ОкончаниеПериода
				|ПОМЕСТИТЬ ВТТаблицаФизЛицПоПериодам
				|ИЗ
				|	&ТаблицаФизЛицПоПериодам КАК ТаблицаФизЛицПоПериодам
				|ГДЕ
				|	ТаблицаФизЛицПоПериодам.Период = &ДатаСреза";
			
		Запрос.УстановитьПараметр("ТаблицаФизЛицПоПериодам", ФизлицаПоПериодам);
		Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(МесяцЗначение));
		Запрос.Выполнить();
		
		Если ОтборВЗапросахПоПодразделению И ЗначениеЗаполнено(Подразделение) Тогда
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
		КонецЕсли;
			
		Если ОтборВЗапросахПоМестуВозникновенияЗатрат И ЗначениеЗаполнено(МестоВозникновенияЗатрат) Тогда
			Запрос.УстановитьПараметр("МестоВозникновенияЗатрат", МестоВозникновенияЗатрат);
		КонецЕсли;	
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ВТТаблицаФизЛицПоПериодам.Период КАК МесяцНачисления,
		               |	РНОбороты.ПериодПланирования КАК ПериодДействия,
		               |	РНОбороты.ПериодПланирования КАК ПериодРегистрации,
		               |	РНОбороты.Сценарий.НачалоДействия КАК ДатаНачала,
		               |	РНОбороты.Сценарий.ОкончаниеДействия КАК ДатаОкончания,
		               |	РНОбороты.Сценарий КАК Сценарий,
		               |	РНОбороты.ВидРасчета КАК ВидРасчета,
		               |	ВТТаблицаФизЛицПоПериодам.Организация КАК Организация,
		               |	ВТТаблицаФизЛицПоПериодам.Подразделение КАК Подразделение,
		               |	ВТТаблицаФизЛицПоПериодам.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
		               |	ВТТаблицаФизЛицПоПериодам.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
		               |	ВТТаблицаФизЛицПоПериодам.КодГрейда КАК КодГрейда,
		               |	ВТТаблицаФизЛицПоПериодам.ФизическоеЛицо КАК ФизическоеЛицо,
		               |	РНОбороты.ВидВнебюджетногоФонда КАК ВидВнебюджетногоФонда,
		               |	РНОбороты.ТипНалога КАК ТипНалога,
		               |	РНОбороты.ВидНачисления КАК ВидНачисления,
		               |	РНОбороты.СуммаОборот КАК Сумма,
		               |	РНОбороты.СуммаОборот КАК Результат,
		               |	РНОбороты.УпрСуммаОборот КАК УпрСумма
		               |ИЗ
		               |	РегистрНакопления.РасчетыПоказателейБюджетовПрогнозов.Обороты(
		               |			&ДатаНачала,
		               |			&ДатаОкончания,
		               |			Авто,
		               |			Организация = &Организация
		               |				И Сценарий = &Сценарий
		               |				И ВидНачисления В (&СписокВидовПремий)
		               |				И ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ПустаяСсылка)) КАК РНОбороты
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТТаблицаФизЛицПоПериодам КАК ВТТаблицаФизЛицПоПериодам
		               |		ПО (ВТТаблицаФизЛицПоПериодам.ФизическоеЛицо = РНОбороты.ФизическоеЛицо)
		               |			И (ВТТаблицаФизЛицПоПериодам.Период = РНОбороты.ПериодМесяц)
		               |			И (ВТТаблицаФизЛицПоПериодам.Организация = РНОбороты.Организация)
		               |			И (ВТТаблицаФизЛицПоПериодам.Подразделение = РНОбороты.Подразделение)
		               |			И (ВТТаблицаФизЛицПоПериодам.МестоВозникновенияЗатрат = РНОбороты.МестоВозникновенияЗатрат)
		               |			И (ВТТаблицаФизЛицПоПериодам.ПозицияШтатногоРасписания = РНОбороты.ПозицияШтатногоРасписания)";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ДопУсловие%", ДопУсловие);
			
		Запрос.Текст = ТекстЗапроса;
			
		СписокВидовПремий = Новый Массив;
		СписокВидовПремий.Добавить(Справочники.ВидыНачислений.ЕжемесячнаяПремия);
		СписокВидовПремий.Добавить(Справочники.ВидыНачислений.КвартальнаяПремия);
		СписокВидовПремий.Добавить(Справочники.ВидыНачислений.ПремияЗаПолугодие);
		СписокВидовПремий.Добавить(Справочники.ВидыНачислений.ГодоваяПремия);
		Запрос.УстановитьПараметр("СписокВидовПремий", СписокВидовПремий);
			
		Запрос.УстановитьПараметр("Сценарий", 		Сценарий);
		Запрос.УстановитьПараметр("Организация", 	Организация);
		Запрос.УстановитьПараметр("ДатаНачала", 	НачалоМесяца(МесяцЗначение));
		Запрос.УстановитьПараметр("ДатаОкончания", 	КонецМесяца(МесяцЗначение));
		Запрос.Выполнить();

		РезультатНачислений = Запрос.Выполнить(); 
		
		УдаляемыеВТТаблицы = Новый Массив;
		УдаляемыеВТТаблицы.Добавить("ВТТаблицаФизЛицПоПериодам");
			
		Бюджетирование.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдаляемыеВТТаблицы); 
		
		Если Не РезультатНачислений.Пустой() Тогда 
			ВыборкаРезультатовНачислений = РезультатНачислений.Выбрать();
			Пока ВыборкаРезультатовНачислений.Следующий() Цикл
				Если ВыборкаРезультатовНачислений.ВидНачисления = Null Тогда
					Продолжить;
				Конецесли;	
				НовоеНачисление = РасчитанныеПоказатели.Начисления.Добавить();
				ЗаполнитьЗначенияСвойств(НовоеНачисление, ВыборкаРезультатовНачислений);
			КонецЦикла;	
		КонецЕсли;		
	КонецЦикла;	
		
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗакончитьЗамерВремени(ИмяЗамера, Замер);
		
КонецПроцедуры

Процедура РассчитатьОплатуСтраховыхВзносовРезерва()

	УстановитьПривилегированныйРежим(Истина);
	
	ИмяЗамера = "РасчетПоказателейБюджетовПрогнозов.РасчетПлатежейНачисленныхСуммРезервов";
	Замер = НачатьЗамерВремени();
	
	Для Каждого МесяцЗначение Из МесяцыРасчета Цикл 

		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.Текст =	"ВЫБРАТЬ
		              	|	РасчетыПоказателейРезервовОбороты.ПериодПланирования КАК Период,
		              	|	РасчетыПоказателейРезервовОбороты.ПериодПланирования КАК ПериодПланирования,
		              	|	РасчетыПоказателейРезервовОбороты.Сценарий КАК Сценарий,
		              	|	РасчетыПоказателейРезервовОбороты.ВидРасчета КАК ВидРасчета,
		              	|	РасчетыПоказателейРезервовОбороты.Организация КАК Организация,
		              	|	РасчетыПоказателейРезервовОбороты.Подразделение КАК Подразделение,
		              	|	РасчетыПоказателейРезервовОбороты.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
		              	|	РасчетыПоказателейРезервовОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
		              	|	РасчетыПоказателейРезервовОбороты.ВидВнебюджетногоФонда КАК ВидВнебюджетногоФонда,
		              	|	РасчетыПоказателейРезервовОбороты.ТипНалога КАК ТипНалога,
		              	|	РасчетыПоказателейРезервовОбороты.ВидНачисления КАК ВидНачисления,
		              	|	РасчетыПоказателейРезервовОбороты.СпособОтраженияРезультата КАК СпособОтраженияРезультата,
		              	|	РасчетыПоказателейРезервовОбороты.СуммаОборот КАК СуммаОборот,
		              	|	РасчетыПоказателейРезервовОбороты.УпрСуммаОборот КАК УпрСуммаОборот
		              	|ПОМЕСТИТЬ ВТНачисления
		              	|ИЗ
		              	|	РегистрНакопления.РасчетыПоказателейРезервов.Обороты(
		              	|			&НачалоПериода,
		              	|			&КонецПериода,
		              	|			Период,
		              	|			Организация = &Организация
		              	|				И Сценарий = &Сценарий
		              	|				И (ВидВнебюджетногоФонда ЕСТЬ NULL
		              	|					ИЛИ ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ПустаяСсылка))) КАК РасчетыПоказателейРезервовОбороты";
		
		Запрос.УстановитьПараметр("Организация",   Организация);
		Запрос.УстановитьПараметр("Сценарий",      Сценарий);
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(МесяцЗначение));
		Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(МесяцЗначение));
		Запрос.Выполнить();
		
		Запрос.Текст =	"ВЫБРАТЬ
		              	|	ДОБАВИТЬКДАТЕ(РасчетыПоказателейРезервовОбороты.ПериодПланирования, МЕСЯЦ, 1) КАК Период,
		              	|	РасчетыПоказателейРезервовОбороты.ПериодПланирования КАК ПериодПланирования,
		              	|	РасчетыПоказателейРезервовОбороты.Сценарий КАК Сценарий,
		              	|	РасчетыПоказателейРезервовОбороты.ВидРасчета КАК ВидРасчета,
		              	|	РасчетыПоказателейРезервовОбороты.Организация КАК Организация,
		              	|	РасчетыПоказателейРезервовОбороты.Подразделение КАК Подразделение,
		              	|	РасчетыПоказателейРезервовОбороты.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
		              	|	РасчетыПоказателейРезервовОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
		              	|	РасчетыПоказателейРезервовОбороты.ВидВнебюджетногоФонда КАК ВидВнебюджетногоФонда,
		              	|	РасчетыПоказателейРезервовОбороты.ТипНалога КАК ТипНалога,
		              	|	РасчетыПоказателейРезервовОбороты.ВидНачисления КАК ВидНачисления,
		              	|	РасчетыПоказателейРезервовОбороты.СпособОтраженияРезультата КАК СпособОтраженияРезультата,
		              	|	РасчетыПоказателейРезервовОбороты.СуммаОборот КАК СуммаОборот,
		              	|	РасчетыПоказателейРезервовОбороты.УпрСуммаОборот КАК УпрСуммаОборот
		              	|ПОМЕСТИТЬ ВТВзносы
		              	|ИЗ
		              	|	РегистрНакопления.РасчетыПоказателейРезервов.Обороты(
		              	|			&НачалоПериода,
		              	|			&КонецПериода,
		              	|			Период,
		              	|			Организация = &Организация
		              	|				И Сценарий = &Сценарий
		              	|				И НЕ ВидВнебюджетногоФонда ЕСТЬ NULL
		              	|				И НЕ ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ПустаяСсылка)) КАК РасчетыПоказателейРезервовОбороты";
		
		Запрос.УстановитьПараметр("Организация",   Организация);
		Запрос.УстановитьПараметр("Сценарий",      Сценарий);
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(МесяцЗначение));
		Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(МесяцЗначение));
		Запрос.Выполнить();
		
		Запрос.Текст =	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		              	|	ВТНачисления.Период КАК Период,
		              	|	ВТНачисления.ПериодПланирования КАК ПериодРегистрации,
		              	|	ВТНачисления.Период КАК ПериодДействия, 
		              	|	ВТНачисления.Период КАК МесяцНачисления, 
		              	|	ВТНачисления.Сценарий КАК Сценарий,
		              	|	ВТНачисления.ВидРасчета КАК ВидРасчета,
		              	|	ВТНачисления.Организация КАК Организация,
		              	|	ВТНачисления.Подразделение КАК Подразделение,
		              	|	ВТНачисления.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
		              	|	ВТНачисления.ФизическоеЛицо КАК ФизическоеЛицо,
		              	|	ВТНачисления.ВидВнебюджетногоФонда КАК ВидВнебюджетногоФонда,
		              	|	ВТНачисления.ТипНалога КАК ТипНалога,
		              	|	ВТНачисления.ВидНачисления КАК ВидНачисления,
		              	|	ВТНачисления.СпособОтраженияРезультата КАК СпособОтраженияРезультата,
		              	|	СУММА(ВТНачисления.СуммаОборот) КАК Результат,
		              	|	СУММА(ВТНачисления.СуммаОборот) КАК Сумма,
		              	|	СУММА(ВТНачисления.УпрСуммаОборот) КАК УпрСумма
		              	|ИЗ
		              	|	ВТНачисления КАК ВТНачисления
		              	|
		              	|СГРУППИРОВАТЬ ПО
		              	|	ВТНачисления.Период,
		              	|	ВТНачисления.ПериодПланирования,
		              	|	ВТНачисления.Сценарий,
		              	|	ВТНачисления.ВидРасчета,
		              	|	ВТНачисления.Организация,
		              	|	ВТНачисления.Подразделение,
		              	|	ВТНачисления.МестоВозникновенияЗатрат,
		              	|	ВТНачисления.ФизическоеЛицо,
		              	|	ВТНачисления.ВидВнебюджетногоФонда,
		              	|	ВТНачисления.ТипНалога,
		              	|	ВТНачисления.ВидНачисления,
		              	|	ВТНачисления.СпособОтраженияРезультата
		              	|;
		              	|
		              	|////////////////////////////////////////////////////////////////////////////////
		              	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		              	|	ВТВзносы.Период КАК Период,
		              	|	ВТВзносы.Период КАК ПериодРегистрации,
		              	|	ВТВзносы.Период КАК МесяцНачисления,
		              	|	ВТВзносы.Сценарий КАК Сценарий,
		              	|	ВТВзносы.ВидРасчета КАК ВидРасчета,
		              	|	ВТВзносы.Организация КАК Организация,
		              	|	ВТВзносы.Подразделение КАК Подразделение,
		              	|	ВТВзносы.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
		              	|	ВТВзносы.ФизическоеЛицо КАК ФизическоеЛицо,
		              	|	ВТВзносы.ВидВнебюджетногоФонда КАК ВидВнебюджетногоФонда,
		              	|	ВТВзносы.ТипНалога КАК ТипНалога,
		              	|	ВТВзносы.ВидНачисления КАК ВидНачисления,
		              	|	ВТВзносы.СпособОтраженияРезультата КАК СпособОтраженияРезультата,
		              	|	СУММА(ВТВзносы.СуммаОборот) КАК Результат,
		              	|	СУММА(ВТВзносы.СуммаОборот) КАК Сумма,
		              	|	СУММА(ВТВзносы.УпрСуммаОборот) КАК УпрСумма
		              	|ИЗ
		              	|	ВТВзносы КАК ВТВзносы
		              	|
		              	|СГРУППИРОВАТЬ ПО
		              	|	ВТВзносы.Период,
		              	|	ВТВзносы.ПериодПланирования,
		              	|	ВТВзносы.Сценарий,
		              	|	ВТВзносы.ВидРасчета,
		              	|	ВТВзносы.Организация,
		              	|	ВТВзносы.Подразделение,
		              	|	ВТВзносы.МестоВозникновенияЗатрат,
		              	|	ВТВзносы.ФизическоеЛицо,
		              	|	ВТВзносы.ВидВнебюджетногоФонда,
		              	|	ВТВзносы.ТипНалога,
		              	|	ВТВзносы.ВидНачисления,
		              	|	ВТВзносы.СпособОтраженияРезультата";
	
		РезультатыЗапросов = Запрос.ВыполнитьПакет();
		
		Начисления = РезультатыЗапросов[0].Выгрузить();
		Взносы = РезультатыЗапросов[1].Выгрузить();
		
		Для Каждого СтрокаНачисления Из Начисления Цикл
			НовоеНачисление = РасчитанныеПоказатели.Начисления.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеНачисление, СтрокаНачисления); 
		КонецЦикла;
		
		Для Каждого СтрокаВзноса Из Взносы Цикл
			НовоеНачисление = РасчитанныеПоказатели.Взносы.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеНачисление, СтрокаВзноса); 
		КонецЦикла;
		
	КонецЦикла; 
	
	Если РасчитанныеПоказатели.Начисления.Количество() > 0 Тогда
		РасчитанныеПоказатели.Начисления.ЗаполнитьЗначения(ПериодРасчета.ДатаНачала, "ДатаНачала");	
		РасчитанныеПоказатели.Начисления.ЗаполнитьЗначения(ПериодРасчета.ДатаОкончания, "ДатаОкончания");
	КонецЕсли;	
	
	Если РасчитанныеПоказатели.Взносы.Количество() > 0 Тогда
		РасчитанныеПоказатели.Взносы.ЗаполнитьЗначения(ПериодРасчета.ДатаНачала, "ДатаНачала");	
		РасчитанныеПоказатели.Взносы.ЗаполнитьЗначения(ПериодРасчета.ДатаОкончания, "ДатаОкончания");
	КонецЕсли;	

	УстановитьПривилегированныйРежим(Ложь);
	
	ЗакончитьЗамерВремени(ИмяЗамера, Замер);
		
КонецПроцедуры	

#КонецОбласти

#Область РасчетНачислений

Процедура ПодготовитьТаблицуФизлицПоПериодам()
	
	ЗапросФизлица = Новый Запрос();
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период КАК Период,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Организация КАК Организация,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Подразделение КАК Подразделение,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.КодГрейда КАК КодГрейда,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода КАК НачалоПериода,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода КАК ОкончаниеПериода
	               |ПОМЕСТИТЬ ВТКадровыеДанные
	               |ИЗ
	               |	РегистрСведений.КадровыеСведенияСотрудниковОрганизаций.СрезПоследних(
	               |			&ДатаСрезаПоследних,
	               |			Организация = &Организация И Сценарий = &Сценарий
	               |				%ДопУсловие%) КАК КадровыеСведенияСотрудниковОрганизацийСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ФизическоеЛицо,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Организация,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Подразделение,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.МестоВозникновенияЗатрат,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ПозицияШтатногоРасписания,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.КодГрейда,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПервых.ФизическоеЛицо,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПервых.Период,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПервых.Организация,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПервых.Подразделение,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПервых.МестоВозникновенияЗатрат,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПервых.ПозицияШтатногоРасписания,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПервых.КодГрейда,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПервых.НачалоПериода,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПервых.ОкончаниеПериода
	               |ИЗ
	               |	РегистрСведений.КадровыеСведенияСотрудниковОрганизаций.СрезПервых(
				   |             &ДатаСрезаПервых, 
				   |             Организация = &Организация И Сценарий = &Сценарий
				   |				%ДопУсловие%) КАК КадровыеСведенияСотрудниковОрганизацийСрезПервых
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПервых.Подразделение,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПервых.ПозицияШтатногоРасписания,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПервых.КодГрейда,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПервых.НачалоПериода,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПервых.ОкончаниеПериода,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПервых.МестоВозникновенияЗатрат,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПервых.Период,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПервых.Организация,
	               |	КадровыеСведенияСотрудниковОрганизацийСрезПервых.ФизическоеЛицо
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ВТКадровыеДанные.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	ВТКадровыеДанные.Организация КАК Организация,
	               |	ВТКадровыеДанные.Подразделение КАК Подразделение,
	               |	ВТКадровыеДанные.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
	               |	ВТКадровыеДанные.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
	               |	ВТКадровыеДанные.КодГрейда КАК КодГрейда,
	               |	ВТКадровыеДанные.НачалоПериода КАК НачалоПериода,
	               |	ВТКадровыеДанные.ОкончаниеПериода КАК ОкончаниеПериода
	               |ИЗ
	               |	ВТКадровыеДанные КАК ВТКадровыеДанные
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТКадровыеДанные.НачалоПериода,
	               |	ВТКадровыеДанные.КодГрейда,
	               |	ВТКадровыеДанные.ОкончаниеПериода,
	               |	ВТКадровыеДанные.Организация,
	               |	ВТКадровыеДанные.ФизическоеЛицо,
	               |	ВТКадровыеДанные.ПозицияШтатногоРасписания,
	               |	ВТКадровыеДанные.Подразделение,
	               |	ВТКадровыеДанные.МестоВозникновенияЗатрат
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ВТКадровыеДанные.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	ВТКадровыеДанные.Период КАК Период,
	               |	ВТКадровыеДанные.Организация КАК Организация,
	               |	ВТКадровыеДанные.Подразделение КАК Подразделение,
	               |	ВТКадровыеДанные.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
	               |	ВТКадровыеДанные.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
	               |	ВТКадровыеДанные.КодГрейда КАК КодГрейда,
	               |	ВТКадровыеДанные.НачалоПериода КАК НачалоПериода,
	               |	ВТКадровыеДанные.ОкончаниеПериода КАК ОкончаниеПериода
	               |ИЗ
	               |	ВТКадровыеДанные КАК ВТКадровыеДанные
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТКадровыеДанные.Подразделение,
	               |	ВТКадровыеДанные.МестоВозникновенияЗатрат,
	               |	ВТКадровыеДанные.ПозицияШтатногоРасписания,
	               |	ВТКадровыеДанные.ОкончаниеПериода,
	               |	ВТКадровыеДанные.ФизическоеЛицо,
	               |	ВТКадровыеДанные.Период,
	               |	ВТКадровыеДанные.Организация,
	               |	ВТКадровыеДанные.КодГрейда,
	               |	ВТКадровыеДанные.НачалоПериода"; 
	
	
	ДопУсловие = "";
	
	Если ОтборВЗапросахПоПодразделению И ЗначениеЗаполнено(Подразделение) Тогда
		
		ДопУсловие = ДопУсловие + "
								   |				И Подразделение = &Подразделение ";
		
		ЗапросФизлица.УстановитьПараметр("Подразделение", Подразделение);
	КонецЕсли;
	
	Если ОтборВЗапросахПоМестуВозникновенияЗатрат И ЗначениеЗаполнено(МестоВозникновенияЗатрат) Тогда
		
		ДопУсловие = ДопУсловие + "
								   |				И МестоВозникновенияЗатрат = &МестоВозникновенияЗатрат ";
		
		ЗапросФизлица.УстановитьПараметр("МестоВозникновенияЗатрат", МестоВозникновенияЗатрат);
	КонецЕсли;	

	Если ОтборВЗапросахПоФизическимЛицам 
			И Не НастройкиРасчета.ФизическиеЛица = Неопределено 
			И ТипЗнч(НастройкиРасчета.ФизическиеЛица) = Тип("Массив")
			И НастройкиРасчета.ФизическиеЛица.Количество() > 0 Тогда
		
		ДопУсловие = ДопУсловие + "
								   |				И ФизическоеЛицо В (&ФизическиеЛица) ";
		
		ЗапросФизлица.УстановитьПараметр("ФизическиеЛица", НастройкиРасчета.ФизическиеЛица);
	КонецЕсли;	
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ДопУсловие%", ДопУсловие);
	
	ЗапросФизлица.Текст = ТекстЗапроса;
	ЗапросФизлица.УстановитьПараметр("ДатаСрезаПервых", ПериодРасчета.ДатаНачала);
	ЗапросФизлица.УстановитьПараметр("ДатаСрезаПоследних", ПериодРасчета.ДатаОкончания);
	ЗапросФизлица.УстановитьПараметр("Сценарий", Сценарий);
	ЗапросФизлица.УстановитьПараметр("Организация", Организация);
	
	РезультатыЗапросов = ЗапросФизлица.ВыполнитьПакет();
	
	ФизлицаБезПериодов = РезультатыЗапросов[1].Выгрузить();
	ФизлицаПоПериодам = РезультатыЗапросов[2].Выгрузить();
	
	ДатаПериода = НачалоМесяца(ПериодРасчета.ДатаНачала);   
	                                                        
	Пока ДатаПериода <= ПериодРасчета.ДатаОкончания Цикл
    	Отбор = Новый Структура("ФизическоеЛицо,Период,Организация,Подразделение,МестоВозникновенияЗатрат,КодГрейда,ПозицияШтатногоРасписания");
		Для Каждого СтрокаДанных Из ФизлицаБезПериодов Цикл
			Отбор.Вставить("ФизическоеЛицо", СтрокаДанных.ФизическоеЛицо); 
			Отбор.Вставить("Период", НачалоМесяца(ДатаПериода));
			Отбор.Вставить("Организация", СтрокаДанных.Организация);
			Отбор.Вставить("Подразделение", СтрокаДанных.Подразделение);
			Отбор.Вставить("МестоВозникновенияЗатрат", СтрокаДанных.МестоВозникновенияЗатрат);
			Отбор.Вставить("КодГрейда", СтрокаДанных.КодГрейда);
			Отбор.Вставить("ПозицияШтатногоРасписания", СтрокаДанных.ПозицияШтатногоРасписания);
			НайденныеСтроки = ФизлицаПоПериодам.НайтиСтроки(Отбор);	
			Если НайденныеСтроки.Количество() = 0 Тогда  
				НоваяСтрока = ФизлицаПоПериодам.Добавить();
				НоваяСтрока.ФизическоеЛицо = СтрокаДанных.ФизическоеЛицо; 
				НоваяСтрока.Период = НачалоМесяца(ДатаПериода);
				НоваяСтрока.Организация = СтрокаДанных.Организация;
				НоваяСтрока.Подразделение = СтрокаДанных.Подразделение; 
				НоваяСтрока.МестоВозникновенияЗатрат = СтрокаДанных.МестоВозникновенияЗатрат;
				НоваяСтрока.КодГрейда = СтрокаДанных.КодГрейда;
				НоваяСтрока.ПозицияШтатногоРасписания = СтрокаДанных.ПозицияШтатногоРасписания; 
				НоваяСтрока.НачалоПериода = СтрокаДанных.НачалоПериода; 
				НоваяСтрока.ОкончаниеПериода = СтрокаДанных.ОкончаниеПериода;
			КонецЕсли;
		КонецЦикла;
		ДатаПериода = ДобавитьМесяц(ДатаПериода, 1);
	КонецЦикла;
	
	//Если ФизлицаПоПериодам.Количество() > 0 Тогда
	//	ФизлицаПоПериодам.ЗаполнитьЗначения(ПериодРасчета.ДатаНачала, "НачалоПериода");	
	//	ФизлицаПоПериодам.ЗаполнитьЗначения(ПериодРасчета.ДатаОкончания, "ОкончаниеПериода");
	//КонецЕсли;
	
КонецПроцедуры	

Процедура ПодготовитьТаблицуИсточникаРасчетовПоПериодам()
	
	
КонецПроцедуры

Процедура РассчитатьПремии()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяЗамера = "РасчетПоказателейБюджетовПрогнозов.РасчетЕжемесячныхПремий";
	Замер = НачатьЗамерВремени();
	
	ПодготовитьТаблицуФизлицПоПериодам(); 
	
	Если Не ТипЗнч(ФизлицаПоПериодам) = Тип("ТаблицаЗначений") И Не ФизлицаПоПериодам.Количество() > 0 Тогда 
		ПодготовитьТаблицуФизлицПоПериодам();	
	КонецЕсли;
	
	Для Каждого МесяцЗначение Из МесяцыРасчета Цикл
		
		НастройкиДатаВыплатыБюджетирования = РасчетБюджетированияРасширенныйВызовСервера.СведенияОНастройкахБюджетированиеРасширенная(Организация, НачалоГода(МесяцЗначение), Сценарий);
		
		#Область СозданиеЗапроса
		
		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.УстановитьПараметр("ТаблицаФизЛицПоПериодам", ФизлицаПоПериодам);
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТаблицаФизЛицПоПериодам.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ТаблицаФизЛицПоПериодам.Период КАК Период,
			|	ТаблицаФизЛицПоПериодам.Организация КАК Организация,
			|	ТаблицаФизЛицПоПериодам.Подразделение КАК Подразделение,
			|	ТаблицаФизЛицПоПериодам.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
			|	ТаблицаФизЛицПоПериодам.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
			|	ТаблицаФизЛицПоПериодам.КодГрейда КАК КодГрейда,
			|	ТаблицаФизЛицПоПериодам.НачалоПериода КАК НачалоПериода,
			|	ТаблицаФизЛицПоПериодам.ОкончаниеПериода КАК ОкончаниеПериода
			|ПОМЕСТИТЬ ВТТаблицаФизЛицПоПериодам
			|ИЗ
			|	&ТаблицаФизЛицПоПериодам КАК ТаблицаФизЛицПоПериодам
			|ГДЕ
			|	ТаблицаФизЛицПоПериодам.Период = &ДатаСреза";
		
		Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(МесяцЗначение));
		Запрос.Выполнить();
		    // !!! Сгруппировать в запросе
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	СтавкаПремии.Период КАК Период,
		               |	СтавкаПремии.КодГрейда КАК КодГрейда,
		               |	МАКСИМУМ(СтавкаПремии.СтавкаЕжемесячнойПремии) КАК СтавкаЕжемесячнойПремии,
		               |	МАКСИМУМ(СтавкаПремии.СтавкаКвартальнойПремии) КАК СтавкаКвартальнойПремии,
		               |	МАКСИМУМ(СтавкаПремии.СтавкаПремииЗаПолугодие) КАК СтавкаПремииЗаПолугодие,
		               |	МАКСИМУМ(СтавкаПремии.СтавкаГодовойПремии) КАК СтавкаГодовойПремии
		               |ПОМЕСТИТЬ ВТСтавкаПремии
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		&ДатаСреза КАК Период,
		               |		СтавкиПремийСрезПоследних.КодГрейда КАК КодГрейда,
		               |		ВЫБОР
		               |			КОГДА СтавкиПремийСрезПоследних.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.ЕжемесячнаяПремия)
		               |				ТОГДА СтавкиПремийСрезПоследних.Ставка
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК СтавкаЕжемесячнойПремии,
		               |		ВЫБОР
		               |			КОГДА СтавкиПремийСрезПоследних.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.КвартальнаяПремия)
		               |				ТОГДА СтавкиПремийСрезПоследних.Ставка
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК СтавкаКвартальнойПремии,
		               |		ВЫБОР
		               |			КОГДА СтавкиПремийСрезПоследних.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.ПремияЗаПолугодие)
		               |				ТОГДА СтавкиПремийСрезПоследних.Ставка
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК СтавкаПремииЗаПолугодие,
		               |		ВЫБОР
		               |			КОГДА СтавкиПремийСрезПоследних.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.ГодоваяПремия)
		               |				ТОГДА СтавкиПремийСрезПоследних.Ставка
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК СтавкаГодовойПремии
		               |	ИЗ
		               |		РегистрСведений.СтавкиПремий.СрезПоследних(&ДатаНачалаГода, Сценарий = &Сценарий) КАК СтавкиПремийСрезПоследних) КАК СтавкаПремии
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	СтавкаПремии.Период,
		               |	СтавкаПремии.КодГрейда";
		
		Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(МесяцЗначение));
		Запрос.УстановитьПараметр("ДатаНачалаГода", НачалоГода(МесяцЗначение));
		Запрос.УстановитьПараметр("Сценарий",  Сценарий);
		Запрос.Выполнить();
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	КоэффициентыПремийТекущегоГода.Период КАК Период,
		               |	МАКСИМУМ(КоэффициентыПремийТекущегоГода.КоэффициентКвартальнойПремии1КварталаТекущегоГода) КАК КоэффициентКвартальнойПремии1КварталаТекущегоГода,
		               |	МАКСИМУМ(КоэффициентыПремийТекущегоГода.КоэффициентКвартальнойПремии2КварталаТекущегоГода) КАК КоэффициентКвартальнойПремии2КварталаТекущегоГода,
		               |	МАКСИМУМ(КоэффициентыПремийТекущегоГода.КоэффициентКвартальнойПремии3КварталаТекущегоГода) КАК КоэффициентКвартальнойПремии3КварталаТекущегоГода,
		               |	МАКСИМУМ(КоэффициентыПремийТекущегоГода.КоэффициентКвартальнойПремии4КварталаТекущегоГода) КАК КоэффициентКвартальнойПремии4КварталаТекущегоГода,
		               |	МАКСИМУМ(КоэффициентыПремийТекущегоГода.КоэффициентПремииЗа1ПолугодиеТекущегоГода) КАК КоэффициентПремииЗа1ПолугодиеТекущегоГода,
		               |	МАКСИМУМ(КоэффициентыПремийТекущегоГода.КоэффициентПремииЗа2ПолугодиеТекущегоГода) КАК КоэффициентПремииЗа2ПолугодиеТекущегоГода,
		               |	МАКСИМУМ(КоэффициентыПремийТекущегоГода.КоэффициентГодовойПремииТекущегоГода) КАК КоэффициентГодовойПремииТекущегоГода
		               |ПОМЕСТИТЬ ВТКоэффициентыПремийТекущегоГода
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		&ДатаСреза КАК Период,
		               |		ВЫБОР
		               |			КОГДА КоэффициентыНачисленийСрезПоследних.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.КвартальнаяПремия)
		               |					И КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.Квартал1)
		               |				ТОГДА КоэффициентыНачисленийСрезПоследних.Коэффициент
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК КоэффициентКвартальнойПремии1КварталаТекущегоГода,
		               |		ВЫБОР
		               |			КОГДА КоэффициентыНачисленийСрезПоследних.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.КвартальнаяПремия)
		               |					И КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.Квартал2)
		               |				ТОГДА КоэффициентыНачисленийСрезПоследних.Коэффициент
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК КоэффициентКвартальнойПремии2КварталаТекущегоГода,
		               |		ВЫБОР
		               |			КОГДА КоэффициентыНачисленийСрезПоследних.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.КвартальнаяПремия)
		               |					И КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.Квартал3)
		               |				ТОГДА КоэффициентыНачисленийСрезПоследних.Коэффициент
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК КоэффициентКвартальнойПремии3КварталаТекущегоГода,
		               |		ВЫБОР
		               |			КОГДА КоэффициентыНачисленийСрезПоследних.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.КвартальнаяПремия)
		               |					И КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.Квартал4)
		               |				ТОГДА КоэффициентыНачисленийСрезПоследних.Коэффициент
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК КоэффициентКвартальнойПремии4КварталаТекущегоГода,
		               |		ВЫБОР
		               |			КОГДА КоэффициентыНачисленийСрезПоследних.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.ПремияЗаПолугодие)
		               |					И КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.Полугодие1)
		               |				ТОГДА КоэффициентыНачисленийСрезПоследних.Коэффициент
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК КоэффициентПремииЗа1ПолугодиеТекущегоГода,
		               |		ВЫБОР
		               |			КОГДА КоэффициентыНачисленийСрезПоследних.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.ПремияЗаПолугодие)
		               |					И КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.Полугодие2)
		               |				ТОГДА КоэффициентыНачисленийСрезПоследних.Коэффициент
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК КоэффициентПремииЗа2ПолугодиеТекущегоГода,
		               |		ВЫБОР
		               |			КОГДА КоэффициентыНачисленийСрезПоследних.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.ГодоваяПремия)
		               |					И (КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.Год)
		               |						ИЛИ КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.ПустаяСсылка))
		               |				ТОГДА КоэффициентыНачисленийСрезПоследних.Коэффициент
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК КоэффициентГодовойПремииТекущегоГода
		               |	ИЗ
		               |		РегистрСведений.КоэффициентыНачислений.СрезПоследних(&ДатаНачалаГода, Сценарий = &Сценарий) КАК КоэффициентыНачисленийСрезПоследних
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		&ДатаСреза,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0
		               |	ИЗ
		               |		Справочник.Сценарии КАК Сценарий
		               |	ГДЕ
		               |		Сценарий.Ссылка = &Сценарий) КАК КоэффициентыПремийТекущегоГода
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	КоэффициентыПремийТекущегоГода.Период";
		
		Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(МесяцЗначение));
		Запрос.УстановитьПараметр("ДатаНачалаГода", НачалоГода(МесяцЗначение));
		Запрос.УстановитьПараметр("Сценарий",  Сценарий);
		Запрос.Выполнить();
		    
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	КоэффициентыПремийПрошлогоГода.Период КАК Период,
		               |	МАКСИМУМ(КоэффициентыПремийПрошлогоГода.КоэффициентКвартальнойПремии1КварталаПрошлогоГода) КАК КоэффициентКвартальнойПремии1КварталаПрошлогоГода,
		               |	МАКСИМУМ(КоэффициентыПремийПрошлогоГода.КоэффициентКвартальнойПремии2КварталаПрошлогоГода) КАК КоэффициентКвартальнойПремии2КварталаПрошлогоГода,
		               |	МАКСИМУМ(КоэффициентыПремийПрошлогоГода.КоэффициентКвартальнойПремии3КварталаПрошлогоГода) КАК КоэффициентКвартальнойПремии3КварталаПрошлогоГода,
		               |	МАКСИМУМ(КоэффициентыПремийПрошлогоГода.КоэффициентКвартальнойПремии4КварталаПрошлогоГода) КАК КоэффициентКвартальнойПремии4КварталаПрошлогоГода,
		               |	МАКСИМУМ(КоэффициентыПремийПрошлогоГода.КоэффициентПремииЗа1ПолугодиеПрошлогоГода) КАК КоэффициентПремииЗа1ПолугодиеПрошлогоГода,
		               |	МАКСИМУМ(КоэффициентыПремийПрошлогоГода.КоэффициентПремииЗа2ПолугодиеПрошлогоГода) КАК КоэффициентПремииЗа2ПолугодиеПрошлогоГода
		               |ПОМЕСТИТЬ ВТКоэффициентыПремийПрошлогоГода
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		&ДатаСреза КАК Период,
		               |		ВЫБОР
		               |			КОГДА КоэффициентыНачисленийСрезПоследних.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.КвартальнаяПремия)
		               |					И КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.Квартал1)
		               |				ТОГДА КоэффициентыНачисленийСрезПоследних.Коэффициент
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК КоэффициентКвартальнойПремии1КварталаПрошлогоГода,
		               |		ВЫБОР
		               |			КОГДА КоэффициентыНачисленийСрезПоследних.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.КвартальнаяПремия)
		               |					И КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.Квартал2)
		               |				ТОГДА КоэффициентыНачисленийСрезПоследних.Коэффициент
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК КоэффициентКвартальнойПремии2КварталаПрошлогоГода,
		               |		ВЫБОР
		               |			КОГДА КоэффициентыНачисленийСрезПоследних.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.КвартальнаяПремия)
		               |					И КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.Квартал3)
		               |				ТОГДА КоэффициентыНачисленийСрезПоследних.Коэффициент
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК КоэффициентКвартальнойПремии3КварталаПрошлогоГода,
		               |		ВЫБОР
		               |			КОГДА КоэффициентыНачисленийСрезПоследних.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.КвартальнаяПремия)
		               |					И КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.Квартал4)
		               |				ТОГДА КоэффициентыНачисленийСрезПоследних.Коэффициент
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК КоэффициентКвартальнойПремии4КварталаПрошлогоГода,
		               |		ВЫБОР
		               |			КОГДА КоэффициентыНачисленийСрезПоследних.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.ПремияЗаПолугодие)
		               |					И КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.Полугодие1)
		               |				ТОГДА КоэффициентыНачисленийСрезПоследних.Коэффициент
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК КоэффициентПремииЗа1ПолугодиеПрошлогоГода,
		               |		ВЫБОР
		               |			КОГДА КоэффициентыНачисленийСрезПоследних.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.ПремияЗаПолугодие)
		               |					И КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.Полугодие2)
		               |				ТОГДА КоэффициентыНачисленийСрезПоследних.Коэффициент
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК КоэффициентПремииЗа2ПолугодиеПрошлогоГода
		               |	ИЗ
		               |		РегистрСведений.КоэффициентыНачислений.СрезПоследних(ДОБАВИТЬКДАТЕ(&ДатаНачалаГода, ГОД, -1), Сценарий = &Сценарий) КАК КоэффициентыНачисленийСрезПоследних
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		&ДатаСреза,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0
		               |	ИЗ
		               |		Справочник.Сценарии КАК Сценарий
		               |	ГДЕ
		               |		Сценарий.Ссылка = &Сценарий) КАК КоэффициентыПремийПрошлогоГода
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	КоэффициентыПремийПрошлогоГода.Период";
		
		Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(МесяцЗначение));
		Запрос.УстановитьПараметр("ДатаНачалаГода", НачалоГода(МесяцЗначение));
		Запрос.УстановитьПараметр("Сценарий",  Сценарий);
		Запрос.Выполнить();
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
		               |	ВЫБОР
		               |		КОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период < &ДатаСреза
		               |			ТОГДА &ДатаСреза
		               |		ИНАЧЕ КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период
		               |	КОНЕЦ КАК Период,
		               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Организация КАК Организация,
		               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Подразделение КАК Подразделение,
		               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
		               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
		               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.КодГрейда КАК КодГрейда,
		               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода КАК НачалоПериода,
		               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода КАК ОкончаниеПериода,
					   |	ВЫБОР КОГДА &ДатаСреза >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода  
					   |    				И &ДатаСреза <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода 
		               |			ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Ставка 
					   |            ИНАЧЕ 0
					   |	КОНЕЦ КАК СтавкаТекущегоМесяца,
		               |	ВЫБОР КОГДА &ДатаСреза >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода  
					   |    				И &ДатаСреза <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода 
		               |			ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Оклад 
					   |            ИНАЧЕ 0
					   |	КОНЕЦ КАК ОкладТекущегоМесяца
		               |ПОМЕСТИТЬ ВТКадровыеДанныеТекущие
		               |ИЗ
		               |	РегистрСведений.КадровыеСведенияСотрудниковОрганизаций.СрезПоследних(
					   |						&ДатаСреза, 
					   |						Организация = &Организация И Сценарий = &Сценарий
					   |						%ДопУсловие%) КАК КадровыеСведенияСотрудниковОрганизацийСрезПоследних";
		
		ДопУсловие = "";
		
		Если ОтборВЗапросахПоПодразделению И ЗначениеЗаполнено(Подразделение) Тогда
			
			ДопУсловие = ДопУсловие + "
									   |				И Подразделение = &Подразделение ";
			
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
		КонецЕсли;
		
		Если ОтборВЗапросахПоМестуВозникновенияЗатрат И ЗначениеЗаполнено(МестоВозникновенияЗатрат) Тогда
			
			ДопУсловие = ДопУсловие + "
									   |				И МестоВозникновенияЗатрат = &МестоВозникновенияЗатрат ";
			
			Запрос.УстановитьПараметр("МестоВозникновенияЗатрат", МестоВозникновенияЗатрат);
		КонецЕсли;	

		Если ОтборВЗапросахПоФизическимЛицам 
				И Не НастройкиРасчета.ФизическиеЛица = Неопределено 
				И ТипЗнч(НастройкиРасчета.ФизическиеЛица) = Тип("Массив")
				И НастройкиРасчета.ФизическиеЛица.Количество() > 0 Тогда
			
			ДопУсловие = ДопУсловие + "
									   |				И ФизическоеЛицо В (&ФизическиеЛица) ";
			
			Запрос.УстановитьПараметр("ФизическиеЛица", НастройкиРасчета.ФизическиеЛица);
		КонецЕсли;	
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ДопУсловие%", ДопУсловие);
		
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Сценарий ", Сценарий);
		Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(МесяцЗначение));
		Запрос.Выполнить();
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	КадровыеДанныеПредыдущие.ФизическоеЛицо КАК ФизическоеЛицо,
		               |	КадровыеДанныеПредыдущие.Период КАК Период,
		               |	КадровыеДанныеПредыдущие.Организация КАК Организация,
		               |	КадровыеДанныеПредыдущие.Подразделение КАК Подразделение,
		               |	КадровыеДанныеПредыдущие.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
		               |	КадровыеДанныеПредыдущие.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
		               |	КадровыеДанныеПредыдущие.КодГрейда КАК КодГрейда,
		               |	КадровыеДанныеПредыдущие.НачалоПериода КАК НачалоПериода,
		               |	КадровыеДанныеПредыдущие.ОкончаниеПериода КАК ОкончаниеПериода,
		               |	СУММА(КадровыеДанныеПредыдущие.СтавкаПредыдущегоПервогоМесяца) КАК СтавкаПредыдущегоПервогоМесяца,
		               |	СУММА(КадровыеДанныеПредыдущие.СтавкаПредыдущегоВторогоМесяца) КАК СтавкаПредыдущегоВторогоМесяца,
		               |	СУММА(КадровыеДанныеПредыдущие.СтавкаПредыдущегоТретьегоМесяца) КАК СтавкаПредыдущегоТретьегоМесяца,
		               |	СУММА(КадровыеДанныеПредыдущие.СтавкаПредыдущегоЧетвертогоМесяца) КАК СтавкаПредыдущегоЧетвертогоМесяца,
		               |	СУММА(КадровыеДанныеПредыдущие.СтавкаПредыдущегоПятогоМесяца) КАК СтавкаПредыдущегоПятогоМесяца,
		               |	СУММА(КадровыеДанныеПредыдущие.СтавкаПредыдущегоШестогоМесяца) КАК СтавкаПредыдущегоШестогоМесяца,
		               |	СУММА(КадровыеДанныеПредыдущие.СтавкаНачалаГода) КАК СтавкаНачалаГода,
		               |	СУММА(КадровыеДанныеПредыдущие.ОкладПредыдущегоПервогоМесяца) КАК ОкладПредыдущегоПервогоМесяца,
		               |	СУММА(КадровыеДанныеПредыдущие.ОкладПредыдущегоВторогоМесяца) КАК ОкладПредыдущегоВторогоМесяца,
		               |	СУММА(КадровыеДанныеПредыдущие.ОкладПредыдущегоТретьегоМесяца) КАК ОкладПредыдущегоТретьегоМесяца,
		               |	СУММА(КадровыеДанныеПредыдущие.ОкладПредыдущегоЧетвертогоМесяца) КАК ОкладПредыдущегоЧетвертогоМесяца,
		               |	СУММА(КадровыеДанныеПредыдущие.ОкладПредыдущегоПятогоМесяца) КАК ОкладПредыдущегоПятогоМесяца,
		               |	СУММА(КадровыеДанныеПредыдущие.ОкладПредыдущегоШестогоМесяца) КАК ОкладПредыдущегоШестогоМесяца,
		               |	СУММА(КадровыеДанныеПредыдущие.ОкладНачалаГода) КАК ОкладНачалаГода
		               |ПОМЕСТИТЬ ВТКадровыеДанныеПредыдущие
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
		               |		ВЫБОР
		               |			КОГДА ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1) < &ДатаСреза
		               |				ТОГДА &ДатаСреза
		               |			ИНАЧЕ ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1)
		               |		КОНЕЦ КАК Период,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Организация КАК Организация,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Подразделение КАК Подразделение, 
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат, 
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.КодГрейда КАК КодГрейда,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода КАК НачалоПериода,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода КАК ОкончаниеПериода,
					   |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -1) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -1) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Ставка 
					   |                ИНАЧЕ 0
					   |		КОНЕЦ КАК СтавкаПредыдущегоПервогоМесяца,
		               |		0 КАК СтавкаПредыдущегоВторогоМесяца,
		               |		0 КАК СтавкаПредыдущегоТретьегоМесяца,
		               |		0 КАК СтавкаПредыдущегоЧетвертогоМесяца,
		               |		0 КАК СтавкаПредыдущегоПятогоМесяца,
		               |		0 КАК СтавкаПредыдущегоШестогоМесяца,
					   |        0 КАК СтавкаНачалаГода,
					   |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -1) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -1) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Оклад 
					   |                ИНАЧЕ 0
					   |		КОНЕЦ КАК ОкладПредыдущегоПервогоМесяца,
		               |		0 КАК ОкладПредыдущегоВторогоМесяца,
		               |		0 КАК ОкладПредыдущегоТретьегоМесяца,
		               |		0 КАК ОкладПредыдущегоЧетвертогоМесяца,
		               |		0 КАК ОкладПредыдущегоПятогоМесяца,
		               |		0 КАК ОкладПредыдущегоШестогоМесяца,
					   |		0 КАК ОкладНачалаГода
		               |	ИЗ
		               |		РегистрСведений.КадровыеСведенияСотрудниковОрганизаций.СрезПоследних(
					   |							ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -1), 
					   |							Организация = &Организация И Сценарий = &Сценарий
					   |							%ДопУсловие%) КАК КадровыеСведенияСотрудниковОрганизацийСрезПоследних
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ФизическоеЛицо,
		               |		ВЫБОР
		               |			КОГДА ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 2) < &ДатаСреза
		               |				ТОГДА &ДатаСреза
		               |			ИНАЧЕ ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 2)
		               |		КОНЕЦ,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Организация,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Подразделение,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.МестоВозникновенияЗатрат,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ПозицияШтатногоРасписания,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.КодГрейда,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода,
		               |		0,
					   |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -2) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -2) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Ставка
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0, 
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -2) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -2) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Оклад
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0
		               |	ИЗ
		               |		РегистрСведений.КадровыеСведенияСотрудниковОрганизаций.СрезПоследних(
					   |							ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -2), 
					   |							Организация = &Организация И Сценарий = &Сценарий
					   |							%ДопУсловие%) КАК КадровыеСведенияСотрудниковОрганизацийСрезПоследних
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ФизическоеЛицо,
		               |		ВЫБОР
		               |			КОГДА ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 3) < &ДатаСреза
		               |				ТОГДА &ДатаСреза
		               |			ИНАЧЕ ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 3)
		               |		КОНЕЦ,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Организация,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Подразделение, 
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.МестоВозникновенияЗатрат, 
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ПозицияШтатногоРасписания,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.КодГрейда,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -3) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -3) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Ставка
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -3) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -3) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Оклад
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0
		               |	ИЗ
		               |		РегистрСведений.КадровыеСведенияСотрудниковОрганизаций.СрезПоследних(
					   |							ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -3), 
					   |							Организация = &Организация И Сценарий = &Сценарий
					   |							%ДопУсловие%) КАК КадровыеСведенияСотрудниковОрганизацийСрезПоследних
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ФизическоеЛицо,
		               |		ВЫБОР
		               |			КОГДА ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 4) < &ДатаСреза
		               |				ТОГДА &ДатаСреза
		               |			ИНАЧЕ ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 4)
		               |		КОНЕЦ,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Организация,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Подразделение, 
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.МестоВозникновенияЗатрат, 
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ПозицияШтатногоРасписания,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.КодГрейда,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -4) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -4) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Ставка
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -4) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -4) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Оклад
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0
		               |	ИЗ
		               |		РегистрСведений.КадровыеСведенияСотрудниковОрганизаций.СрезПоследних(
					   |							ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -4), 
					   |							Организация = &Организация И Сценарий = &Сценарий
					   |							%ДопУсловие%) КАК КадровыеСведенияСотрудниковОрганизацийСрезПоследних
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ФизическоеЛицо,
		               |		ВЫБОР
		               |			КОГДА ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 5) < &ДатаСреза
		               |				ТОГДА &ДатаСреза
		               |			ИНАЧЕ ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 5)
		               |		КОНЕЦ,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Организация,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Подразделение, 
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.МестоВозникновенияЗатрат, 
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ПозицияШтатногоРасписания,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.КодГрейда,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -5) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -5) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Ставка
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -5) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -5) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Оклад
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0
		               |	ИЗ
		               |		РегистрСведений.КадровыеСведенияСотрудниковОрганизаций.СрезПоследних(
					   |							ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -5), 
					   |							Организация = &Организация И Сценарий = &Сценарий
					   |							%ДопУсловие%) КАК КадровыеСведенияСотрудниковОрганизацийСрезПоследних
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ФизическоеЛицо,
		               |		ВЫБОР
		               |			КОГДА ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 6) < &ДатаСреза
		               |				ТОГДА &ДатаСреза
		               |			ИНАЧЕ ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 6)
		               |		КОНЕЦ,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Организация,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Подразделение, 
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.МестоВозникновенияЗатрат, 
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ПозицияШтатногоРасписания,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.КодГрейда,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -6) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -6) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Ставка
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -6) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -6) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Оклад
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0
		               |	ИЗ
		               |		РегистрСведений.КадровыеСведенияСотрудниковОрганизаций.СрезПоследних(
					   |								ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -6), 
					   |								Организация = &Организация И Сценарий = &Сценарий
					   |								%ДопУсловие%) КАК КадровыеСведенияСотрудниковОрганизацийСрезПоследних
					   | 
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ФизическоеЛицо,
		               |		ВЫБОР
		               |			КОГДА НАЧАЛОПЕРИОДА(&ДатаСреза, ГОД) <= &ДатаСреза
		               |				ТОГДА &ДатаСреза
		               |			ИНАЧЕ НАЧАЛОПЕРИОДА(&ДатаСреза, ГОД)
		               |		КОНЕЦ,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Организация,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Подразделение, 
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.МестоВозникновенияЗатрат, 
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ПозицияШтатногоРасписания,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.КодГрейда,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА НАЧАЛОПЕРИОДА(&ДатаСреза, ГОД) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И НАЧАЛОПЕРИОДА(&ДатаСреза, ГОД) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Ставка
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА НАЧАЛОПЕРИОДА(&ДатаСреза, ГОД) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И НАЧАЛОПЕРИОДА(&ДатаСреза, ГОД) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Оклад
					   |				ИНАЧЕ 0
					   |		КОНЕЦ
		               |	ИЗ
		               |		РегистрСведений.КадровыеСведенияСотрудниковОрганизаций.СрезПоследних(
					   |								НАЧАЛОПЕРИОДА(&ДатаСреза, ГОД), 
					   |								Организация = &Организация И Сценарий = &Сценарий
					   |								%ДопУсловие%) КАК КадровыеСведенияСотрудниковОрганизацийСрезПоследних ) КАК КадровыеДанныеПредыдущие
					   |     
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	КадровыеДанныеПредыдущие.ФизическоеЛицо,
		               |	КадровыеДанныеПредыдущие.Период,
		               |	КадровыеДанныеПредыдущие.Организация,
		               |	КадровыеДанныеПредыдущие.Подразделение,
		               |	КадровыеДанныеПредыдущие.МестоВозникновенияЗатрат, 
		               |	КадровыеДанныеПредыдущие.ПозицияШтатногоРасписания,
		               |	КадровыеДанныеПредыдущие.КодГрейда,
		               |	КадровыеДанныеПредыдущие.НачалоПериода,
		               |	КадровыеДанныеПредыдущие.ОкончаниеПериода";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ДопУсловие%", ДопУсловие);
		
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Сценарий", Сценарий);
		Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(МесяцЗначение));
		Запрос.Выполнить();
		
		#Область ЗапросСуммыОкладов12Месяцев
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ВыручкаГодовая.ФизическоеЛицо КАК ФизическоеЛицо,
		               |	ВыручкаГодовая.Период КАК Период,
		               |	ВыручкаГодовая.Организация КАК Организация,
		               |	ВыручкаГодовая.Подразделение КАК Подразделение,
		               |	ВыручкаГодовая.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
		               |	ВыручкаГодовая.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
		               |	ВыручкаГодовая.КодГрейда КАК КодГрейда,
		               |	//ВыручкаГодовая.НачалоПериода КАК НачалоПериода,
		               |	//ВыручкаГодовая.ОкончаниеПериода КАК ОкончаниеПериода,
		               |	СУММА(ВыручкаГодовая.СтавкаЯнварь) КАК СтавкаЯнварь,
		               |	СУММА(ВыручкаГодовая.СтавкаФевраль) КАК СтавкаФевраль,
		               |	СУММА(ВыручкаГодовая.СтавкаМарт) КАК СтавкаМарт,
		               |	СУММА(ВыручкаГодовая.СтавкаАпрель) КАК СтавкаАпрель,
		               |	СУММА(ВыручкаГодовая.СтавкаМай) КАК СтавкаМай,
		               |	СУММА(ВыручкаГодовая.СтавкаИюнь) КАК СтавкаИюнь,
		               |	СУММА(ВыручкаГодовая.СтавкаИюль) КАК СтавкаИюль,
		               |	СУММА(ВыручкаГодовая.СтавкаАвгуст) КАК СтавкаАвгуст,
		               |	СУММА(ВыручкаГодовая.СтавкаСентябрь) КАК СтавкаСентябрь,
		               |	СУММА(ВыручкаГодовая.СтавкаОктябрь) КАК СтавкаОктябрь,
		               |	СУММА(ВыручкаГодовая.СтавкаНоябрь) КАК СтавкаНоябрь,
		               |	СУММА(ВыручкаГодовая.СтавкаДекабрь) КАК СтавкаДекабрь,
		               |	СУММА(ВыручкаГодовая.ОкладЯнварь) КАК ОкладЯнварь,
		               |	СУММА(ВыручкаГодовая.ОкладФевраль) КАК ОкладФевраль,
		               |	СУММА(ВыручкаГодовая.ОкладМарт) КАК ОкладМарт,
		               |	СУММА(ВыручкаГодовая.ОкладАпрель) КАК ОкладАпрель,
		               |	СУММА(ВыручкаГодовая.ОкладМай) КАК ОкладМай,
		               |	СУММА(ВыручкаГодовая.ОкладИюнь) КАК ОкладИюнь,
		               |	СУММА(ВыручкаГодовая.ОкладИюль) КАК ОкладИюль,
		               |	СУММА(ВыручкаГодовая.ОкладАвгуст) КАК ОкладАвгуст,
		               |	СУММА(ВыручкаГодовая.ОкладСентябрь) КАК ОкладСентябрь,
		               |	СУММА(ВыручкаГодовая.ОкладОктябрь) КАК ОкладОктябрь,
		               |	СУММА(ВыручкаГодовая.ОкладНоябрь) КАК ОкладНоябрь,
		               |	СУММА(ВыручкаГодовая.ОкладДекабрь) КАК ОкладДекабрь
		               |ПОМЕСТИТЬ ВТВыручкаГодовая
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
		               |		ВЫБОР
		               |			КОГДА ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1) < &ДатаСреза
		               |				ТОГДА &ДатаСреза
		               |			ИНАЧЕ ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1)
		               |		КОНЕЦ КАК Период,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Организация КАК Организация,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Подразделение КАК Подразделение,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.КодГрейда КАК КодГрейда,
		               |		//КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода КАК НачалоПериода,
		               |		//КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода КАК ОкончаниеПериода,
		               |		ВЫБОР КОГДА &НачалоГода >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И &НачалоГода <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Ставка
					   |				ИНАЧЕ 0
					   |		КОНЕЦ КАК СтавкаЯнварь,
		               |		0 КАК СтавкаФевраль,
		               |		0 КАК СтавкаМарт,
		               |		0 КАК СтавкаАпрель,
		               |		0 КАК СтавкаМай,
		               |		0 КАК СтавкаИюнь,
		               |		0 КАК СтавкаИюль,
		               |		0 КАК СтавкаАвгуст,
		               |		0 КАК СтавкаСентябрь,
		               |		0 КАК СтавкаОктябрь,
		               |		0 КАК СтавкаНоябрь,
		               |		0 КАК СтавкаДекабрь,
		               |		ВЫБОР КОГДА &НачалоГода >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И &НачалоГода <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Оклад
					   |				ИНАЧЕ 0
					   |		КОНЕЦ  КАК ОкладЯнварь,
		               |		0 КАК ОкладФевраль,
		               |		0 КАК ОкладМарт,
		               |		0 КАК ОкладАпрель,
		               |		0 КАК ОкладМай,
		               |		0 КАК ОкладИюнь,
		               |		0 КАК ОкладИюль,
		               |		0 КАК ОкладАвгуст,
		               |		0 КАК ОкладСентябрь,
		               |		0 КАК ОкладОктябрь,
		               |		0 КАК ОкладНоябрь,
		               |		0 КАК ОкладДекабрь
		               |	ИЗ
		               |		РегистрСведений.КадровыеСведенияСотрудниковОрганизаций.СрезПоследних(&НачалоГода,  
					   |								Организация = &Организация И Сценарий = &Сценарий
					   |								%ДопУсловие%) КАК КадровыеСведенияСотрудниковОрганизацийСрезПоследних
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ФизическоеЛицо,
		               |		ВЫБОР
		               |			КОГДА ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1) < &ДатаСреза
		               |				ТОГДА &ДатаСреза
		               |			ИНАЧЕ ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1)
		               |		КОНЕЦ,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Организация,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Подразделение,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.МестоВозникновенияЗатрат,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ПозицияШтатногоРасписания,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.КодГрейда,
		               |		//КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода,
		               |		//КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 1) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 1) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Ставка
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 1) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 1) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Оклад
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0
		               |	ИЗ
		               |		РегистрСведений.КадровыеСведенияСотрудниковОрганизаций.СрезПоследних(ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 1),  
					   |								Организация = &Организация И Сценарий = &Сценарий
					   |								%ДопУсловие%) КАК КадровыеСведенияСотрудниковОрганизацийСрезПоследних
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ФизическоеЛицо,
		               |		ВЫБОР
		               |			КОГДА ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1) < &ДатаСреза
		               |				ТОГДА &ДатаСреза
		               |			ИНАЧЕ ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1)
		               |		КОНЕЦ,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Организация,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Подразделение,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.МестоВозникновенияЗатрат,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ПозицияШтатногоРасписания,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.КодГрейда,
		               |		//КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода,
		               |		//КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 2) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 2) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Ставка
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 2) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 2) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Оклад
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0
		               |	ИЗ
		               |		РегистрСведений.КадровыеСведенияСотрудниковОрганизаций.СрезПоследних(ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 2),  
					   |								Организация = &Организация И Сценарий = &Сценарий
					   |								%ДопУсловие%) КАК КадровыеСведенияСотрудниковОрганизацийСрезПоследних
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ФизическоеЛицо,
		               |		ВЫБОР
		               |			КОГДА ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1) < &ДатаСреза
		               |				ТОГДА &ДатаСреза
		               |			ИНАЧЕ ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1)
		               |		КОНЕЦ,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Организация,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Подразделение,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.МестоВозникновенияЗатрат,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ПозицияШтатногоРасписания,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.КодГрейда,
		               |		//КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода,
		               |		//КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 3) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 3) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Ставка
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 3) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 3) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Оклад
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0
		               |	ИЗ
		               |		РегистрСведений.КадровыеСведенияСотрудниковОрганизаций.СрезПоследних(ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 3),  
					   |								Организация = &Организация И Сценарий = &Сценарий
					   |								%ДопУсловие%) КАК КадровыеСведенияСотрудниковОрганизацийСрезПоследних
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ФизическоеЛицо,
		               |		ВЫБОР
		               |			КОГДА ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1) < &ДатаСреза
		               |				ТОГДА &ДатаСреза
		               |			ИНАЧЕ ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1)
		               |		КОНЕЦ,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Организация,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Подразделение,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.МестоВозникновенияЗатрат,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ПозицияШтатногоРасписания,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.КодГрейда,
		               |		//КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода,
		               |		//КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 4) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 4) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Ставка
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 4) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 4) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Оклад
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0
		               |	ИЗ
		               |		РегистрСведений.КадровыеСведенияСотрудниковОрганизаций.СрезПоследних(ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 4),  
					   |								Организация = &Организация И Сценарий = &Сценарий
					   |								%ДопУсловие%) КАК КадровыеСведенияСотрудниковОрганизацийСрезПоследних
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ФизическоеЛицо,
		               |		ВЫБОР
		               |			КОГДА ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1) < &ДатаСреза
		               |				ТОГДА &ДатаСреза
		               |			ИНАЧЕ ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1)
		               |		КОНЕЦ,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Организация,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Подразделение,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.МестоВозникновенияЗатрат,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ПозицияШтатногоРасписания,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.КодГрейда,
		               |		//КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода,
		               |		//КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 5) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 5) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Ставка
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 5) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 5) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Оклад
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0
		               |	ИЗ
		               |		РегистрСведений.КадровыеСведенияСотрудниковОрганизаций.СрезПоследних(ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 5),  
					   |								Организация = &Организация И Сценарий = &Сценарий
					   |								%ДопУсловие%) КАК КадровыеСведенияСотрудниковОрганизацийСрезПоследних
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ФизическоеЛицо,
		               |		ВЫБОР
		               |			КОГДА ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1) < &ДатаСреза
		               |				ТОГДА &ДатаСреза
		               |			ИНАЧЕ ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1)
		               |		КОНЕЦ,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Организация,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Подразделение,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.МестоВозникновенияЗатрат,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ПозицияШтатногоРасписания,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.КодГрейда,
		               |		//КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода,
		               |		//КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 6) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 6) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Ставка
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 6) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 6) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Оклад
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0
		               |	ИЗ
		               |		РегистрСведений.КадровыеСведенияСотрудниковОрганизаций.СрезПоследних(ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 6),  
					   |								Организация = &Организация И Сценарий = &Сценарий
					   |								%ДопУсловие%) КАК КадровыеСведенияСотрудниковОрганизацийСрезПоследних
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ФизическоеЛицо,
		               |		ВЫБОР
		               |			КОГДА ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1) < &ДатаСреза
		               |				ТОГДА &ДатаСреза
		               |			ИНАЧЕ ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1)
		               |		КОНЕЦ,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Организация,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Подразделение,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.МестоВозникновенияЗатрат,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ПозицияШтатногоРасписания,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.КодГрейда,
		               |		//КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода,
		               |		//КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 7) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 7) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Ставка
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 7) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 7) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Оклад
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0
		               |	ИЗ
		               |		РегистрСведений.КадровыеСведенияСотрудниковОрганизаций.СрезПоследних(ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 7),  
					   |								Организация = &Организация И Сценарий = &Сценарий
					   |								%ДопУсловие%) КАК КадровыеСведенияСотрудниковОрганизацийСрезПоследних
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ФизическоеЛицо,
		               |		ВЫБОР
		               |			КОГДА ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1) < &ДатаСреза
		               |				ТОГДА &ДатаСреза
		               |			ИНАЧЕ ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1)
		               |		КОНЕЦ,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Организация,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Подразделение,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.МестоВозникновенияЗатрат,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ПозицияШтатногоРасписания,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.КодГрейда,
		               |		//КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода,
		               |		//КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 8) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 8) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Ставка
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 8) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 8) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Оклад
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0
		               |	ИЗ
		               |		РегистрСведений.КадровыеСведенияСотрудниковОрганизаций.СрезПоследних(ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 8),  
					   |								Организация = &Организация И Сценарий = &Сценарий
					   |								%ДопУсловие%) КАК КадровыеСведенияСотрудниковОрганизацийСрезПоследних
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ФизическоеЛицо,
		               |		ВЫБОР
		               |			КОГДА ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1) < &ДатаСреза
		               |				ТОГДА &ДатаСреза
		               |			ИНАЧЕ ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1)
		               |		КОНЕЦ,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Организация,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Подразделение,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.МестоВозникновенияЗатрат,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ПозицияШтатногоРасписания,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.КодГрейда,
		               |		//КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода,
		               |		//КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 9) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 9) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Ставка
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 9) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 9) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Оклад
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0
		               |	ИЗ
		               |		РегистрСведений.КадровыеСведенияСотрудниковОрганизаций.СрезПоследних(ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 9),  
					   |								Организация = &Организация И Сценарий = &Сценарий
					   |								%ДопУсловие%) КАК КадровыеСведенияСотрудниковОрганизацийСрезПоследних
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ФизическоеЛицо,
		               |		ВЫБОР
		               |			КОГДА ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1) < &ДатаСреза
		               |				ТОГДА &ДатаСреза
		               |			ИНАЧЕ ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1)
		               |		КОНЕЦ,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Организация,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Подразделение,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.МестоВозникновенияЗатрат,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ПозицияШтатногоРасписания,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.КодГрейда,
		               |		//КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода,
		               |		//КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 10) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 10) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Ставка
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 10) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 10) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Оклад
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0
		               |	ИЗ
		               |		РегистрСведений.КадровыеСведенияСотрудниковОрганизаций.СрезПоследних(ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 10),  
					   |								Организация = &Организация И Сценарий = &Сценарий
					   |								%ДопУсловие%) КАК КадровыеСведенияСотрудниковОрганизацийСрезПоследних
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ФизическоеЛицо,
		               |		ВЫБОР
		               |			КОГДА ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1) < &ДатаСреза
		               |				ТОГДА &ДатаСреза
		               |			ИНАЧЕ ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1)
		               |		КОНЕЦ,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Организация,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Подразделение,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.МестоВозникновенияЗатрат,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ПозицияШтатногоРасписания,
		               |		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.КодГрейда,
		               |		//КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода,
		               |		//КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 11) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 11) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Ставка
					   |				ИНАЧЕ 0
					   |		КОНЕЦ,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 11) >= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода 
					   |              			И ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 11) <= КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода
		               |				ТОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Оклад
					   |				ИНАЧЕ 0
					   |		КОНЕЦ
		               |	ИЗ
		               |		РегистрСведений.КадровыеСведенияСотрудниковОрганизаций.СрезПоследних(
					   |								ДОБАВИТЬКДАТЕ(&НачалоГода, МЕСЯЦ, 11), 
					   |								Организация = &Организация И Сценарий = &Сценарий
					   |								%ДопУсловие%) КАК КадровыеСведенияСотрудниковОрганизацийСрезПоследних) КАК ВыручкаГодовая
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВыручкаГодовая.ФизическоеЛицо,
		               |	ВыручкаГодовая.Период,
		               |	ВыручкаГодовая.Организация,
		               |	ВыручкаГодовая.Подразделение,
		               |	ВыручкаГодовая.МестоВозникновенияЗатрат,
		               |	ВыручкаГодовая.ПозицияШтатногоРасписания,
		               |	ВыручкаГодовая.КодГрейда 
					   |	//,
		               |	//ВыручкаГодовая.НачалоПериода,
		               |	//ВыручкаГодовая.ОкончаниеПериода
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТВыручкаГодовая.ФизическоеЛицо КАК ФизическоеЛицо,
		               |	ВТВыручкаГодовая.Период КАК Период,
		               |	ВТВыручкаГодовая.Организация КАК Организация,
		               |	ВТВыручкаГодовая.Подразделение КАК Подразделение,
		               |	ВТВыручкаГодовая.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
		               |	ВТВыручкаГодовая.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
		               |	ВТВыручкаГодовая.КодГрейда КАК КодГрейда,
		               |	//ВТВыручкаГодовая.НачалоПериода КАК НачалоПериода,
		               |	//ВТВыручкаГодовая.ОкончаниеПериода КАК ОкончаниеПериода,
		               |	ВТВыручкаГодовая.СтавкаЯнварь * ВТВыручкаГодовая.ОкладЯнварь + ВТВыручкаГодовая.СтавкаФевраль * ВТВыручкаГодовая.ОкладФевраль + ВТВыручкаГодовая.СтавкаМарт * ВТВыручкаГодовая.ОкладМарт + ВТВыручкаГодовая.СтавкаАпрель * ВТВыручкаГодовая.ОкладАпрель + ВТВыручкаГодовая.СтавкаМай * ВТВыручкаГодовая.ОкладМай + ВТВыручкаГодовая.СтавкаИюнь * ВТВыручкаГодовая.ОкладИюнь + ВТВыручкаГодовая.СтавкаИюль * ВТВыручкаГодовая.ОкладИюль + ВТВыручкаГодовая.СтавкаАвгуст * ВТВыручкаГодовая.ОкладАвгуст + ВТВыручкаГодовая.СтавкаСентябрь * ВТВыручкаГодовая.ОкладСентябрь + ВТВыручкаГодовая.СтавкаОктябрь * ВТВыручкаГодовая.ОкладОктябрь + ВТВыручкаГодовая.СтавкаНоябрь * ВТВыручкаГодовая.ОкладНоябрь + ВТВыручкаГодовая.СтавкаДекабрь * ВТВыручкаГодовая.ОкладДекабрь КАК СуммаОкладов12Месяцев
		               |ПОМЕСТИТЬ ВТСуммаОкладовЗаГод
		               |ИЗ
		               |	ВТВыручкаГодовая КАК ВТВыручкаГодовая";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ДопУсловие%", ДопУсловие);
		
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Сценарий", Сценарий);
		Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(МесяцЗначение));
		Запрос.УстановитьПараметр("НачалоГода", ДобавитьМесяц(НачалоГода(МесяцЗначение),-12));
		Запрос.Выполнить();		
		
		#КонецОбласти
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВТТаблицаФизЛицПоПериодам.ФизическоеЛицо КАК ФизическоеЛицо,
		               |	ВТТаблицаФизЛицПоПериодам.Период КАК Период,
		               |	ВТТаблицаФизЛицПоПериодам.Период КАК МесяцНачисления,
		               |	ВТТаблицаФизЛицПоПериодам.Организация КАК Организация,
		               |	ВТТаблицаФизЛицПоПериодам.Подразделение КАК Подразделение,
		               |	ВТТаблицаФизЛицПоПериодам.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
		               |	ВТТаблицаФизЛицПоПериодам.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
		               |	ВТТаблицаФизЛицПоПериодам.КодГрейда КАК КодГрейда,
		               |	ВТТаблицаФизЛицПоПериодам.НачалоПериода КАК НачалоПериода,
		               |	ВТТаблицаФизЛицПоПериодам.НачалоПериода КАК ДатаНачала,
		               |	ВТТаблицаФизЛицПоПериодам.НачалоПериода КАК ПериодДействия,
		               |	ВТТаблицаФизЛицПоПериодам.НачалоПериода КАК ПериодРегистрации,
		               |	ВТТаблицаФизЛицПоПериодам.ОкончаниеПериода КАК ОкончаниеПериода,
		               |	ВТТаблицаФизЛицПоПериодам.ОкончаниеПериода КАК ДатаОкончания,
		               |	ВЫБОР
		               |		КОГДА ВТКадровыеДанныеТекущие.СтавкаТекущегоМесяца ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКадровыеДанныеТекущие.СтавкаТекущегоМесяца
		               |	КОНЕЦ КАК СтавкаТекущегоМесяца,
		               |	ВЫБОР
		               |		КОГДА ВТКадровыеДанныеТекущие.ОкладТекущегоМесяца ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКадровыеДанныеТекущие.ОкладТекущегоМесяца
		               |	КОНЕЦ КАК ОкладТекущегоМесяца,
		               |	ВЫБОР
		               |		КОГДА ВТКадровыеДанныеПредыдущие.СтавкаПредыдущегоПервогоМесяца ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКадровыеДанныеПредыдущие.СтавкаПредыдущегоПервогоМесяца
		               |	КОНЕЦ КАК СтавкаПредыдущегоПервогоМесяца,
		               |	ВЫБОР
		               |		КОГДА ВТКадровыеДанныеПредыдущие.СтавкаПредыдущегоВторогоМесяца ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКадровыеДанныеПредыдущие.СтавкаПредыдущегоВторогоМесяца
		               |	КОНЕЦ КАК СтавкаПредыдущегоВторогоМесяца,
		               |	ВЫБОР
		               |		КОГДА ВТКадровыеДанныеПредыдущие.СтавкаПредыдущегоТретьегоМесяца ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКадровыеДанныеПредыдущие.СтавкаПредыдущегоТретьегоМесяца
		               |	КОНЕЦ КАК СтавкаПредыдущегоТретьегоМесяца,
		               |	ВЫБОР
		               |		КОГДА ВТКадровыеДанныеПредыдущие.СтавкаПредыдущегоЧетвертогоМесяца ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКадровыеДанныеПредыдущие.СтавкаПредыдущегоЧетвертогоМесяца
		               |	КОНЕЦ КАК СтавкаПредыдущегоЧетвертогоМесяца,
		               |	ВЫБОР
		               |		КОГДА ВТКадровыеДанныеПредыдущие.СтавкаПредыдущегоПятогоМесяца ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКадровыеДанныеПредыдущие.СтавкаПредыдущегоПятогоМесяца
		               |	КОНЕЦ КАК СтавкаПредыдущегоПятогоМесяца,
		               |	ВЫБОР
		               |		КОГДА ВТКадровыеДанныеПредыдущие.СтавкаПредыдущегоШестогоМесяца ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКадровыеДанныеПредыдущие.СтавкаПредыдущегоШестогоМесяца
		               |	КОНЕЦ КАК СтавкаПредыдущегоШестогоМесяца,
		               |	ВЫБОР
		               |		КОГДА ВТКадровыеДанныеПредыдущие.СтавкаНачалаГода ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКадровыеДанныеПредыдущие.СтавкаНачалаГода
		               |	КОНЕЦ КАК СтавкаНачалаГода,
		               |	ВЫБОР
		               |		КОГДА ВТКадровыеДанныеПредыдущие.ОкладПредыдущегоПервогоМесяца ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКадровыеДанныеПредыдущие.ОкладПредыдущегоПервогоМесяца
		               |	КОНЕЦ КАК ОкладПредыдущегоПервогоМесяца,
		               |	ВЫБОР
		               |		КОГДА ВТКадровыеДанныеПредыдущие.ОкладПредыдущегоВторогоМесяца ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКадровыеДанныеПредыдущие.ОкладПредыдущегоВторогоМесяца
		               |	КОНЕЦ КАК ОкладПредыдущегоВторогоМесяца,
		               |	ВЫБОР
		               |		КОГДА ВТКадровыеДанныеПредыдущие.ОкладПредыдущегоТретьегоМесяца ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКадровыеДанныеПредыдущие.ОкладПредыдущегоТретьегоМесяца
		               |	КОНЕЦ КАК ОкладПредыдущегоТретьегоМесяца,
		               |	ВЫБОР
		               |		КОГДА ВТКадровыеДанныеПредыдущие.ОкладПредыдущегоЧетвертогоМесяца ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКадровыеДанныеПредыдущие.ОкладПредыдущегоЧетвертогоМесяца
		               |	КОНЕЦ КАК ОкладПредыдущегоЧетвертогоМесяца,
		               |	ВЫБОР
		               |		КОГДА ВТКадровыеДанныеПредыдущие.ОкладПредыдущегоПятогоМесяца ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКадровыеДанныеПредыдущие.ОкладПредыдущегоПятогоМесяца
		               |	КОНЕЦ КАК ОкладПредыдущегоПятогоМесяца,
		               |	ВЫБОР
		               |		КОГДА ВТКадровыеДанныеПредыдущие.ОкладПредыдущегоШестогоМесяца ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКадровыеДанныеПредыдущие.ОкладПредыдущегоШестогоМесяца
		               |	КОНЕЦ КАК ОкладПредыдущегоШестогоМесяца,
		               |	ВЫБОР
		               |		КОГДА ВТКадровыеДанныеПредыдущие.ОкладНачалаГода ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКадровыеДанныеПредыдущие.ОкладНачалаГода
		               |	КОНЕЦ КАК ОкладНачалаГода,
		               |	ВЫБОР
		               |		КОГДА ВТСтавкаПремии.СтавкаЕжемесячнойПремии ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТСтавкаПремии.СтавкаЕжемесячнойПремии
		               |	КОНЕЦ КАК СтавкаЕжемесячнойПремии,
		               |	ВЫБОР
		               |		КОГДА ВТСтавкаПремии.СтавкаКвартальнойПремии ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТСтавкаПремии.СтавкаКвартальнойПремии
		               |	КОНЕЦ КАК СтавкаКвартальнойПремии,
		               |	ВЫБОР
		               |		КОГДА ВТСтавкаПремии.СтавкаПремииЗаПолугодие ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТСтавкаПремии.СтавкаПремииЗаПолугодие
		               |	КОНЕЦ КАК СтавкаПремииЗаПолугодие,
		               |	ВЫБОР
		               |		КОГДА ВТСтавкаПремии.СтавкаГодовойПремии ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТСтавкаПремии.СтавкаГодовойПремии
		               |	КОНЕЦ КАК СтавкаГодовойПремии,
		               |	ВЫБОР
		               |		КОГДА ВТКоэффициентыПремийТекущегоГода.КоэффициентКвартальнойПремии1КварталаТекущегоГода ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКоэффициентыПремийТекущегоГода.КоэффициентКвартальнойПремии1КварталаТекущегоГода
		               |	КОНЕЦ КАК КоэффициентКвартальнойПремии1КварталаТекущегоГода,
		               |	ВЫБОР
		               |		КОГДА ВТКоэффициентыПремийТекущегоГода.КоэффициентКвартальнойПремии2КварталаТекущегоГода ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКоэффициентыПремийТекущегоГода.КоэффициентКвартальнойПремии2КварталаТекущегоГода
		               |	КОНЕЦ КАК КоэффициентКвартальнойПремии2КварталаТекущегоГода,
		               |	ВЫБОР
		               |		КОГДА ВТКоэффициентыПремийТекущегоГода.КоэффициентКвартальнойПремии3КварталаТекущегоГода ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКоэффициентыПремийТекущегоГода.КоэффициентКвартальнойПремии3КварталаТекущегоГода
		               |	КОНЕЦ КАК КоэффициентКвартальнойПремии3КварталаТекущегоГода,
		               |	ВЫБОР
		               |		КОГДА ВТКоэффициентыПремийТекущегоГода.КоэффициентКвартальнойПремии4КварталаТекущегоГода ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКоэффициентыПремийТекущегоГода.КоэффициентКвартальнойПремии4КварталаТекущегоГода
		               |	КОНЕЦ КАК КоэффициентКвартальнойПремии4КварталаТекущегоГода,
		               |	ВЫБОР
		               |		КОГДА ВТКоэффициентыПремийТекущегоГода.КоэффициентПремииЗа1ПолугодиеТекущегоГода ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКоэффициентыПремийТекущегоГода.КоэффициентПремииЗа1ПолугодиеТекущегоГода
		               |	КОНЕЦ КАК КоэффициентПремииЗа1ПолугодиеТекущегоГода,
		               |	ВЫБОР
		               |		КОГДА ВТКоэффициентыПремийТекущегоГода.КоэффициентПремииЗа2ПолугодиеТекущегоГода ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКоэффициентыПремийТекущегоГода.КоэффициентПремииЗа2ПолугодиеТекущегоГода
		               |	КОНЕЦ КАК КоэффициентПремииЗа2ПолугодиеТекущегоГода,
		               |	ВЫБОР
		               |		КОГДА ВТКоэффициентыПремийПрошлогоГода.КоэффициентКвартальнойПремии1КварталаПрошлогоГода ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКоэффициентыПремийПрошлогоГода.КоэффициентКвартальнойПремии1КварталаПрошлогоГода
		               |	КОНЕЦ КАК КоэффициентКвартальнойПремии1КварталаПрошлогоГода,
		               |	ВЫБОР
		               |		КОГДА ВТКоэффициентыПремийПрошлогоГода.КоэффициентКвартальнойПремии2КварталаПрошлогоГода ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКоэффициентыПремийПрошлогоГода.КоэффициентКвартальнойПремии2КварталаПрошлогоГода
		               |	КОНЕЦ КАК КоэффициентКвартальнойПремии2КварталаПрошлогоГода,
		               |	ВЫБОР
		               |		КОГДА ВТКоэффициентыПремийПрошлогоГода.КоэффициентКвартальнойПремии3КварталаПрошлогоГода ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКоэффициентыПремийПрошлогоГода.КоэффициентКвартальнойПремии3КварталаПрошлогоГода
		               |	КОНЕЦ КАК КоэффициентКвартальнойПремии3КварталаПрошлогоГода,
		               |	ВЫБОР
		               |		КОГДА ВТКоэффициентыПремийПрошлогоГода.КоэффициентКвартальнойПремии4КварталаПрошлогоГода ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКоэффициентыПремийПрошлогоГода.КоэффициентКвартальнойПремии4КварталаПрошлогоГода
		               |	КОНЕЦ КАК КоэффициентКвартальнойПремии4КварталаПрошлогоГода,
		               |	ВЫБОР
		               |		КОГДА ВТКоэффициентыПремийПрошлогоГода.КоэффициентПремииЗа1ПолугодиеПрошлогоГода ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКоэффициентыПремийПрошлогоГода.КоэффициентПремииЗа1ПолугодиеПрошлогоГода
		               |	КОНЕЦ КАК КоэффициентПремииЗа1ПолугодиеПрошлогоГода,
		               |	ВЫБОР
		               |		КОГДА ВТКоэффициентыПремийПрошлогоГода.КоэффициентПремииЗа2ПолугодиеПрошлогоГода ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКоэффициентыПремийПрошлогоГода.КоэффициентПремииЗа2ПолугодиеПрошлогоГода
		               |	КОНЕЦ КАК КоэффициентПремииЗа2ПолугодиеПрошлогоГода,
		               |	ВЫБОР
		               |		КОГДА ВТКоэффициентыПремийТекущегоГода.КоэффициентГодовойПремииТекущегоГода ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКоэффициентыПремийТекущегоГода.КоэффициентГодовойПремииТекущегоГода
		               |	КОНЕЦ КАК КоэффициентГодовойПремииТекущегоГода,
		               |	ВЫБОР
		               |		КОГДА ВТСуммаОкладовЗаГод.СуммаОкладов12Месяцев ЕСТЬ NULL
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТСуммаОкладовЗаГод.СуммаОкладов12Месяцев
		               |	КОНЕЦ КАК СуммаОкладов12Месяцев
		               |ИЗ
		               |	ВТТаблицаФизЛицПоПериодам КАК ВТТаблицаФизЛицПоПериодам
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеТекущие КАК ВТКадровыеДанныеТекущие
		               |		ПО ВТТаблицаФизЛицПоПериодам.ФизическоеЛицо = ВТКадровыеДанныеТекущие.ФизическоеЛицо
		               |			И ВТТаблицаФизЛицПоПериодам.Период = ВТКадровыеДанныеТекущие.Период
		               |			И ВТТаблицаФизЛицПоПериодам.Организация = ВТКадровыеДанныеТекущие.Организация
		               |			И ВТТаблицаФизЛицПоПериодам.Подразделение = ВТКадровыеДанныеТекущие.Подразделение
		               |			И ВТТаблицаФизЛицПоПериодам.МестоВозникновенияЗатрат = ВТКадровыеДанныеТекущие.МестоВозникновенияЗатрат
		               |			И ВТТаблицаФизЛицПоПериодам.ПозицияШтатногоРасписания = ВТКадровыеДанныеТекущие.ПозицияШтатногоРасписания
		               |			И ВТТаблицаФизЛицПоПериодам.КодГрейда = ВТКадровыеДанныеТекущие.КодГрейда
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеПредыдущие КАК ВТКадровыеДанныеПредыдущие
		               |		ПО ВТТаблицаФизЛицПоПериодам.ФизическоеЛицо = ВТКадровыеДанныеПредыдущие.ФизическоеЛицо
		               |			И ВТТаблицаФизЛицПоПериодам.Период = ВТКадровыеДанныеПредыдущие.Период
		               |			И ВТТаблицаФизЛицПоПериодам.Организация = ВТКадровыеДанныеПредыдущие.Организация
		               |			И ВТТаблицаФизЛицПоПериодам.Подразделение = ВТКадровыеДанныеПредыдущие.Подразделение
		               |			И ВТТаблицаФизЛицПоПериодам.МестоВозникновенияЗатрат = ВТКадровыеДанныеПредыдущие.МестоВозникновенияЗатрат
		               |			И ВТТаблицаФизЛицПоПериодам.ПозицияШтатногоРасписания = ВТКадровыеДанныеПредыдущие.ПозицияШтатногоРасписания
		               |			И ВТТаблицаФизЛицПоПериодам.КодГрейда = ВТКадровыеДанныеПредыдущие.КодГрейда
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаПремии КАК ВТСтавкаПремии
		               |		ПО ВТТаблицаФизЛицПоПериодам.Период = ВТСтавкаПремии.Период
		               |			И ВТТаблицаФизЛицПоПериодам.КодГрейда = ВТСтавкаПремии.КодГрейда
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыПремийТекущегоГода КАК ВТКоэффициентыПремийТекущегоГода
		               |		ПО ВТТаблицаФизЛицПоПериодам.Период = ВТКоэффициентыПремийТекущегоГода.Период
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыПремийПрошлогоГода КАК ВТКоэффициентыПремийПрошлогоГода
		               |		ПО ВТТаблицаФизЛицПоПериодам.Период = ВТКоэффициентыПремийПрошлогоГода.Период
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТСуммаОкладовЗаГод КАК ВТСуммаОкладовЗаГод
		               |		ПО ВТТаблицаФизЛицПоПериодам.ФизическоеЛицо = ВТСуммаОкладовЗаГод.ФизическоеЛицо
		               |			И ВТТаблицаФизЛицПоПериодам.Период = ВТСуммаОкладовЗаГод.Период
		               |			И ВТТаблицаФизЛицПоПериодам.Организация = ВТСуммаОкладовЗаГод.Организация
		               |			И ВТТаблицаФизЛицПоПериодам.Подразделение = ВТСуммаОкладовЗаГод.Подразделение
		               |			И ВТТаблицаФизЛицПоПериодам.МестоВозникновенияЗатрат = ВТСуммаОкладовЗаГод.МестоВозникновенияЗатрат
		               |			И ВТТаблицаФизЛицПоПериодам.ПозицияШтатногоРасписания = ВТСуммаОкладовЗаГод.ПозицияШтатногоРасписания
		               |			И ВТТаблицаФизЛицПоПериодам.КодГрейда = ВТСуммаОкладовЗаГод.КодГрейда";
		                      
		#КонецОбласти
		
		
		#Область ЗаполнениеТаблицДляПередачиДокументуРасчета
		
		РезультатНачислений = Запрос.Выполнить();
		
		УдаляемыеВТТаблицы = Новый Массив;
		УдаляемыеВТТаблицы.Добавить("ВТКадровыеДанныеТекущие");
		УдаляемыеВТТаблицы.Добавить("ВТКадровыеДанныеПредыдущие");
		УдаляемыеВТТаблицы.Добавить("ВТСтавкаПремии");
		УдаляемыеВТТаблицы.Добавить("ВТКоэффициентыПремийТекущегоГода");
		УдаляемыеВТТаблицы.Добавить("ВТКоэффициентыПремийПрошлогоГода");
		
		Бюджетирование.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдаляемыеВТТаблицы);
		
		Если Не РезультатНачислений.Пустой() Тогда 
			
			ВыборкаРезультатовНачислений = РезультатНачислений.Выбрать();
			Пока ВыборкаРезультатовНачислений.Следующий() Цикл
				
				#Область ЕжемесячнаяПремия
				
				// 1. Ежемесячная премия
				НовоеНачисление = РасчитанныеПоказатели.Начисления.Добавить();
				ЗаполнитьЗначенияСвойств(НовоеНачисление, ВыборкаРезультатовНачислений); 
				НовоеНачисление.ВидНачисления = ПредопределенноеЗначение("Справочник.ВидыНачислений.ЕжемесячнаяПремия");
				Если Месяц(ВыборкаРезультатовНачислений.Период) = 1 Тогда
					НовоеНачисление.Результат = 0;
				ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 12 Тогда
					НовоеНачисление.Результат = (ВыборкаРезультатовНачислений.СтавкаТекущегоМесяца*ВыборкаРезультатовНачислений.ОкладТекущегоМесяца 
												  + ВыборкаРезультатовНачислений.СтавкаПредыдущегоПервогоМесяца*ВыборкаРезультатовНачислений.ОкладПредыдущегоПервогоМесяца)
												    *(ВыборкаРезультатовНачислений.СтавкаЕжемесячнойПремии/100);
				Иначе
					Если ВыборкаРезультатовНачислений.ОкладТекущегоМесяца <> 0 
							И ВыборкаРезультатовНачислений.СтавкаЕжемесячнойПремии <> 0 Тогда
						НовоеНачисление.Результат = (ВыборкаРезультатовНачислений.СтавкаТекущегоМесяца*ВыборкаРезультатовНачислений.ОкладТекущегоМесяца)
													    *(ВыборкаРезультатовНачислений.СтавкаЕжемесячнойПремии/100);
					ИначеЕсли ВыборкаРезультатовНачислений.ОкладПредыдущегоПервогоМесяца <> 0	
								И ВыборкаРезультатовНачислений.СтавкаЕжемесячнойПремии <> 0 Тогда
						НовоеНачисление.Результат = (ВыборкаРезультатовНачислений.СтавкаПредыдущегоПервогоМесяца*ВыборкаРезультатовНачислений.ОкладПредыдущегоПервогоМесяца)
														*(ВыборкаРезультатовНачислений.СтавкаЕжемесячнойПремии/100);
					Иначе
						НовоеНачисление.Результат = 0;
					КонецЕсли;
				КонецЕсли;
				Если ЗначениеЗаполнено(НовоеНачисление.ПозицияШтатногоРасписания) Тогда
					НовоеНачисление.Должность = НовоеНачисление.ПозицияШтатногоРасписания.Должность;	
				КонецЕсли;
				НовоеНачисление.Сумма = НовоеНачисление.Результат;
				
				#КонецОбласти
				
				#Область КвартальнаяПремия
				
				// 2. Квартальная премия 4-го квартала, начисляемая в январе
					
				НовоеНачисление = РасчитанныеПоказатели.Начисления.Добавить();
				ЗаполнитьЗначенияСвойств(НовоеНачисление, ВыборкаРезультатовНачислений); 
				НовоеНачисление.ВидНачисления = ПредопределенноеЗначение("Справочник.ВидыНачислений.КвартальнаяПремия");
				
				СуммаОкладовПредыдущих3Месяцев = (ВыборкаРезультатовНачислений.СтавкаПредыдущегоПервогоМесяца*ВыборкаРезультатовНачислений.ОкладПредыдущегоПервогоМесяца
													  + ВыборкаРезультатовНачислений.СтавкаПредыдущегоВторогоМесяца*ВыборкаРезультатовНачислений.ОкладПредыдущегоВторогоМесяца
													  + ВыборкаРезультатовНачислений.СтавкаПредыдущегоТретьегоМесяца*ВыборкаРезультатовНачислений.ОкладПредыдущегоТретьегоМесяца);
				
				Если Месяц(ВыборкаРезультатовНачислений.Период) = 1 И ВыборкаРезультатовНачислений.Период = ПериодРасчета.ДатаНачала Тогда
					 // Формат(ВыборкаРезультатовНачислений.Период, "ДФ=""ММММ""") = Строка(НастройкиДатаВыплатыБюджетирования.МесяцВыплатыГодовойПремии)
					МесяцВыплатыКвартальнойПремииЗа4Квартал = Неопределено; 
					Если НастройкиДатаВыплатыБюджетирования.Свойство("МесяцВыплатыКвартальнойПремииЗа4Квартал", МесяцВыплатыКвартальнойПремииЗа4Квартал)
							И Не МесяцВыплатыКвартальнойПремииЗа4Квартал = Неопределено Тогда
							//И НастройкиДатаВыплатыБюджетирования.МесяцВыплатыКвартальнойПремииЗа4Квартал = Перечисления.МесяцыГода.Январь Тогда
					    Если Формат(ВыборкаРезультатовНачислений.Период, "ДФ=""ММММ""") = Строка(НастройкиДатаВыплатыБюджетирования.МесяцВыплатыКвартальнойПремииЗа4Квартал) Тогда
							НовоеНачисление.Результат = (ВыборкаРезультатовНачислений.СтавкаТекущегоМесяца*ВыборкаРезультатовНачислений.ОкладТекущегоМесяца) 
															* 3 * (ВыборкаРезультатовНачислений.СтавкаКвартальнойПремии/100) 
															* ВыборкаРезультатовНачислений.КоэффициентКвартальнойПремии4КварталаПрошлогоГода; 
						Иначе
							НовоеНачисление.Результат = 0;									
						КонецЕсли;									
					Иначе
						НовоеНачисление.Результат = 0;									
					КонецЕсли;									
				ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 1 И ВыборкаРезультатовНачислений.Период <> ПериодРасчета.ДатаНачала Тогда
					МесяцВыплатыКвартальнойПремииЗа4Квартал = Неопределено;
					Если НастройкиДатаВыплатыБюджетирования.Свойство("МесяцВыплатыКвартальнойПремииЗа4Квартал", МесяцВыплатыКвартальнойПремииЗа4Квартал) 
							  И Не МесяцВыплатыКвартальнойПремииЗа4Квартал = Неопределено Тогда	
							//И НастройкиДатаВыплатыБюджетирования.МесяцВыплатыКвартальнойПремииЗа4Квартал = Перечисления.МесяцыГода.Январь Тогда
					    Если Формат(ВыборкаРезультатовНачислений.Период, "ДФ=""ММММ""") = Строка(НастройкиДатаВыплатыБюджетирования.МесяцВыплатыКвартальнойПремииЗа4Квартал) Тогда
							НовоеНачисление.Результат = СуммаОкладовПредыдущих3Месяцев 
															* (ВыборкаРезультатовНачислений.СтавкаКвартальнойПремии/100) 
															* ВыборкаРезультатовНачислений.КоэффициентКвартальнойПремии4КварталаПрошлогоГода;  
						Иначе		
							НовоеНачисление.Результат = 0;
						КонецЕсли;
					Иначе		
						НовоеНачисление.Результат = 0;
					КонецЕсли;
					
				// 3. Квартальная премия 1, 2, 3-го кварталов	
				ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 4 Тогда
							
					НовоеНачисление.Результат = СуммаОкладовПредыдущих3Месяцев 
													* (ВыборкаРезультатовНачислений.СтавкаКвартальнойПремии/100) 
													* ВыборкаРезультатовНачислений.КоэффициентКвартальнойПремии1КварталаТекущегоГода;
				
				ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 7 Тогда
					
					НовоеНачисление.Результат = СуммаОкладовПредыдущих3Месяцев 
													* (ВыборкаРезультатовНачислений.СтавкаКвартальнойПремии/100) 
													* ВыборкаРезультатовНачислений.КоэффициентКвартальнойПремии2КварталаТекущегоГода;
													
				ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 10 Тогда
							
					НовоеНачисление.Результат = СуммаОкладовПредыдущих3Месяцев 
													* (ВыборкаРезультатовНачислений.СтавкаКвартальнойПремии/100) 
													* ВыборкаРезультатовНачислений.КоэффициентКвартальнойПремии3КварталаТекущегоГода;
							
				ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 12 Тогда	
					МесяцВыплатыКвартальнойПремииЗа4Квартал = Неопределено;		
					Если НастройкиДатаВыплатыБюджетирования.Свойство("МесяцВыплатыКвартальнойПремииЗа4Квартал", МесяцВыплатыКвартальнойПремииЗа4Квартал)
						    И Не МесяцВыплатыКвартальнойПремииЗа4Квартал = Неопределено Тогда
							//И НастройкиДатаВыплатыБюджетирования.МесяцВыплатыКвартальнойПремииЗа4Квартал = Перечисления.МесяцыГода.Декабрь Тогда
					    Если Формат(ВыборкаРезультатовНачислений.Период, "ДФ=""ММММ""") = Строка(НастройкиДатаВыплатыБюджетирования.МесяцВыплатыКвартальнойПремииЗа4Квартал) Тогда
							НовоеНачисление.Результат = СуммаОкладовПредыдущих3Месяцев 
															* (ВыборкаРезультатовНачислений.СтавкаКвартальнойПремии/100) 
															* ВыборкаРезультатовНачислений.КоэффициентКвартальнойПремии4КварталаТекущегоГода;
						Иначе
							НовоеНачисление.Результат = 0;	
						КонецЕсли;	
					Иначе
						НовоеНачисление.Результат = 0;	
					КонецЕсли;	
				Иначе
					НовоеНачисление.Результат = 0;	
				КонецЕсли;
				Если ЗначениеЗаполнено(НовоеНачисление.ПозицияШтатногоРасписания) Тогда
					НовоеНачисление.Должность = НовоеНачисление.ПозицияШтатногоРасписания.Должность;	
				КонецЕсли;
				НовоеНачисление.Сумма = НовоеНачисление.Результат;
				
				#КонецОбласти
				
				#Область ПолугодоваяПремия
				
				// 4. Полугодовая премия, начисляемая в январе начала бюджетного периода 
					
				НовоеНачисление = РасчитанныеПоказатели.Начисления.Добавить();
				ЗаполнитьЗначенияСвойств(НовоеНачисление, ВыборкаРезультатовНачислений); 
				НовоеНачисление.ВидНачисления = ПредопределенноеЗначение("Справочник.ВидыНачислений.ПремияЗаПолугодие");
				
				СуммаОкладовПредыдущих5Месяцев = (ВыборкаРезультатовНачислений.СтавкаПредыдущегоПервогоМесяца*ВыборкаРезультатовНачислений.ОкладПредыдущегоПервогоМесяца
													  + ВыборкаРезультатовНачислений.СтавкаПредыдущегоВторогоМесяца*ВыборкаРезультатовНачислений.ОкладПредыдущегоВторогоМесяца
													  + ВыборкаРезультатовНачислений.СтавкаПредыдущегоТретьегоМесяца*ВыборкаРезультатовНачислений.ОкладПредыдущегоТретьегоМесяца
													  + ВыборкаРезультатовНачислений.СтавкаПредыдущегоЧетвертогоМесяца*ВыборкаРезультатовНачислений.ОкладПредыдущегоЧетвертогоМесяца 	 
													  + ВыборкаРезультатовНачислений.СтавкаПредыдущегоПятогоМесяца*ВыборкаРезультатовНачислений.ОкладПредыдущегоПятогоМесяца);
				
				
				СуммаОкладовПредыдущих6Месяцев = (ВыборкаРезультатовНачислений.СтавкаПредыдущегоПервогоМесяца*ВыборкаРезультатовНачислений.ОкладПредыдущегоПервогоМесяца
													  + ВыборкаРезультатовНачислений.СтавкаПредыдущегоВторогоМесяца*ВыборкаРезультатовНачислений.ОкладПредыдущегоВторогоМесяца
													  + ВыборкаРезультатовНачислений.СтавкаПредыдущегоТретьегоМесяца*ВыборкаРезультатовНачислений.ОкладПредыдущегоТретьегоМесяца
													  + ВыборкаРезультатовНачислений.СтавкаПредыдущегоЧетвертогоМесяца*ВыборкаРезультатовНачислений.ОкладПредыдущегоЧетвертогоМесяца 	 
													  + ВыборкаРезультатовНачислений.СтавкаПредыдущегоПятогоМесяца*ВыборкаРезультатовНачислений.ОкладПредыдущегоПятогоМесяца
													  + ВыборкаРезультатовНачислений.СтавкаПредыдущегоШестогоМесяца*ВыборкаРезультатовНачислений.ОкладПредыдущегоШестогоМесяца);
				
				Если Месяц(ВыборкаРезультатовНачислений.Период) = 1 И ВыборкаРезультатовНачислений.Период = ПериодРасчета.ДатаНачала Тогда
					МесяцВыплатыПремииЗа2Полугодие = Неопределено;
					Если НастройкиДатаВыплатыБюджетирования.Свойство("МесяцВыплатыПремииЗа2Полугодие", МесяцВыплатыПремииЗа2Полугодие)
						      И Не МесяцВыплатыПремииЗа2Полугодие = Неопределено Тогда
							//И НастройкиДатаВыплатыБюджетирования.МесяцВыплатыПремииЗа2Полугодие = Перечисления.МесяцыГода.Январь Тогда
					    Если Формат(ВыборкаРезультатовНачислений.Период, "ДФ=""ММММ""") = Строка(НастройкиДатаВыплатыБюджетирования.МесяцВыплатыПремииЗа2Полугодие) Тогда
							НовоеНачисление.Результат = (ВыборкаРезультатовНачислений.СтавкаТекущегоМесяца*ВыборкаРезультатовНачислений.ОкладТекущегоМесяца)
															* 6 
															* (ВыборкаРезультатовНачислений.СтавкаПремииЗаПолугодие/100)           
															* ВыборкаРезультатовНачислений.КоэффициентПремииЗа2ПолугодиеПрошлогоГода;  
						Иначе
							НовоеНачисление.Результат = 0;									
						КонецЕсли;
					Иначе
						НовоеНачисление.Результат = 0;									
					КонецЕсли;
				ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 1 И Не ВыборкаРезультатовНачислений.Период = ПериодРасчета.ДатаНачала Тогда		
					МесяцВыплатыПремииЗа2Полугодие = Неопределено;
					Если НастройкиДатаВыплатыБюджетирования.Свойство("МесяцВыплатыПремииЗа2Полугодие", МесяцВыплатыПремииЗа2Полугодие)
							И Не МесяцВыплатыПремииЗа2Полугодие = Неопределено Тогда
							//И НастройкиДатаВыплатыБюджетирования.МесяцВыплатыПремииЗа2Полугодие = Перечисления.МесяцыГода.Январь Тогда
					    Если Формат(ВыборкаРезультатовНачислений.Период, "ДФ=""ММММ""") = Строка(НастройкиДатаВыплатыБюджетирования.МесяцВыплатыПремииЗа2Полугодие) Тогда
							НовоеНачисление.Результат = СуммаОкладовПредыдущих6Месяцев 
															* (ВыборкаРезультатовНачислений.СтавкаПремииЗаПолугодие/100)           
															* ВыборкаРезультатовНачислений.КоэффициентПремииЗа2ПолугодиеТекущегоГода; 
						Иначе
							НовоеНачисление.Результат = 0;									
						КонецЕсли;
					Иначе
						НовоеНачисление.Результат = 0;									
					КонецЕсли;
				ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 12 И Не ВыборкаРезультатовНачислений.Период = ПериодРасчета.ДатаНачала Тогда		
					МесяцВыплатыПремииЗа2Полугодие = Неопределено;
					Если НастройкиДатаВыплатыБюджетирования.Свойство("МесяцВыплатыПремииЗа2Полугодие", МесяцВыплатыПремииЗа2Полугодие) 
							И Не МесяцВыплатыПремииЗа2Полугодие = Неопределено Тогда
							//И НастройкиДатаВыплатыБюджетирования.МесяцВыплатыПремииЗа2Полугодие = Перечисления.МесяцыГода.Декабрь Тогда
					    Если Формат(ВыборкаРезультатовНачислений.Период, "ДФ=""ММММ""") = Строка(НастройкиДатаВыплатыБюджетирования.МесяцВыплатыПремииЗа2Полугодие) Тогда
							НовоеНачисление.Результат = (ВыборкаРезультатовНачислений.СтавкаТекущегоМесяца*ВыборкаРезультатовНачислений.ОкладТекущегоМесяца
														  + СуммаОкладовПредыдущих5Месяцев)
															* (ВыборкаРезультатовНачислений.СтавкаПремииЗаПолугодие/100)           
															* ВыборкаРезультатовНачислений.КоэффициентПремииЗа2ПолугодиеТекущегоГода; 
						Иначе
							НовоеНачисление.Результат = 0;									
						КонецЕсли;
					Иначе
						НовоеНачисление.Результат = 0;									
					КонецЕсли;
				ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 7 И Не ВыборкаРезультатовНачислений.Период = ПериодРасчета.ДатаНачала Тогда		
					
					НовоеНачисление.Результат = СуммаОкладовПредыдущих6Месяцев 
														* (ВыборкаРезультатовНачислений.СтавкаПремииЗаПолугодие/100)           
														* ВыборкаРезультатовНачислений.КоэффициентПремииЗа1ПолугодиеТекущегоГода; 
				Иначе
					НовоеНачисление.Результат = 0;									
				КонецЕсли;
				Если ЗначениеЗаполнено(НовоеНачисление.ПозицияШтатногоРасписания) Тогда
					НовоеНачисление.Должность = НовоеНачисление.ПозицияШтатногоРасписания.Должность;	
				КонецЕсли;
				НовоеНачисление.Сумма = НовоеНачисление.Результат;
				
				#КонецОбласти
				
			#Область ГодоваяПремия
			
				// 5. Годовая премия 
					
				НовоеНачисление = РасчитанныеПоказатели.Начисления.Добавить();
				ЗаполнитьЗначенияСвойств(НовоеНачисление, ВыборкаРезультатовНачислений); 
				НовоеНачисление.ВидНачисления = ПредопределенноеЗначение("Справочник.ВидыНачислений.ГодоваяПремия");
				МесяцВыплатыГодовойПремии = Неопределено;
				Если НачалоГода(ВыборкаРезультатовНачислений.Период) = НачалоГода(ПериодРасчета.ДатаНачала)     //Формат(ВыборкаРезультатовНачислений.Период, "ДФ=""ММММ""")
					И НастройкиДатаВыплатыБюджетирования.Свойство("МесяцВыплатыГодовойПремии", МесяцВыплатыГодовойПремии)                  //
							//И (НастройкиДатаВыплатыБюджетирования.МесяцВыплатыГодовойПремии = Перечисления.МесяцыГода.Июль
							//		ИЛИ НастройкиДатаВыплатыБюджетирования.МесяцВыплатыГодовойПремии = Перечисления.МесяцыГода.Август
							//		ИЛИ НастройкиДатаВыплатыБюджетирования.МесяцВыплатыГодовойПремии = Перечисления.МесяцыГода.Сентябрь
							//		ИЛИ НастройкиДатаВыплатыБюджетирования.МесяцВыплатыГодовойПремии = Перечисления.МесяцыГода.ПустаяСсылка()
							//		ИЛИ НастройкиДатаВыплатыБюджетирования.МесяцВыплатыГодовойПремии = Неопределено) Тогда
									И Не МесяцВыплатыГодовойПремии = Неопределено Тогда
					Если ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания.СтатусПозиции = Перечисления.СтатусыПозицииШтатногоРасписания.Вакансия Тогда				
				    	НовоеНачисление.Результат = 0;
				   	ИначеЕсли Формат(ВыборкаРезультатовНачислений.Период, "ДФ=""ММММ""") = Строка(НастройкиДатаВыплатыБюджетирования.МесяцВыплатыГодовойПремии) Тогда 
				        НовоеНачисление.Результат = ВыборкаРезультатовНачислений.СтавкаНачалаГода*ВыборкаРезультатовНачислений.ОкладНачалаГода
														* 12 
														* ВыборкаРезультатовНачислений.СтавкаГодовойПремии 
														* ВыборкаРезультатовНачислений.КоэффициентГодовойПремииТекущегоГода/100; 
					Иначе
						НовоеНачисление.Результат = 0;									
					КонецЕсли;
				ИначеЕсли НачалоГода(ВыборкаРезультатовНачислений.Период) > НачалоГода(ПериодРасчета.ДатаНачала) 
					И НастройкиДатаВыплатыБюджетирования.Свойство("МесяцВыплатыГодовойПремии", МесяцВыплатыГодовойПремии)
							//И (НастройкиДатаВыплатыБюджетирования.МесяцВыплатыГодовойПремии > Перечисления.МесяцыГода.Июль
							//		ИЛИ НастройкиДатаВыплатыБюджетирования.МесяцВыплатыГодовойПремии = Перечисления.МесяцыГода.Август
							//		ИЛИ НастройкиДатаВыплатыБюджетирования.МесяцВыплатыГодовойПремии = Перечисления.МесяцыГода.Сентябрь
							//		ИЛИ НастройкиДатаВыплатыБюджетирования.МесяцВыплатыГодовойПремии = Перечисления.МесяцыГода.ПустаяСсылка()
							//		ИЛИ НастройкиДатаВыплатыБюджетирования.МесяцВыплатыГодовойПремии = Неопределено) Тогда 
									И Не МесяцВыплатыГодовойПремии = Неопределено Тогда
				   	Если Формат(ВыборкаРезультатовНачислений.Период, "ДФ=""ММММ""") = Строка(НастройкиДатаВыплатыБюджетирования.МесяцВыплатыГодовойПремии) Тогда 
				        НовоеНачисление.Результат = ВыборкаРезультатовНачислений.СуммаОкладов12Месяцев
														* ВыборкаРезультатовНачислений.СтавкаГодовойПремии 
														* ВыборкаРезультатовНачислений.КоэффициентГодовойПремииТекущегоГода/100; 
					Иначе
						НовоеНачисление.Результат = 0;					
					КонецЕсли;	
				Иначе
					НовоеНачисление.Результат = 0;					
				КонецЕсли;
				Если ЗначениеЗаполнено(НовоеНачисление.ПозицияШтатногоРасписания) Тогда
					НовоеНачисление.Должность = НовоеНачисление.ПозицияШтатногоРасписания.Должность;	
				КонецЕсли;
				НовоеНачисление.Сумма = НовоеНачисление.Результат;
				
			#КонецОбласти
				
			КонецЦикла;
		КонецЕсли;
		
		#КонецОбласти
		
	КонецЦикла;	
		
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗакончитьЗамерВремени(ИмяЗамера, Замер);
	
КонецПроцедуры

Процедура РассчитатьНачисления()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяЗамера = "РасчетПоказателейБюджетовПрогнозов.РасчетНачислений";
	Замер = НачатьЗамерВремени();

	ПодготовитьТаблицуФизлицПоПериодам(); 
	
	Если Не ТипЗнч(ФизлицаПоПериодам) = Тип("ТаблицаЗначений") И Не ФизлицаПоПериодам.Количество() > 0 Тогда 
		ПодготовитьТаблицуФизлицПоПериодам();	
	КонецЕсли;
	
	Для Каждого МесяцЗначение Из МесяцыРасчета Цикл
	
		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТаблицаФизЛицПоПериодам.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ТаблицаФизЛицПоПериодам.Период КАК Период,
			|	ТаблицаФизЛицПоПериодам.Организация КАК Организация,
			|	ТаблицаФизЛицПоПериодам.Подразделение КАК Подразделение,
			|	ТаблицаФизЛицПоПериодам.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
			|	ТаблицаФизЛицПоПериодам.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
			|	ТаблицаФизЛицПоПериодам.КодГрейда КАК КодГрейда,
			|	ТаблицаФизЛицПоПериодам.НачалоПериода КАК НачалоПериода,
			|	ТаблицаФизЛицПоПериодам.ОкончаниеПериода КАК ОкончаниеПериода,
			|   ВЫБОР КОГДА &ДатаСреза >= ТаблицаФизЛицПоПериодам.НачалоПериода 
			|					И &ДатаСреза <= ТаблицаФизЛицПоПериодам.ОкончаниеПериода
			|			ТОГДА 1
			|			ИНАЧЕ 0
			|	КОНЕЦ КАК КоэффициентМесяца
			|ПОМЕСТИТЬ ВТТаблицаФизЛицПоПериодам
			|ИЗ
			|	&ТаблицаФизЛицПоПериодам КАК ТаблицаФизЛицПоПериодам
			|ГДЕ
			|	ТаблицаФизЛицПоПериодам.Период = &ДатаСреза";
		
		Запрос.УстановитьПараметр("ТаблицаФизЛицПоПериодам", ФизлицаПоПериодам);
		Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(МесяцЗначение));
		Запрос.Выполнить();
		
		УстановитьПривилегированныйРежим(Истина);

		ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	КадровыеДанныеТекущие.ФизическоеЛицо КАК ФизическоеЛицо,
			|	КадровыеДанныеТекущие.Период КАК Период,
			|	КадровыеДанныеТекущие.Организация КАК Организация,
			|	КадровыеДанныеТекущие.Подразделение КАК Подразделение, 
			|	КадровыеДанныеТекущие.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат, 
			|	КадровыеДанныеТекущие.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
			|	КадровыеДанныеТекущие.КодГрейда КАК КодГрейда,
			|	КадровыеДанныеТекущие.НачалоПериода КАК НачалоПериода,
			|	КадровыеДанныеТекущие.ОкончаниеПериода КАК ОкончаниеПериода,
			|	КадровыеДанныеТекущие.Ставка КАК Ставка,
			|	КадровыеДанныеТекущие.Оклад КАК Оклад,
			|	КадровыеДанныеТекущие.ДоплатаЗаФункционалОбразовательнойДеятельности КАК ДоплатаЗаФункционалОбразовательнойДеятельности,
			|	КадровыеДанныеТекущие.ДоплатаЗаПреподаваниеНаИнЯзыке КАК ДоплатаЗаПреподаваниеНаИнЯзыке,
			|	КадровыеДанныеТекущие.РезервНаСреднийЗаработок КАК РезервНаСреднийЗаработок,
			|	КадровыеДанныеТекущие.ДМС КАК ДМС,
			|	КадровыеДанныеТекущие.НСиБолезни КАК НСиБолезни
			|ПОМЕСТИТЬ ВТКадровыеДанныеТекущие
			|ИЗ
			|	(ВЫБРАТЬ
			|		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
			|		ВЫБОР
			|			КОГДА КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период < &ДатаСреза
			|				ТОГДА &ДатаСреза
			|			ИНАЧЕ КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период
			|		КОНЕЦ КАК Период,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Организация КАК Организация,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Подразделение КАК Подразделение, 
			|		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.КодГрейда КАК КодГрейда,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода КАК НачалоПериода,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода КАК ОкончаниеПериода,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Ставка КАК Ставка,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Оклад КАК Оклад,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ДоплатаЗаФункционалОбразовательнойДеятельности КАК ДоплатаЗаФункционалОбразовательнойДеятельности,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ДоплатаЗаПреподаваниеНаИнЯзыке КАК ДоплатаЗаПреподаваниеНаИнЯзыке,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.РезервНаСреднийЗаработок КАК РезервНаСреднийЗаработок,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ДМС КАК ДМС,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НСиБолезни КАК НСиБолезни
			|	ИЗ
			|		РегистрСведений.КадровыеСведенияСотрудниковОрганизаций.СрезПоследних(
			|					&ДатаСреза, 
			|					Организация = &Организация И Сценарий = &Сценарий
			|					%ДопУсловие%) КАК КадровыеСведенияСотрудниковОрганизацийСрезПоследних
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		КадровыеСведенияСотрудниковОрганизацийСрезПервых.ФизическоеЛицо,
			|		ВЫБОР
			|			КОГДА КадровыеСведенияСотрудниковОрганизацийСрезПервых.Период < &ДатаСреза
			|				ТОГДА &ДатаСреза
			|			ИНАЧЕ КадровыеСведенияСотрудниковОрганизацийСрезПервых.Период
			|		КОНЕЦ,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПервых.Организация,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПервых.Подразделение,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПервых.МестоВозникновенияЗатрат,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПервых.ПозицияШтатногоРасписания,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПервых.КодГрейда,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПервых.НачалоПериода,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПервых.ОкончаниеПериода,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПервых.Ставка,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПервых.Оклад,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПервых.ДоплатаЗаФункционалОбразовательнойДеятельности,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПервых.ДоплатаЗаПреподаваниеНаИнЯзыке,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПервых.РезервНаСреднийЗаработок,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПервых.ДМС,
			|		КадровыеСведенияСотрудниковОрганизацийСрезПервых.НСиБолезни
			|	ИЗ
			|		РегистрСведений.КадровыеСведенияСотрудниковОрганизаций.СрезПервых(
			|						&ДатаСреза, 
			|						Организация = &Организация И Сценарий = &Сценарий
			|						%ДопУсловие%) КАК КадровыеСведенияСотрудниковОрганизацийСрезПервых) КАК КадровыеДанныеТекущие";
		
		ДопУсловие = "";
		
		Если ОтборВЗапросахПоПодразделению И ЗначениеЗаполнено(Подразделение) Тогда
			
			ДопУсловие = ДопУсловие + "
									   |				И Подразделение = &Подразделение ";
			
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
		КонецЕсли;
		
		Если ОтборВЗапросахПоМестуВозникновенияЗатрат И ЗначениеЗаполнено(МестоВозникновенияЗатрат) Тогда
			
			ДопУсловие = ДопУсловие + "
									   |				И МестоВозникновенияЗатрат = &МестоВозникновенияЗатрат ";
			
			Запрос.УстановитьПараметр("МестоВозникновенияЗатрат", МестоВозникновенияЗатрат);
		КонецЕсли;	

		Если ОтборВЗапросахПоФизическимЛицам 
				И Не НастройкиРасчета.ФизическиеЛица = Неопределено 
				И ТипЗнч(НастройкиРасчета.ФизическиеЛица) = Тип("Массив")
				И НастройкиРасчета.ФизическиеЛица.Количество() > 0 Тогда
			
			ДопУсловие = ДопУсловие + "
									   |				И ФизическоеЛицо В (&ФизическиеЛица) ";
			
			Запрос.УстановитьПараметр("ФизическиеЛица", НастройкиРасчета.ФизическиеЛица);
		КонецЕсли;	
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ДопУсловие%", ДопУсловие);
		
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(МесяцЗначение));
		Запрос.УстановитьПараметр("Организация", Организация); 
		Запрос.УстановитьПараметр("Сценарий",    Сценарий);

		Запрос.Выполнить();
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
		               |	ВЫБОР
		               |		КОГДА ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1) < &ДатаСреза
		               |			ТОГДА &ДатаСреза
		               |		ИНАЧЕ ДОБАВИТЬКДАТЕ(КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Период, МЕСЯЦ, 1)
		               |	КОНЕЦ КАК Период,
		               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Организация КАК Организация,
		               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Подразделение КАК Подразделение,  
		               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
		               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
		               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.КодГрейда КАК КодГрейда,
		               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НачалоПериода КАК НачалоПериода,
		               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ОкончаниеПериода КАК ОкончаниеПериода,
		               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Ставка КАК Ставка,
		               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.Оклад КАК Оклад,
		               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ДоплатаЗаФункционалОбразовательнойДеятельности КАК ДоплатаЗаФункционалОбразовательнойДеятельности,
		               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ДоплатаЗаПреподаваниеНаИнЯзыке КАК ДоплатаЗаПреподаваниеНаИнЯзыке,
		               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.РезервНаСреднийЗаработок КАК РезервНаСреднийЗаработок,
		               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.ДМС КАК ДМС,
		               |	КадровыеСведенияСотрудниковОрганизацийСрезПоследних.НСиБолезни КАК НСиБолезни
		               |ПОМЕСТИТЬ ВТКадровыеДанныеПредыдущие
		               |ИЗ
		               |	РегистрСведений.КадровыеСведенияСотрудниковОрганизаций.СрезПоследних(
					   |						ДОБАВИТЬКДАТЕ(&ДатаСреза, МЕСЯЦ, -1), 
					   |						Организация = &Организация И Сценарий = &Сценарий
					   |						%ДопУсловие%) КАК КадровыеСведенияСотрудниковОрганизацийСрезПоследних";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ДопУсловие%", ДопУсловие);
		
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(МесяцЗначение));
		Запрос.УстановитьПараметр("Организация", Организация); 
		Запрос.УстановитьПараметр("Сценарий",    Сценарий);
		Запрос.Выполнить();

		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ВТТаблицаФизЛицПоПериодам.ФизическоеЛицо КАК ФизическоеЛицо,
		               |	ВТТаблицаФизЛицПоПериодам.Период КАК Период,
		               |	ВТТаблицаФизЛицПоПериодам.Организация КАК Организация,
		               |	ВТТаблицаФизЛицПоПериодам.Подразделение КАК Подразделение,
		               |	ВТТаблицаФизЛицПоПериодам.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
		               |	ВТТаблицаФизЛицПоПериодам.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
		               |	ВТТаблицаФизЛицПоПериодам.КодГрейда КАК КодГрейда,
		               |	ВТТаблицаФизЛицПоПериодам.НачалоПериода КАК НачалоПериода,
		               |	ВТТаблицаФизЛицПоПериодам.ОкончаниеПериода КАК ОкончаниеПериода,
					   |	ВТТаблицаФизЛицПоПериодам.КоэффициентМесяца КАК КоэффициентМесяца,
		               |	ВТКадровыеДанныеТекущие.Ставка КАК ТекущаяСтавка,
		               |	ВТКадровыеДанныеПредыдущие.Ставка КАК ПредыдущаяСтавка,
		               |	ВЫБОР
		               |		КОГДА ВТКадровыеДанныеТекущие.Ставка ЕСТЬ NULL
		               |				ИЛИ ВТКадровыеДанныеТекущие.Ставка = 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКадровыеДанныеТекущие.Оклад * ВТТаблицаФизЛицПоПериодам.КоэффициентМесяца
		               |	КОНЕЦ КАК Оклад,
		               |	ВЫБОР
		               |		КОГДА ВТКадровыеДанныеТекущие.Ставка ЕСТЬ NULL
		               |				ИЛИ ВТКадровыеДанныеТекущие.Ставка = 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКадровыеДанныеТекущие.ДоплатаЗаФункционалОбразовательнойДеятельности * ВТТаблицаФизЛицПоПериодам.КоэффициентМесяца
		               |	КОНЕЦ КАК ДоплатаЗаФункционалОбразовательнойДеятельности,
		               |	ВЫБОР
		               |		КОГДА ВТКадровыеДанныеТекущие.Ставка ЕСТЬ NULL
		               |				ИЛИ ВТКадровыеДанныеТекущие.Ставка = 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКадровыеДанныеТекущие.ДоплатаЗаПреподаваниеНаИнЯзыке * ВТТаблицаФизЛицПоПериодам.КоэффициентМесяца
		               |	КОНЕЦ КАК ДоплатаЗаПреподаваниеНаИнЯзыке,
		               |	ВЫБОР
		               |		КОГДА ВТКадровыеДанныеТекущие.Ставка ЕСТЬ NULL
		               |				ИЛИ ВТКадровыеДанныеТекущие.Ставка = 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКадровыеДанныеТекущие.РезервНаСреднийЗаработок * ВТТаблицаФизЛицПоПериодам.КоэффициентМесяца
		               |	КОНЕЦ КАК РезервНаСреднийЗаработок,
		               |	ВЫБОР
		               |		КОГДА ВТКадровыеДанныеТекущие.Ставка ЕСТЬ NULL
		               |				ИЛИ ВТКадровыеДанныеТекущие.Ставка = 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКадровыеДанныеТекущие.ДМС * ВТТаблицаФизЛицПоПериодам.КоэффициентМесяца / 12
		               |	КОНЕЦ КАК ДМС,
		               |	ВЫБОР
		               |		КОГДА ВТКадровыеДанныеТекущие.Ставка ЕСТЬ NULL
		               |				ИЛИ ВТКадровыеДанныеТекущие.Ставка = 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ВТКадровыеДанныеТекущие.НСиБолезни * ВТТаблицаФизЛицПоПериодам.КоэффициентМесяца
		               |	КОНЕЦ КАК НСиБолезни
		               |ИЗ
		               |	ВТТаблицаФизЛицПоПериодам КАК ВТТаблицаФизЛицПоПериодам
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеТекущие КАК ВТКадровыеДанныеТекущие
		               |		ПО ВТТаблицаФизЛицПоПериодам.ФизическоеЛицо = ВТКадровыеДанныеТекущие.ФизическоеЛицо
		               |			И ВТТаблицаФизЛицПоПериодам.Период = ВТКадровыеДанныеТекущие.Период
		               |			И ВТТаблицаФизЛицПоПериодам.Организация = ВТКадровыеДанныеТекущие.Организация
		               |			И ВТТаблицаФизЛицПоПериодам.Подразделение = ВТКадровыеДанныеТекущие.Подразделение
		               |			И ВТТаблицаФизЛицПоПериодам.МестоВозникновенияЗатрат = ВТКадровыеДанныеТекущие.МестоВозникновенияЗатрат
		               |			И ВТТаблицаФизЛицПоПериодам.ПозицияШтатногоРасписания = ВТКадровыеДанныеТекущие.ПозицияШтатногоРасписания
		               |			И ВТТаблицаФизЛицПоПериодам.КодГрейда = ВТКадровыеДанныеТекущие.КодГрейда
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеПредыдущие КАК ВТКадровыеДанныеПредыдущие
		               |		ПО ВТТаблицаФизЛицПоПериодам.ФизическоеЛицо = ВТКадровыеДанныеПредыдущие.ФизическоеЛицо
		               |			И ВТТаблицаФизЛицПоПериодам.Период = ВТКадровыеДанныеПредыдущие.Период
		               |			И ВТТаблицаФизЛицПоПериодам.Организация = ВТКадровыеДанныеПредыдущие.Организация
		               |			И ВТТаблицаФизЛицПоПериодам.Подразделение = ВТКадровыеДанныеПредыдущие.Подразделение
		               |			И ВТТаблицаФизЛицПоПериодам.МестоВозникновенияЗатрат = ВТКадровыеДанныеПредыдущие.МестоВозникновенияЗатрат
		               |			И ВТТаблицаФизЛицПоПериодам.ПозицияШтатногоРасписания = ВТКадровыеДанныеПредыдущие.ПозицияШтатногоРасписания
		               |			И ВТТаблицаФизЛицПоПериодам.КодГрейда = ВТКадровыеДанныеПредыдущие.КодГрейда";
		
		
		#Область ЗаполнениеТаблицДляПередачиДокументуРасчета
		
		РезультатНачислений = Запрос.Выполнить(); 
		
		УдаляемыеВТТаблицы = Новый Массив;
		УдаляемыеВТТаблицы.Добавить("ВТТаблицаФизЛицПоПериодам"); 
		УдаляемыеВТТаблицы.Добавить("ВТКадровыеДанныеТекущие");
		УдаляемыеВТТаблицы.Добавить("ВТКадровыеДанныеПредыдущие");
		
		Бюджетирование.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдаляемыеВТТаблицы);
		
		Если Не РезультатНачислений.Пустой() Тогда 
			
			ВыборкаРезультатовНачислений = РезультатНачислений.Выбрать();
			Пока ВыборкаРезультатовНачислений.Следующий() Цикл
				ФизическоеЛицо = ВыборкаРезультатовНачислений.ФизическоеЛицо;
				//1. Оклад
				Если Не ВыборкаРезультатовНачислений.Оклад = Неопределено Тогда 
					НовоеНачисление = РасчитанныеПоказатели.Начисления.Добавить();
					НовоеНачисление.ФизическоеЛицо 				= ФизическоеЛицо;
					НовоеНачисление.МесяцНачисления 			= ВыборкаРезультатовНачислений.Период;  
					НовоеНачисление.ПериодДействия	 			= ВыборкаРезультатовНачислений.НачалоПериода; 
					НовоеНачисление.ПериодРегистрации 			= ВыборкаРезультатовНачислений.НачалоПериода;
		            НовоеНачисление.Организация 				= ВыборкаРезультатовНачислений.Организация;
		            НовоеНачисление.Подразделение 				= ВыборкаРезультатовНачислений.Подразделение;
		            НовоеНачисление.МестоВозникновенияЗатрат	= ВыборкаРезультатовНачислений.МестоВозникновенияЗатрат;
					Если ЗначениеЗаполнено(ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания) Тогда
						НовоеНачисление.Должность 				= ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания.Должность;
					КонецЕсли;	
		            НовоеНачисление.ПозицияШтатногоРасписания 	= ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания;
		            НовоеНачисление.КодГрейда 					= ВыборкаРезультатовНачислений.КодГрейда;
		            НовоеНачисление.ДатаНачала 					= ВыборкаРезультатовНачислений.НачалоПериода;
		            НовоеНачисление.ДатаОкончания 				= ВыборкаРезультатовНачислений.ОкончаниеПериода;
					НовоеНачисление.ВидНачисления 				= ПредопределенноеЗначение("Справочник.ВидыНачислений.Оклад");
					НовоеНачисление.Сумма 						= ВыборкаРезультатовНачислений.Оклад;
					НовоеНачисление.Результат 					= ВыборкаРезультатовНачислений.Оклад;
				КонецЕсли;	
				//2. ДоплатаЗаФункционалОбразовательнойДеятельности
				Если Не ВыборкаРезультатовНачислений.ДоплатаЗаФункционалОбразовательнойДеятельности = Неопределено Тогда 
					НовоеНачисление = РасчитанныеПоказатели.Начисления.Добавить();
					НовоеНачисление.ФизическоеЛицо = ФизическоеЛицо;
					НовоеНачисление.МесяцНачисления 			= ВыборкаРезультатовНачислений.Период;  
					НовоеНачисление.ПериодДействия	 			= ВыборкаРезультатовНачислений.НачалоПериода; 
					НовоеНачисление.ПериодРегистрации 			= ВыборкаРезультатовНачислений.НачалоПериода;
		            НовоеНачисление.Организация 				= ВыборкаРезультатовНачислений.Организация;
		            НовоеНачисление.Подразделение 				= ВыборкаРезультатовНачислений.Подразделение;
		            НовоеНачисление.МестоВозникновенияЗатрат	= ВыборкаРезультатовНачислений.МестоВозникновенияЗатрат;
					Если ЗначениеЗаполнено(ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания) Тогда
						НовоеНачисление.Должность 				= ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания.Должность;
					КонецЕсли;	
		            НовоеНачисление.ПозицияШтатногоРасписания 	= ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания;
		            НовоеНачисление.КодГрейда 					= ВыборкаРезультатовНачислений.КодГрейда;
		            НовоеНачисление.ДатаНачала 					= ВыборкаРезультатовНачислений.НачалоПериода;
		            НовоеНачисление.ДатаОкончания 				= ВыборкаРезультатовНачислений.ОкончаниеПериода;
					НовоеНачисление.ВидНачисления 				= ПредопределенноеЗначение("Справочник.ВидыНачислений.ДоплатаЗаФункционалОбразовательнойДеятельности");
					НовоеНачисление.Сумма 						= ВыборкаРезультатовНачислений.ДоплатаЗаФункционалОбразовательнойДеятельности;
					НовоеНачисление.Результат 					= ВыборкаРезультатовНачислений.ДоплатаЗаФункционалОбразовательнойДеятельности;
				КонецЕсли;	
				//3. ДоплатаЗаПреподаваниеНаИнЯзыке
				Если Не ВыборкаРезультатовНачислений.ДоплатаЗаПреподаваниеНаИнЯзыке = Неопределено Тогда 
					НовоеНачисление = РасчитанныеПоказатели.Начисления.Добавить();
					НовоеНачисление.ФизическоеЛицо = ФизическоеЛицо;
					НовоеНачисление.МесяцНачисления 			= ВыборкаРезультатовНачислений.Период;  
					НовоеНачисление.ПериодДействия	 			= ВыборкаРезультатовНачислений.НачалоПериода; 
					НовоеНачисление.ПериодРегистрации 			= ВыборкаРезультатовНачислений.НачалоПериода;
		            НовоеНачисление.Организация 				= ВыборкаРезультатовНачислений.Организация;
		            НовоеНачисление.Подразделение 				= ВыборкаРезультатовНачислений.Подразделение;
		            НовоеНачисление.МестоВозникновенияЗатрат	= ВыборкаРезультатовНачислений.МестоВозникновенияЗатрат;
					Если ЗначениеЗаполнено(ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания) Тогда
						НовоеНачисление.Должность 				= ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания.Должность;
					КонецЕсли;	
		            НовоеНачисление.ПозицияШтатногоРасписания 	= ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания;
		            НовоеНачисление.КодГрейда 					= ВыборкаРезультатовНачислений.КодГрейда;
		            НовоеНачисление.ДатаНачала 					= ВыборкаРезультатовНачислений.НачалоПериода;
		            НовоеНачисление.ДатаОкончания 				= ВыборкаРезультатовНачислений.ОкончаниеПериода;
					НовоеНачисление.ВидНачисления 				= ПредопределенноеЗначение("Справочник.ВидыНачислений.ДоплатаЗаПреподаваниеНаИнЯзыке");  
					НовоеНачисление.Сумма 						= ВыборкаРезультатовНачислений.ДоплатаЗаПреподаваниеНаИнЯзыке;
					НовоеНачисление.Результат 					= ВыборкаРезультатовНачислений.ДоплатаЗаПреподаваниеНаИнЯзыке;
				КонецЕсли;	
				//4. РезервНаСреднийЗаработок
				Если Не ВыборкаРезультатовНачислений.РезервНаСреднийЗаработок = Неопределено Тогда 
					НовоеНачисление = РасчитанныеПоказатели.Начисления.Добавить();
					НовоеНачисление.ФизическоеЛицо = ФизическоеЛицо;
					НовоеНачисление.МесяцНачисления 			= ВыборкаРезультатовНачислений.Период;  
					НовоеНачисление.ПериодДействия	 			= ВыборкаРезультатовНачислений.НачалоПериода; 
					НовоеНачисление.ПериодРегистрации 			= ВыборкаРезультатовНачислений.НачалоПериода;
		            НовоеНачисление.Организация 				= ВыборкаРезультатовНачислений.Организация;
		            НовоеНачисление.Подразделение 				= ВыборкаРезультатовНачислений.Подразделение; 
		            НовоеНачисление.МестоВозникновенияЗатрат	= ВыборкаРезультатовНачислений.МестоВозникновенияЗатрат;
					Если ЗначениеЗаполнено(ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания) Тогда
						НовоеНачисление.Должность 				= ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания.Должность;
					КонецЕсли;	
		            НовоеНачисление.ПозицияШтатногоРасписания 	= ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания;
		            НовоеНачисление.КодГрейда 					= ВыборкаРезультатовНачислений.КодГрейда;
		            НовоеНачисление.ДатаНачала 					= ВыборкаРезультатовНачислений.НачалоПериода;
		            НовоеНачисление.ДатаОкончания 				= ВыборкаРезультатовНачислений.ОкончаниеПериода;
					НовоеНачисление.ВидНачисления 				= ПредопределенноеЗначение("Справочник.ВидыНачислений.РезервНаСреднийЗаработок");
					НовоеНачисление.Сумма 						= ВыборкаРезультатовНачислений.РезервНаСреднийЗаработок;
					НовоеНачисление.Результат 					= ВыборкаРезультатовНачислений.РезервНаСреднийЗаработок;
				КонецЕсли;	
				//5. ДМС
				Если Не ВыборкаРезультатовНачислений.ДМС = Неопределено Тогда 
					НовоеНачисление = РасчитанныеПоказатели.Начисления.Добавить();
					НовоеНачисление.ФизическоеЛицо = ФизическоеЛицо;
					НовоеНачисление.МесяцНачисления 			= ВыборкаРезультатовНачислений.Период;  
					НовоеНачисление.ПериодДействия	 			= ВыборкаРезультатовНачислений.НачалоПериода; 
					НовоеНачисление.ПериодРегистрации 			= ВыборкаРезультатовНачислений.НачалоПериода;
		            НовоеНачисление.Организация 				= ВыборкаРезультатовНачислений.Организация;
		            НовоеНачисление.Подразделение 				= ВыборкаРезультатовНачислений.Подразделение;
		            НовоеНачисление.МестоВозникновенияЗатрат	= ВыборкаРезультатовНачислений.МестоВозникновенияЗатрат;
					Если ЗначениеЗаполнено(ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания) Тогда
						НовоеНачисление.Должность 				= ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания.Должность;
					КонецЕсли;	
		            НовоеНачисление.ПозицияШтатногоРасписания 	= ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания;
		            НовоеНачисление.КодГрейда 					= ВыборкаРезультатовНачислений.КодГрейда;
		            НовоеНачисление.ДатаНачала 					= ВыборкаРезультатовНачислений.НачалоПериода;
		            НовоеНачисление.ДатаОкончания 				= ВыборкаРезультатовНачислений.ОкончаниеПериода;
					НовоеНачисление.ВидНачисления 				= ПредопределенноеЗначение("Справочник.ВидыНачислений.ДМС");  
					НовоеНачисление.Сумма 						= ВыборкаРезультатовНачислений.ДМС;
					НовоеНачисление.Результат 					= ВыборкаРезультатовНачислений.ДМС;
				КонецЕсли;	
				//6. НСиБолезни
				Если Не ВыборкаРезультатовНачислений.НСиБолезни = Неопределено Тогда 
					НовоеНачисление = РасчитанныеПоказатели.Начисления.Добавить();
					НовоеНачисление.ФизическоеЛицо = ФизическоеЛицо;
					НовоеНачисление.МесяцНачисления 			= ВыборкаРезультатовНачислений.Период;  
					НовоеНачисление.ПериодДействия	 			= ВыборкаРезультатовНачислений.НачалоПериода; 
					НовоеНачисление.ПериодРегистрации 			= ВыборкаРезультатовНачислений.НачалоПериода;
		            НовоеНачисление.Организация 				= ВыборкаРезультатовНачислений.Организация;
		            НовоеНачисление.Подразделение 				= ВыборкаРезультатовНачислений.Подразделение; 
		            НовоеНачисление.МестоВозникновенияЗатрат	= ВыборкаРезультатовНачислений.МестоВозникновенияЗатрат;
					Если ЗначениеЗаполнено(ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания) Тогда
						НовоеНачисление.Должность 				= ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания.Должность;
					КонецЕсли;	
		            НовоеНачисление.ПозицияШтатногоРасписания 	= ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания;
		            НовоеНачисление.КодГрейда 					= ВыборкаРезультатовНачислений.КодГрейда;
		            НовоеНачисление.ДатаНачала 					= ВыборкаРезультатовНачислений.НачалоПериода;
		            НовоеНачисление.ДатаОкончания 				= ВыборкаРезультатовНачислений.ОкончаниеПериода;
					НовоеНачисление.ВидНачисления 				= ПредопределенноеЗначение("Справочник.ВидыНачислений.НСиБолезни");
					НовоеНачисление.Сумма 						= ВыборкаРезультатовНачислений.НСиБолезни;
					НовоеНачисление.Результат 					= ВыборкаРезультатовНачислений.НСиБолезни;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
		
		#КонецОбласти
		
	КонецЦикла;	
		
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗакончитьЗамерВремени(ИмяЗамера, Замер);
	
КонецПроцедуры

Процедура РассчитатьНачисленияСтраховыхВзносовРезерва()

	УстановитьПривилегированныйРежим(Истина);
	
	ИмяЗамера = "РасчетПоказателейБюджетовПрогнозов.РасчетНачисленийРезерва";
	Замер = НачатьЗамерВремени();

	ПодготовитьТаблицуИсточникаРасчетовПоПериодам(); 
	
	Если Не ТипЗнч(ИсточникРасчета) = Тип("ТаблицаЗначений") И Не ИсточникРасчета.Количество() > 0 Тогда 
		Возврат;	//Не переданы данные ТЧ "Начисления" документа "Расчет резерва"
	КонецЕсли;
	
	Для Каждого МесяцЗначение Из МесяцыРасчета Цикл 

		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.Текст =	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		              	|	ТаблицаБазовыхНачислений.МесяцНачисления КАК Период,
		              	|	ТаблицаБазовыхНачислений.Организация КАК Организация,
		              	|	ТаблицаБазовыхНачислений.Подразделение КАК Подразделение,
		              	|	ТаблицаБазовыхНачислений.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
		              	|	ТаблицаБазовыхНачислений.ВидНачисления КАК ВидНачисления,
		              	|	ТаблицаБазовыхНачислений.СпособОтраженияРезультата КАК СпособОтраженияРезультата,
		              	|	ТаблицаБазовыхНачислений.ДатаНачала КАК ДатаНачала,
		              	|	ТаблицаБазовыхНачислений.ДатаОкончания КАК ДатаОкончания,
		              	|	ТаблицаБазовыхНачислений.Результат КАК БазоваяСуммаНачисления
		              	|ПОМЕСТИТЬ ВТТаблицаБазовыхНачислений
		              	|ИЗ
		              	|	&ТаблицаБазовыхНачислений КАК ТаблицаБазовыхНачислений
		              	|ГДЕ
		              	|	ТаблицаБазовыхНачислений.МесяцНачисления = &ДатаСреза";
		
		Запрос.УстановитьПараметр("ТаблицаБазовыхНачислений", ИсточникРасчета);
		Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(МесяцЗначение));
		Запрос.Выполнить();
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СтавкиНалогов.Период КАК Период,
		               |	МАКСИМУМ(СтавкиНалогов.СтавкаНалогаПрочееПФР) КАК СтавкаНалогаПрочееПФР,
		               |	МАКСИМУМ(СтавкиНалогов.СтавкаНалогаКорректировкаПФР) КАК СтавкаНалогаКорректировкаПФР,
		               |	МАКСИМУМ(СтавкиНалогов.СтавкаНалогаПрочееФСС) КАК СтавкаНалогаПрочееФСС,
		               |	МАКСИМУМ(СтавкиНалогов.СтавкаНалогаКорректировкаФСС) КАК СтавкаНалогаКорректировкаФСС,
		               |	МАКСИМУМ(СтавкиНалогов.СтавкаНалогаПрочееФФОМС) КАК СтавкаНалогаПрочееФФОМС,
		               |	МАКСИМУМ(СтавкиНалогов.СтавкаНалогаКорректировкаФФОМС) КАК СтавкаНалогаКорректировкаФФОМС
		               |ПОМЕСТИТЬ ВТСтавкиНалогов
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		&ДатаСреза КАК Период,
		               |		ВЫБОР
		               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ПФР)
		               |				ТОГДА СтавкиНалоговСрезПоследних.СтавкаНалогаПрочее
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК СтавкаНалогаПрочееПФР,
		               |		ВЫБОР
		               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ПФР)
		               |				ТОГДА СтавкиНалоговСрезПоследних.СтавкаНалогаКорректировка
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК СтавкаНалогаКорректировкаПФР,
		               |		ВЫБОР
		               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ФСС)
		               |				ТОГДА СтавкиНалоговСрезПоследних.СтавкаНалогаПрочее
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК СтавкаНалогаПрочееФСС,
		               |		ВЫБОР
		               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ФСС)
		               |				ТОГДА СтавкиНалоговСрезПоследних.СтавкаНалогаКорректировка
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК СтавкаНалогаКорректировкаФСС,
		               |		ВЫБОР
		               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ФФОМС)
		               |				ТОГДА СтавкиНалоговСрезПоследних.СтавкаНалогаПрочее
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК СтавкаНалогаПрочееФФОМС,
		               |		ВЫБОР
		               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ФФОМС)
		               |				ТОГДА СтавкиНалоговСрезПоследних.СтавкаНалогаКорректировка
		               |			ИНАЧЕ 0
		               |		КОНЕЦ КАК СтавкаНалогаКорректировкаФФОМС
		               |	ИЗ
		               |		РегистрСведений.СтавкиНалогов.СрезПоследних(&ДатаСреза, Сценарий = &Сценарий) КАК СтавкиНалоговСрезПоследних
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		&ДатаСреза,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0,
		               |		0
		               |	ИЗ
		               |		Справочник.Сценарии КАК Сценарий
		               |	ГДЕ
		               |		Сценарий.Ссылка = &Сценарий) КАК СтавкиНалогов
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	СтавкиНалогов.Период";
			
			Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(МесяцЗначение));
			Запрос.УстановитьПараметр("Сценарий",  Сценарий);
			Запрос.Выполнить();
			
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	ДанныеПоНачислениям.Период КАК Период,
			               |	ДанныеПоНачислениям.Период КАК МесяцНачисления,
			               |	ДанныеПоНачислениям.Период КАК ПериодРегистрации,
			               |	ДанныеПоНачислениям.ДатаНачала КАК ДатаНачала,
			               |	ДанныеПоНачислениям.ДатаОкончания КАК ДатаОкончания,
			               |	ДанныеПоНачислениям.Организация КАК Организация,
			               |	ДанныеПоНачислениям.Подразделение КАК Подразделение,
			               |	ДанныеПоНачислениям.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
			               |	ДанныеПоНачислениям.ВидНачисления КАК ВидНачисления,
			               |	ДанныеПоНачислениям.СпособОтраженияРезультата КАК СпособОтраженияРезультата,
			               |	ДанныеПоНачислениям.БазоваяСуммаНачисления КАК БазоваяСуммаНачисления,
			               |	ВЫБОР
			               |		КОГДА ДанныеПоНачислениям.СпособОтраженияРезультата = ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияРезультатов.РасчетПоФормулеКорректировка)
			               |			ТОГДА ДанныеПоНачислениям.БазоваяСуммаНачисления * ВТСтавкиНалогов.СтавкаНалогаКорректировкаПФР / 100
			               |		ИНАЧЕ 0
			               |	КОНЕЦ КАК СуммаСтраховойВзносПФРКорректировка,
			               |	ВЫБОР
			               |		КОГДА ДанныеПоНачислениям.СпособОтраженияРезультата = ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияРезультатов.РасчетПоФормулеКорректировка)
			               |			ТОГДА ДанныеПоНачислениям.БазоваяСуммаНачисления * ВТСтавкиНалогов.СтавкаНалогаКорректировкаФСС / 100
			               |		ИНАЧЕ 0
			               |	КОНЕЦ КАК СуммаСтраховойВзносФССКорректировка,
			               |	ВЫБОР
			               |		КОГДА ДанныеПоНачислениям.СпособОтраженияРезультата = ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияРезультатов.РасчетПоФормулеКорректировка)
			               |			ТОГДА ДанныеПоНачислениям.БазоваяСуммаНачисления * ВТСтавкиНалогов.СтавкаНалогаКорректировкаФФОМС / 100
			               |		ИНАЧЕ 0
			               |	КОНЕЦ КАК СуммаСтраховойВзносФФОМСКорректировка,
			               |	ВЫБОР
			               |		КОГДА ДанныеПоНачислениям.СпособОтраженияРезультата = ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияРезультатов.РасчетПоФормулеПрочее)
			               |			ТОГДА ДанныеПоНачислениям.БазоваяСуммаНачисления * ВТСтавкиНалогов.СтавкаНалогаПрочееПФР / 100
			               |		ИНАЧЕ 0
			               |	КОНЕЦ КАК СуммаСтраховойВзносПФРПрочее,
			               |	ВЫБОР
			               |		КОГДА ДанныеПоНачислениям.СпособОтраженияРезультата = ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияРезультатов.РасчетПоФормулеПрочее)
			               |			ТОГДА ДанныеПоНачислениям.БазоваяСуммаНачисления * ВТСтавкиНалогов.СтавкаНалогаПрочееФСС / 100
			               |		ИНАЧЕ 0
			               |	КОНЕЦ КАК СуммаСтраховойВзносФССПрочее,
			               |	ВЫБОР
			               |		КОГДА ДанныеПоНачислениям.СпособОтраженияРезультата = ЗНАЧЕНИЕ(Перечисление.СпособыОтраженияРезультатов.РасчетПоФормулеПрочее)
			               |			ТОГДА ДанныеПоНачислениям.БазоваяСуммаНачисления * ВТСтавкиНалогов.СтавкаНалогаПрочееФФОМС / 100
			               |		ИНАЧЕ 0
			               |	КОНЕЦ КАК СуммаСтраховойВзносФФОМСПрочее
			               |ПОМЕСТИТЬ ВТИтоги
			               |ИЗ
			               |	ВТТаблицаБазовыхНачислений КАК ДанныеПоНачислениям
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиНалогов КАК ВТСтавкиНалогов
			               |		ПО ДанныеПоНачислениям.Период = ВТСтавкиНалогов.Период
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТИтоги.Период КАК Период,
			               |	ВТИтоги.МесяцНачисления КАК МесяцНачисления,
			               |	ВТИтоги.ПериодРегистрации КАК ПериодРегистрации,
			               |	ВТИтоги.ДатаНачала КАК ДатаНачала,
			               |	ВТИтоги.ДатаОкончания КАК ДатаОкончания,
			               |	ВТИтоги.Организация КАК Организация,
			               |	ВТИтоги.Подразделение КАК Подразделение,
			               |	ВТИтоги.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
			               |	ВТИтоги.ВидНачисления КАК ВидНачисления,
			               |	ВТИтоги.СпособОтраженияРезультата КАК СпособОтраженияРезультата,
			               |	СУММА(ВТИтоги.БазоваяСуммаНачисления) КАК БазоваяСуммаНачисления,
			               |	СУММА(ВТИтоги.СуммаСтраховойВзносПФРКорректировка) КАК СуммаСтраховойВзносПФРКорректировка,
			               |	СУММА(ВТИтоги.СуммаСтраховойВзносФССКорректировка) КАК СуммаСтраховойВзносФССКорректировка,
			               |	СУММА(ВТИтоги.СуммаСтраховойВзносФФОМСКорректировка) КАК СуммаСтраховойВзносФФОМСКорректировка,
			               |	СУММА(ВТИтоги.СуммаСтраховойВзносПФРПрочее) КАК СуммаСтраховойВзносПФРПрочее,
			               |	СУММА(ВТИтоги.СуммаСтраховойВзносФССПрочее) КАК СуммаСтраховойВзносФССПрочее,
			               |	СУММА(ВТИтоги.СуммаСтраховойВзносФФОМСПрочее) КАК СуммаСтраховойВзносФФОМСПрочее
			               |ИЗ
			               |	ВТИтоги КАК ВТИтоги
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ВТИтоги.Период,
			               |	ВТИтоги.МесяцНачисления,
			               |	ВТИтоги.ПериодРегистрации,
			               |	ВТИтоги.ДатаНачала,
			               |	ВТИтоги.ДатаОкончания,
			               |	ВТИтоги.Организация,
			               |	ВТИтоги.Подразделение,
			               |	ВТИтоги.МестоВозникновенияЗатрат,
			               |	ВТИтоги.ВидНачисления,
			               |	ВТИтоги.СпособОтраженияРезультата
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |УНИЧТОЖИТЬ ВТСтавкиНалогов";
			
			РезультатНачислений = Запрос.Выполнить();
			
			Если Не РезультатНачислений.Пустой() Тогда 
				
				ВыборкаРезультатовНачислений = РезультатНачислений.Выбрать();
				Пока ВыборкаРезультатовНачислений.Следующий() Цикл
					
					//1. Страховые взносы ПФР (корр)
					Если ВыборкаРезультатовНачислений.СуммаСтраховойВзносПФРКорректировка <> 0 Тогда 
						НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
						НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ПФР");
						НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВПФР");
						НоваяСтрокаВзносов.СпособОтраженияРезультата = ПредопределенноеЗначение("Перечисление.СпособыОтраженияРезультатов.РасчетПоФормулеКорректировка");
						НоваяСтрокаВзносов.Результат = ВыборкаРезультатовНачислений.СуммаСтраховойВзносПФРКорректировка;
						НоваяСтрокаВзносов.Сумма = ВыборкаРезультатовНачислений.СуммаСтраховойВзносПФРКорректировка;
					КонецЕсли;	
					//2. Страховые взносы ПФР (проч)
					Если ВыборкаРезультатовНачислений.СуммаСтраховойВзносПФРПрочее <> 0 Тогда 
						НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
						НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ПФР");
						НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВПФР");
						НоваяСтрокаВзносов.СпособОтраженияРезультата = ПредопределенноеЗначение("Перечисление.СпособыОтраженияРезультатов.РасчетПоФормулеПрочее");
						НоваяСтрокаВзносов.Результат = ВыборкаРезультатовНачислений.СуммаСтраховойВзносПФРПрочее;
						НоваяСтрокаВзносов.Сумма = ВыборкаРезультатовНачислений.СуммаСтраховойВзносПФРПрочее;
					КонецЕсли;	
					
					//3. Страховые взносы ФСС (корр)
					Если ВыборкаРезультатовНачислений.СуммаСтраховойВзносФССКорректировка <> 0 Тогда 
						НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
						НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФСС");
						НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВФСС");
						НоваяСтрокаВзносов.СпособОтраженияРезультата = ПредопределенноеЗначение("Перечисление.СпособыОтраженияРезультатов.РасчетПоФормулеКорректировка");
						НоваяСтрокаВзносов.Результат = ВыборкаРезультатовНачислений.СуммаСтраховойВзносФССКорректировка;
						НоваяСтрокаВзносов.Сумма = ВыборкаРезультатовНачислений.СуммаСтраховойВзносФССКорректировка;
					КонецЕсли;	
					//4. Страховые взносы ФСС (проч)
					Если ВыборкаРезультатовНачислений.СуммаСтраховойВзносФССПрочее <> 0 Тогда 
						НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
						НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФСС");
						НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВФСС");
						НоваяСтрокаВзносов.СпособОтраженияРезультата = ПредопределенноеЗначение("Перечисление.СпособыОтраженияРезультатов.РасчетПоФормулеПрочее");
						НоваяСтрокаВзносов.Результат = ВыборкаРезультатовНачислений.СуммаСтраховойВзносФССПрочее;
						НоваяСтрокаВзносов.Сумма = ВыборкаРезультатовНачислений.СуммаСтраховойВзносФССПрочее;
					КонецЕсли;	
					
					//3. Страховые взносы ФФОМС (корр)
					Если ВыборкаРезультатовНачислений.СуммаСтраховойВзносФФОМСКорректировка <> 0 Тогда 
						НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
						НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФФОМС");
						НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВФФОМС");
						НоваяСтрокаВзносов.СпособОтраженияРезультата = ПредопределенноеЗначение("Перечисление.СпособыОтраженияРезультатов.РасчетПоФормулеКорректировка");
						НоваяСтрокаВзносов.Результат = ВыборкаРезультатовНачислений.СуммаСтраховойВзносФФОМСКорректировка;
						НоваяСтрокаВзносов.Сумма = ВыборкаРезультатовНачислений.СуммаСтраховойВзносФФОМСКорректировка;
					КонецЕсли;	
					//4. Страховые взносы ФФОМС (проч)
					Если ВыборкаРезультатовНачислений.СуммаСтраховойВзносФФОМСПрочее <> 0 Тогда 
						НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
						НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФФОМС");
						НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВФФОМС");
						НоваяСтрокаВзносов.СпособОтраженияРезультата = ПредопределенноеЗначение("Перечисление.СпособыОтраженияРезультатов.РасчетПоФормулеПрочее");
						НоваяСтрокаВзносов.Результат = ВыборкаРезультатовНачислений.СуммаСтраховойВзносФФОМСПрочее;
						НоваяСтрокаВзносов.Сумма = ВыборкаРезультатовНачислений.СуммаСтраховойВзносФФОМСПрочее;
					КонецЕсли;	
					
				КонецЦикла;	
			КонецЕсли;		
		
	КонецЦикла;	 
		
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗакончитьЗамерВремени(ИмяЗамера, Замер);
	
КонецПроцедуры

Функция СписокНачисленийПремий()
	
	НачисленияПремии = Новый Массив;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                      |	ВидыНачислений.Ссылка КАК ВидНачисленияСсылка
	                      |ИЗ
	                      |	Справочник.ВидыНачислений КАК ВидыНачислений
	                      |ГДЕ
	                      |	ВидыНачислений.ПометкаУдаления = ЛОЖЬ
	                      |	И ВидыНачислений.ЯвляетсяПремией = ИСТИНА
	                      |	И ВидыНачислений.ЭтоГруппа = ЛОЖЬ
	                      |	И ВидыНачислений.ВключатьВФОТ = ИСТИНА");
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НачисленияПремии.Добавить(Выборка.ВидНачисленияСсылка);
		КонецЦикла;	
	КонецЕсли;	
		
	Возврат НачисленияПремии;
	
КонецФункции

Функция СписокНачисленийФОТ()
	
	НачисленияФОТ = Новый Массив;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                      |	ВидыНачислений.Ссылка КАК ВидНачисленияСсылка
	                      |ИЗ
	                      |	Справочник.ВидыНачислений КАК ВидыНачислений
	                      |ГДЕ
	                      |	ВидыНачислений.ПометкаУдаления = ЛОЖЬ
	                      |	И ВидыНачислений.ВключатьВФОТ = ИСТИНА
	                      |	И ВидыНачислений.ЭтоГруппа = ЛОЖЬ");
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НачисленияФОТ.Добавить(Выборка.ВидНачисленияСсылка);
		КонецЦикла;	
	КонецЕсли;	
		
	Возврат НачисленияФОТ;
	
КонецФункции

#КонецОбласти

#Область РасчетВзносов

Процедура РассчитатьВзносыПрогноза()

	УстановитьПривилегированныйРежим(Истина);
	
	ИмяЗамера = "РасчетПоказателейБюджетовПрогнозов.РасчетВзносовПрогнозов";
	Замер = НачатьЗамерВремени();
	
	НачисленияПремии = СписокНачисленийПремий();
	НачисленияФОТ = СписокНачисленийФОТ();
	
	Если РасчитанныеПоказатели.Начисления.Количество() > 0 Тогда 
		
		ТаблицаНачисленийПоПериодам = РасчитанныеПоказатели.Начисления.Скопировать();
		ТаблицаНачисленийПоПериодам.Свернуть("ФизическоеЛицо,МесяцНачисления,Организация,Подразделение,МестоВозникновенияЗатрат,ПозицияШтатногоРасписания,КодГрейда,ДатаНачала,ДатаОкончания", "Результат");
			
		ТаблицаНачисленийПоПериодамНачислениям = РасчитанныеПоказатели.Начисления.Скопировать();
		ТаблицаНачисленийПоПериодамНачислениям.Свернуть("ФизическоеЛицо,МесяцНачисления,ВидНачисления, Организация,Подразделение,МестоВозникновенияЗатрат,ПозицияШтатногоРасписания,КодГрейда,ДатаНачала,ДатаОкончания", "Результат");
		
		Если РасчитанныеПоказатели.Взносы.Количество() > 0 Тогда
			РасчитанныеПоказатели.Взносы.Очистить();	
		КонецЕсли;	
			
		Для Каждого МесяцЗначение Из МесяцыРасчета Цикл
			
			НастройкиДатаВыплатыБюджетирования = РасчетБюджетированияРасширенныйВызовСервера.СведенияОНастройкахБюджетированиеРасширенная(Организация, НачалоГода(МесяцЗначение), Сценарий);
			
			#Область СозданиеЗапроса
			
			Запрос = Новый Запрос();
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			
			Запрос.УстановитьПараметр("ТаблицаНачисленийПоПериодам", ТаблицаНачисленийПоПериодам);
			Запрос.УстановитьПараметр("ТаблицаНачисленийПоПериодамНачислениям", ТаблицаНачисленийПоПериодамНачислениям);
			
			Запрос.УстановитьПараметр("БазовыеНачисления", НачисленияФОТ);
			
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ТаблицаНачисленийПоПериодамНачислениям.ФизическоеЛицо КАК ФизическоеЛицо,
				|	ТаблицаНачисленийПоПериодамНачислениям.МесяцНачисления КАК МесяцНачисления,
				|	ТаблицаНачисленийПоПериодамНачислениям.ВидНачисления КАК ВидНачисления,
				|	ТаблицаНачисленийПоПериодамНачислениям.Организация КАК Организация,
				|	ТаблицаНачисленийПоПериодамНачислениям.Подразделение КАК Подразделение,
				|	ТаблицаНачисленийПоПериодамНачислениям.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
				|	ТаблицаНачисленийПоПериодамНачислениям.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
				|	ТаблицаНачисленийПоПериодамНачислениям.КодГрейда КАК КодГрейда,
				|	ТаблицаНачисленийПоПериодамНачислениям.ДатаНачала КАК ДатаНачала,
				|	ТаблицаНачисленийПоПериодамНачислениям.ДатаОкончания КАК ДатаОкончания,
				|	ТаблицаНачисленийПоПериодамНачислениям.Результат КАК Результат
				|ПОМЕСТИТЬ ВТТаблицаИсходная
				|ИЗ
				|	&ТаблицаНачисленийПоПериодамНачислениям КАК ТаблицаНачисленийПоПериодамНачислениям
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ВТТаблицаИсходная.ФизическоеЛицо КАК ФизическоеЛицо,
				|	ВТТаблицаИсходная.МесяцНачисления КАК МесяцНачисления,
				|	ВТТаблицаИсходная.Организация КАК Организация,
				|	ВТТаблицаИсходная.Подразделение КАК Подразделение,
				|	ВТТаблицаИсходная.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
				|	ВТТаблицаИсходная.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
				|	ВТТаблицаИсходная.КодГрейда КАК КодГрейда,
				|	ВТТаблицаИсходная.ДатаНачала КАК НачалоПериода,
				|	ВТТаблицаИсходная.ДатаОкончания КАК ОкончаниеПериода,
				|	СУММА(ВТТаблицаИсходная.Результат) КАК РезультатНакопленный
				|ПОМЕСТИТЬ ВТНакопленныеДанныеЗаМесяц
				|ИЗ
				|	ВТТаблицаИсходная КАК ВТТаблицаИсходная
				|ГДЕ
				|	ВТТаблицаИсходная.МесяцНачисления = &ДатаСреза
				|	И ВТТаблицаИсходная.ВидНачисления В(&БазовыеНачисления)
				|
				|СГРУППИРОВАТЬ ПО
				|	ВТТаблицаИсходная.ФизическоеЛицо,
				|	ВТТаблицаИсходная.МесяцНачисления,
				|	ВТТаблицаИсходная.Организация,
				|	ВТТаблицаИсходная.Подразделение,
				|	ВТТаблицаИсходная.МестоВозникновенияЗатрат,
				|	ВТТаблицаИсходная.ПозицияШтатногоРасписания,
				|	ВТТаблицаИсходная.КодГрейда,
				|	ВТТаблицаИсходная.ДатаНачала,
				|	ВТТаблицаИсходная.ДатаОкончания
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|//ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|//	НакопленныеДанныеЗаГод.ФизическоеЛицо КАК ФизическоеЛицо,
				|//	НакопленныеДанныеЗаГод.Организация КАК Организация,
				|//	НакопленныеДанныеЗаГод.Подразделение КАК Подразделение,
				|//	НакопленныеДанныеЗаГод.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
				|//	НакопленныеДанныеЗаГод.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
				|//	НакопленныеДанныеЗаГод.КодГрейда КАК КодГрейда,
				|//	НакопленныеДанныеЗаГод.ДатаНачала КАК НачалоПериода,
				|//	НакопленныеДанныеЗаГод.ДатаОкончания КАК ОкончаниеПериода,
				|//	НАЧАЛОПЕРИОДА(НакопленныеДанныеЗаГод.МесяцНачисления, ГОД) КАК ГодНакопления,
				|//	СУММА(ВЫБОР
				|//			КОГДА НакопленныеДанныеЗаГод.МесяцНачисления < &ДатаСреза
				|//				ТОГДА НакопленныеДанныеЗаГод.Результат
				|//			ИНАЧЕ 0
				|//		КОНЕЦ) КАК РезультатНакопленныйПредыдущихМесяцев,
				|//	СУММА(НакопленныеДанныеЗаГод.Результат) КАК РезультатНакопленный
				|//ПОМЕСТИТЬ ВТНакопленныеДанныеЗаГод
				|//ИЗ
				|//	(ВЫБРАТЬ
				|//		ВТТаблицаИсходная.ФизическоеЛицо КАК ФизическоеЛицо,
				|//		ВТТаблицаИсходная.МесяцНачисления КАК МесяцНачисления,
				|//		ВТТаблицаИсходная.Организация КАК Организация,
				|//		ВТТаблицаИсходная.Подразделение КАК Подразделение,
				|//		ВТТаблицаИсходная.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
				|//		ВТТаблицаИсходная.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
				|//		ВТТаблицаИсходная.КодГрейда КАК КодГрейда,
				|//		ВТТаблицаИсходная.ДатаНачала КАК ДатаНачала,
				|//		ВТТаблицаИсходная.ДатаОкончания КАК ДатаОкончания,
				|//		ВТТаблицаИсходная.Результат КАК Результат
				|//	ИЗ
				|//		ВТТаблицаИсходная КАК ВТТаблицаИсходная
				|//	ГДЕ
				|//		ВТТаблицаИсходная.МесяцНачисления <= &ДатаСреза
				|//		И НАЧАЛОПЕРИОДА(ВТТаблицаИсходная.МесяцНачисления, ГОД) = НАЧАЛОПЕРИОДА(&ДатаСреза, ГОД)
				|//		И ВТТаблицаИсходная.ВидНачисления В(&БазовыеНачисления)) КАК НакопленныеДанныеЗаГод
				|//
				|//СГРУППИРОВАТЬ ПО
				|//	НакопленныеДанныеЗаГод.ФизическоеЛицо,
				|//	НакопленныеДанныеЗаГод.Организация,
				|//	НакопленныеДанныеЗаГод.Подразделение,
				|//	НакопленныеДанныеЗаГод.МестоВозникновенияЗатрат,
				|//	НакопленныеДанныеЗаГод.ПозицияШтатногоРасписания,
				|//	НакопленныеДанныеЗаГод.КодГрейда,
				|//	НакопленныеДанныеЗаГод.ДатаНачала,
				|//	НакопленныеДанныеЗаГод.ДатаОкончания,
				|//	НАЧАЛОПЕРИОДА(НакопленныеДанныеЗаГод.МесяцНачисления, ГОД)
				|//;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ВЫРАЗИТЬ(ТаблицаНачисленийПоПериодам.ФизическоеЛицо КАК Справочник.ФизическиеЛица) КАК ФизическоеЛицо,
				|	ТаблицаНачисленийПоПериодам.МесяцНачисления КАК Период,
				|	ТаблицаНачисленийПоПериодам.Организация КАК Организация,
				|	ТаблицаНачисленийПоПериодам.Подразделение КАК Подразделение,
				|	ТаблицаНачисленийПоПериодам.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
				|	ТаблицаНачисленийПоПериодам.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
				|	ТаблицаНачисленийПоПериодам.КодГрейда КАК КодГрейда,
				|	ТаблицаНачисленийПоПериодам.ДатаНачала КАК НачалоПериода,
				|	ТаблицаНачисленийПоПериодам.ДатаОкончания КАК ОкончаниеПериода,
				|	ТаблицаНачисленийПоПериодам.Результат КАК Результат
				|ПОМЕСТИТЬ ВТТаблицаПоПериодам
				|ИЗ
				|	&ТаблицаНачисленийПоПериодам КАК ТаблицаНачисленийПоПериодам
				|ГДЕ
				|	ТаблицаНачисленийПоПериодам.МесяцНачисления = &ДатаСреза
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ВТТаблицаПоПериодам.ФизическоеЛицо КАК ФизическоеЛицо,
				|	ВЫБОР
				|		КОГДА ВТТаблицаПоПериодам.ФизическоеЛицо ЕСТЬ NULL
				|				ИЛИ ВТТаблицаПоПериодам.ФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
				|			ТОГДА ЛОЖЬ
				|		ИНАЧЕ ВТТаблицаПоПериодам.ФизическоеЛицо.РезидентРФ
				|	КОНЕЦ КАК РезидентРФ,
				|	ВЫБОР
				|		КОГДА ВТТаблицаПоПериодам.ФизическоеЛицо ЕСТЬ NULL
				|				ИЛИ ВТТаблицаПоПериодам.ФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
				|			ТОГДА ЛОЖЬ
				|		ИНАЧЕ ВЫБОР
				|				КОГДА НЕ ВТТаблицаПоПериодам.ФизическоеЛицо.Гражданство ЕСТЬ NULL
				|						И НЕ ВТТаблицаПоПериодам.ФизическоеЛицо.Гражданство = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
				|						И ВТТаблицаПоПериодам.ФизическоеЛицо.Гражданство = &Белоруссия
				|					ТОГДА ИСТИНА
				|				ИНАЧЕ ЛОЖЬ
				|			КОНЕЦ
				|	КОНЕЦ КАК ЭтоБелоруссия,
				|	ВТТаблицаПоПериодам.Период КАК Период,
				|	ВТТаблицаПоПериодам.Организация КАК Организация,
				|	ВТТаблицаПоПериодам.Подразделение КАК Подразделение,
				|	ВТТаблицаПоПериодам.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
				|	ВТТаблицаПоПериодам.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
				|	ВТТаблицаПоПериодам.КодГрейда КАК КодГрейда,
				|	ВТТаблицаПоПериодам.НачалоПериода КАК НачалоПериода,
				|	ВТТаблицаПоПериодам.ОкончаниеПериода КАК ОкончаниеПериода,
				|	ВТТаблицаПоПериодам.Результат КАК Результат,
				|	//ВТНакопленныеДанныеЗаГод.РезультатНакопленныйПредыдущихМесяцев КАК РезультатНакопленныйПредыдущихМесяцев,
				|	//ВТНакопленныеДанныеЗаГод.РезультатНакопленный КАК РезультатНакопленныйЗаГод,
				|	ВТНакопленныеДанныеЗаМесяц.РезультатНакопленный КАК РезультатНакопленныйЗаМесяц
				|ПОМЕСТИТЬ ВТТаблицаНачисленийПоПериодам
				|ИЗ
				|	ВТТаблицаПоПериодам КАК ВТТаблицаПоПериодам
				|		//ЛЕВОЕ СОЕДИНЕНИЕ ВТНакопленныеДанныеЗаГод КАК ВТНакопленныеДанныеЗаГод
				|		//ПО ВТТаблицаПоПериодам.ФизическоеЛицо = ВТНакопленныеДанныеЗаГод.ФизическоеЛицо
				|		//	И ВТТаблицаПоПериодам.Организация = ВТНакопленныеДанныеЗаГод.Организация
				|		//	И ВТТаблицаПоПериодам.Подразделение = ВТНакопленныеДанныеЗаГод.Подразделение
				|		//	И ВТТаблицаПоПериодам.МестоВозникновенияЗатрат = ВТНакопленныеДанныеЗаГод.МестоВозникновенияЗатрат
				|		//	И ВТТаблицаПоПериодам.ПозицияШтатногоРасписания = ВТНакопленныеДанныеЗаГод.ПозицияШтатногоРасписания
				|		//	И ВТТаблицаПоПериодам.КодГрейда = ВТНакопленныеДанныеЗаГод.КодГрейда
				|		//	И (НАЧАЛОПЕРИОДА(ВТТаблицаПоПериодам.Период, ГОД) = ВТНакопленныеДанныеЗаГод.ГодНакопления)
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНакопленныеДанныеЗаМесяц КАК ВТНакопленныеДанныеЗаМесяц
				|		ПО ВТТаблицаПоПериодам.ФизическоеЛицо = ВТНакопленныеДанныеЗаМесяц.ФизическоеЛицо
				|			И ВТТаблицаПоПериодам.Организация = ВТНакопленныеДанныеЗаМесяц.Организация
				|			И ВТТаблицаПоПериодам.Подразделение = ВТНакопленныеДанныеЗаМесяц.Подразделение
				|			И ВТТаблицаПоПериодам.МестоВозникновенияЗатрат = ВТНакопленныеДанныеЗаМесяц.МестоВозникновенияЗатрат
				|			И ВТТаблицаПоПериодам.ПозицияШтатногоРасписания = ВТНакопленныеДанныеЗаМесяц.ПозицияШтатногоРасписания
				|			И ВТТаблицаПоПериодам.КодГрейда = ВТНакопленныеДанныеЗаМесяц.КодГрейда
				|			И ВТТаблицаПоПериодам.Период = ВТНакопленныеДанныеЗаМесяц.МесяцНачисления";
			
			Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(МесяцЗначение));
			Запрос.УстановитьПараметр("Белоруссия", Справочники.СтраныМира.НайтиПоКоду("112"));
			Запрос.Выполнить(); 
			
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			               |	КоэффициентыПремийТекущегоГода.Период КАК Период,
			               |	МАКСИМУМ(КоэффициентыПремийТекущегоГода.КоэффициентСтраховыхВзносовНаТравматизмТекущегоГода) КАК КоэффициентСтраховыхВзносовНаТравматизмТекущегоГода,
			               |	МАКСИМУМ(КоэффициентыПремийТекущегоГода.КоэффициентСтраховыхВзносовВФФОМСТекущегоГода) КАК КоэффициентСтраховыхВзносовВФФОМСТекущегоГода
			               |ПОМЕСТИТЬ ВТКоэффициентыПремийТекущегоГода
			               |ИЗ
			               |	(ВЫБРАТЬ
			               |		&ДатаСреза КАК Период,
			               |		ВЫБОР
			               |			КОГДА КоэффициентыНачисленийСрезПоследних.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.СтраховыхВзносовНаТравматизм)
			               |					И (КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.ПустаяСсылка)
			               |						ИЛИ КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.Год))
			               |				ТОГДА КоэффициентыНачисленийСрезПоследних.Коэффициент
			               |			ИНАЧЕ 0
			               |		КОНЕЦ КАК КоэффициентСтраховыхВзносовНаТравматизмТекущегоГода,
			               |		ВЫБОР
			               |			КОГДА КоэффициентыНачисленийСрезПоследних.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.СтраховыеВзносыВФФОМС)
			               |					И (КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.ПустаяСсылка)
			               |						ИЛИ КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.Год))
			               |				ТОГДА КоэффициентыНачисленийСрезПоследних.Коэффициент
			               |			ИНАЧЕ 0
			               |		КОНЕЦ КАК КоэффициентСтраховыхВзносовВФФОМСТекущегоГода
			               |	ИЗ
			               |		РегистрСведений.КоэффициентыНачислений.СрезПоследних(&ДатаНачалаГода, Сценарий = &Сценарий) КАК КоэффициентыНачисленийСрезПоследних
			               |	
			               |	ОБЪЕДИНИТЬ ВСЕ
			               |	
			               |	ВЫБРАТЬ
			               |		&ДатаСреза,
			               |		0,
			               |		0
			               |	ИЗ
			               |		Справочник.Сценарии КАК Сценарий
			               |	ГДЕ
			               |		Сценарий.Ссылка = &Сценарий) КАК КоэффициентыПремийТекущегоГода
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	КоэффициентыПремийТекущегоГода.Период";
			
			Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(МесяцЗначение));
			Запрос.УстановитьПараметр("ДатаНачалаГода", НачалоГода(МесяцЗначение));
			Запрос.УстановитьПараметр("Сценарий",  Сценарий);
			Запрос.Выполнить();
			
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	СтавкиНалогов.Период КАК Период,
			               |	МАКСИМУМ(СтавкиНалогов.СтавкаНалогаПФР) КАК СтавкаНалогаПФР,
			               |	МАКСИМУМ(СтавкиНалогов.ГраницаНалогаПФР) КАК ГраницаНалогаПФР,
			               |	МАКСИМУМ(СтавкиНалогов.СтавкаНалогаПослеГраницыПФР) КАК СтавкаНалогаПослеГраницыПФР,
			               |	МАКСИМУМ(СтавкиНалогов.СтавкаНалогаПрочееПФР) КАК СтавкаНалогаПрочееПФР,
			               |	МАКСИМУМ(СтавкиНалогов.СтавкаНалогаКорректировкаПФР) КАК СтавкаНалогаКорректировкаПФР,
			               |	МАКСИМУМ(СтавкиНалогов.СтавкаНалогаФСС) КАК СтавкаНалогаФСС,
			               |	МАКСИМУМ(СтавкиНалогов.ГраницаНалогаФСС) КАК ГраницаНалогаФСС,
			               |	МАКСИМУМ(СтавкиНалогов.СтавкаНалогаПослеГраницыФСС) КАК СтавкаНалогаПослеГраницыФСС,
			               |	МАКСИМУМ(СтавкиНалогов.СтавкаНалогаПрочееФСС) КАК СтавкаНалогаПрочееФСС,
			               |	МАКСИМУМ(СтавкиНалогов.СтавкаНалогаКорректировкаФСС) КАК СтавкаНалогаКорректировкаФСС
			               |ПОМЕСТИТЬ ВТСтавкиНалогов
			               |ИЗ
			               |	(ВЫБРАТЬ
			               |		&ДатаСреза КАК Период,
			               |		ВЫБОР
			               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ПФР)
			               |				ТОГДА СтавкиНалоговСрезПоследних.СтавкаНалога
			               |			ИНАЧЕ 0
			               |		КОНЕЦ КАК СтавкаНалогаПФР,
			               |		ВЫБОР
			               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ПФР)
			               |				ТОГДА СтавкиНалоговСрезПоследних.ГраницаНалога
			               |			ИНАЧЕ 0
			               |		КОНЕЦ КАК ГраницаНалогаПФР,
			               |		ВЫБОР
			               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ПФР)
			               |				ТОГДА СтавкиНалоговСрезПоследних.СтавкаНалогаПослеГраницы
			               |			ИНАЧЕ 0
			               |		КОНЕЦ КАК СтавкаНалогаПослеГраницыПФР,
			               |		ВЫБОР
			               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ПФР)
			               |				ТОГДА СтавкиНалоговСрезПоследних.СтавкаНалогаПрочее
			               |			ИНАЧЕ 0
			               |		КОНЕЦ КАК СтавкаНалогаПрочееПФР,
			               |		ВЫБОР
			               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ПФР)
			               |				ТОГДА СтавкиНалоговСрезПоследних.СтавкаНалогаКорректировка
			               |			ИНАЧЕ 0
			               |		КОНЕЦ КАК СтавкаНалогаКорректировкаПФР,
			               |		ВЫБОР
			               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ФСС)
			               |				ТОГДА СтавкиНалоговСрезПоследних.СтавкаНалога
			               |			ИНАЧЕ 0
			               |		КОНЕЦ КАК СтавкаНалогаФСС,
			               |		ВЫБОР
			               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ФСС)
			               |				ТОГДА СтавкиНалоговСрезПоследних.ГраницаНалога
			               |			ИНАЧЕ 0
			               |		КОНЕЦ КАК ГраницаНалогаФСС,
			               |		ВЫБОР
			               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ФСС)
			               |				ТОГДА СтавкиНалоговСрезПоследних.СтавкаНалогаПослеГраницы
			               |			ИНАЧЕ 0
			               |		КОНЕЦ КАК СтавкаНалогаПослеГраницыФСС,
			               |		ВЫБОР
			               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ФСС)
			               |				ТОГДА СтавкиНалоговСрезПоследних.СтавкаНалогаПрочее
			               |			ИНАЧЕ 0
			               |		КОНЕЦ КАК СтавкаНалогаПрочееФСС,
			               |		ВЫБОР
			               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ФСС)
			               |				ТОГДА СтавкиНалоговСрезПоследних.СтавкаНалогаКорректировка
			               |			ИНАЧЕ 0
			               |		КОНЕЦ КАК СтавкаНалогаКорректировкаФСС
			               |	ИЗ
			               |		РегистрСведений.СтавкиНалогов.СрезПоследних(&ДатаСреза, Сценарий = &Сценарий) КАК СтавкиНалоговСрезПоследних
			               |	
			               |	ОБЪЕДИНИТЬ ВСЕ
			               |	
			               |	ВЫБРАТЬ
			               |		&ДатаСреза,
			               |		0,
			               |		0,
			               |		0,
			               |		0,
			               |		0,
			               |		0,
			               |		0,
			               |		0,
			               |		0,
			               |		0
			               |	ИЗ
			               |		Справочник.Сценарии КАК Сценарий
			               |	ГДЕ
			               |		Сценарий.Ссылка = &Сценарий) КАК СтавкиНалогов
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	СтавкиНалогов.Период";
			
			Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(МесяцЗначение));
			Запрос.УстановитьПараметр("Сценарий",  Сценарий);
			Запрос.Выполнить();
			
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ВТТаблицаНачисленийПоПериодам.ФизическоеЛицо КАК ФизическоеЛицо,
				|	ВТТаблицаНачисленийПоПериодам.Период КАК Период,
				|	ВТТаблицаНачисленийПоПериодам.Организация КАК Организация,
				|	ВТТаблицаНачисленийПоПериодам.Подразделение КАК Подразделение,
				|	ВТТаблицаНачисленийПоПериодам.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
				|	ВТТаблицаНачисленийПоПериодам.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
				|	ВТТаблицаНачисленийПоПериодам.КодГрейда КАК КодГрейда,
				|	ВТТаблицаНачисленийПоПериодам.НачалоПериода КАК НачалоПериода,
				|	ВТТаблицаНачисленийПоПериодам.ОкончаниеПериода КАК ОкончаниеПериода,
				|	ВТТаблицаНачисленийПоПериодам.Результат КАК Результат,
				|	//ВТТаблицаНачисленийПоПериодам.РезультатНакопленныйПредыдущихМесяцев КАК РезультатНакопленныйЗаПредыдущиеМесяцы,
				|	ВТТаблицаНачисленийПоПериодам.РезультатНакопленныйЗаМесяц КАК РезультатНакопленныйЗаМесяц,
				|	//ВТТаблицаНачисленийПоПериодам.РезультатНакопленныйЗаГод КАК РезультатНакопленныйЗаГод,
				|	ВТКоэффициентыПремийТекущегоГода.КоэффициентСтраховыхВзносовНаТравматизмТекущегоГода КАК КоэффициентСтраховыхВзносовНаТравматизмТекущегоГода,
				|	ВТКоэффициентыПремийТекущегоГода.КоэффициентСтраховыхВзносовВФФОМСТекущегоГода КАК КоэффициентСтраховыхВзносовВФФОМСТекущегоГода,
				|	ВЫБОР
				|		КОГДА ВТСтавкиНалогов.СтавкаНалогаПФР ЕСТЬ NULL
				|			ТОГДА 0
				|		ИНАЧЕ ВТСтавкиНалогов.СтавкаНалогаПФР
				|	КОНЕЦ КАК СтавкаНалогаПФР,
				|	ВТСтавкиНалогов.ГраницаНалогаПФР КАК ГраницаНалогаПФР,
				|	ВТСтавкиНалогов.СтавкаНалогаПослеГраницыПФР КАК СтавкаНалогаПослеГраницыПФР,
				|	ВЫБОР
				|		КОГДА НЕ ВТКоэффициентыПремийТекущегоГода.КоэффициентСтраховыхВзносовНаТравматизмТекущегоГода ЕСТЬ NULL
				|				И НЕ ВТТаблицаНачисленийПоПериодам.Результат ЕСТЬ NULL
				|			ТОГДА ВТТаблицаНачисленийПоПериодам.РезультатНакопленныйЗаМесяц * ВТКоэффициентыПремийТекущегоГода.КоэффициентСтраховыхВзносовНаТравматизмТекущегоГода / 100
				|		ИНАЧЕ 0
				|	КОНЕЦ КАК СуммаНалогаНаТравматизм,
				|	ВЫБОР
				|		КОГДА ВТТаблицаНачисленийПоПериодам.РезидентРФ = ЛОЖЬ
				|				И ВТТаблицаНачисленийПоПериодам.ЭтоБелоруссия = ЛОЖЬ
				|			ТОГДА 0
				|		ИНАЧЕ ВТТаблицаНачисленийПоПериодам.РезультатНакопленныйЗаМесяц * ВТКоэффициентыПремийТекущегоГода.КоэффициентСтраховыхВзносовВФФОМСТекущегоГода / 100
				|	КОНЕЦ КАК СуммаВзносаВФФОМС,
				|	ВЫБОР
				|		КОГДА НЕ ВТСтавкиНалогов.СтавкаНалогаПослеГраницыПФР ЕСТЬ NULL
				|				И НЕ ВТТаблицаНачисленийПоПериодам.Результат ЕСТЬ NULL
				|			ТОГДА ВТТаблицаНачисленийПоПериодам.РезультатНакопленныйЗаМесяц * ВТСтавкиНалогов.СтавкаНалогаПослеГраницыПФР / 100
				|		ИНАЧЕ 0
				|	КОНЕЦ КАК СуммаВзносаВПФР,
				|	ВТСтавкиНалогов.СтавкаНалогаПослеГраницыФСС КАК СтавкаНалогаПослеГраницыФСС,
				|	ВЫБОР
				|		КОГДА НЕ ВТСтавкиНалогов.СтавкаНалогаПослеГраницыФСС ЕСТЬ NULL
				|				И НЕ ВТТаблицаНачисленийПоПериодам.Результат ЕСТЬ NULL
				|			ТОГДА ВТТаблицаНачисленийПоПериодам.РезультатНакопленныйЗаМесяц * ВТСтавкиНалогов.СтавкаНалогаПослеГраницыФСС / 100
				|		ИНАЧЕ 0
				|	КОНЕЦ КАК СуммаВзносаВФСС
				|ИЗ
				|	ВТТаблицаНачисленийПоПериодам КАК ВТТаблицаНачисленийПоПериодам
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыПремийТекущегоГода КАК ВТКоэффициентыПремийТекущегоГода
				|		ПО ВТТаблицаНачисленийПоПериодам.Период = ВТКоэффициентыПремийТекущегоГода.Период
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиНалогов КАК ВТСтавкиНалогов
				|		ПО ВТТаблицаНачисленийПоПериодам.Период = ВТСтавкиНалогов.Период";
			
			РезультатНачислений = Запрос.Выполнить();
			
			УдаляемыеВТТаблицы = Новый Массив;
			УдаляемыеВТТаблицы.Добавить("ВТТаблицаИсходная");
			УдаляемыеВТТаблицы.Добавить("ВТНакопленныеДанныеЗаМесяц");
			//УдаляемыеВТТаблицы.Добавить("ВТНакопленныеДанныеЗаГод");
			УдаляемыеВТТаблицы.Добавить("ВТТаблицаПоПериодам");
			УдаляемыеВТТаблицы.Добавить("ВТТаблицаНачисленийПоПериодам");
			УдаляемыеВТТаблицы.Добавить("ВТКоэффициентыПремийТекущегоГода");
			УдаляемыеВТТаблицы.Добавить("ВТСтавкиНалогов");
			
			Бюджетирование.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдаляемыеВТТаблицы); 
			
	#КонецОбласти 			
			
			Если Не РезультатНачислений.Пустой() Тогда 
				
				ВыборкаРезультатовНачислений = РезультатНачислений.Выбрать();
				Пока ВыборкаРезультатовНачислений.Следующий() Цикл
					
	#Область ОсновныеНачисленияНалогов
	
					НалогНаТравматизмСЗарплаты = 0;
					ВзносыВФФОМССЗарплаты = 0;
					ВзносыВПФРСЗарплаты = 0;
					ВзносыВФСССЗарплаты = 0;
	
					//1. Налог на травматизм
					НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений); 
					НоваяСтрокаВзносов.МесяцНачисления = ВыборкаРезультатовНачислений.Период;
					НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыхВзносовНаТравматизм");  
					НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФСС");
					НоваяСтрокаВзносов.Сумма 	 = ВыборкаРезультатовНачислений.СуммаНалогаНаТравматизм;	
					НоваяСтрокаВзносов.Результат = ВыборкаРезультатовНачислений.СуммаНалогаНаТравматизм;
					
					НалогНаТравматизмСЗарплаты = ВыборкаРезультатовНачислений.СуммаНалогаНаТравматизм;
					
					//2. Взносы в ФФОМС
					НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
					НоваяСтрокаВзносов.МесяцНачисления = ВыборкаРезультатовНачислений.Период;
					НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВФФОМС");  
					НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФФОМС");
					НоваяСтрокаВзносов.Результат = ?(ВыборкаРезультатовНачислений.СуммаВзносаВФФОМС=Null, 0, ВыборкаРезультатовНачислений.СуммаВзносаВФФОМС); 
					НоваяСтрокаВзносов.Сумма 	 = НоваяСтрокаВзносов.Результат;
					
					ВзносыВФФОМССЗарплаты = ?(ВыборкаРезультатовНачислений.СуммаВзносаВФФОМС=Null, 0, ВыборкаРезультатовНачислений.СуммаВзносаВФФОМС);
					
					//3. Взносы в ПФР **************************************************************
					
					НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
					НоваяСтрокаВзносов.МесяцНачисления = ВыборкаРезультатовНачислений.Период;
					НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВПФР");  
					НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ПФР"); 
					НоваяСтрокаВзносов.Сумма 	 = ВыборкаРезультатовНачислений.СуммаВзносаВПФР;
					НоваяСтрокаВзносов.Результат = ВыборкаРезультатовНачислений.СуммаВзносаВПФР; 
					
					Если ВыборкаРезультатовНачислений.СуммаВзносаВПФР = Null Тогда
						СуммаВзносовВПФРТекущегоМесяца = 0;	
					Иначе	
						СуммаВзносовВПФРТекущегоМесяца = ВыборкаРезультатовНачислений.СуммаВзносаВПФР;
					КонецЕсли;
					
					ВзносыВПФРСЗарплаты = СуммаВзносовВПФРТекущегоМесяца;
					
					//*******************************************************************************
					
					//4. Взносы в ФСС  
					
					НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
					НоваяСтрокаВзносов.МесяцНачисления = ВыборкаРезультатовНачислений.Период;
					НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВФСС");  
					НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФСС"); 
					НоваяСтрокаВзносов.Сумма 	 = ВыборкаРезультатовНачислений.СуммаВзносаВФСС;
					НоваяСтрокаВзносов.Результат = ВыборкаРезультатовНачислений.СуммаВзносаВФСС;
					
					Если ВыборкаРезультатовНачислений.СуммаВзносаВФСС = Null Тогда
						СуммаВзносовВФССТекущегоМесяца = 0;
					Иначе	
						СуммаВзносовВФССТекущегоМесяца = ВыборкаРезультатовНачислений.СуммаВзносаВФСС;
					КонецЕсли;                                                     
					
					ВзносыВФСССЗарплаты = СуммаВзносовВФССТекущегоМесяца;
					
					//***************************************************************************************************
					
	#КонецОбласти
	
	#Область РасчетВзносовСПремий
	
	                Для Каждого СтрокаНачисление Из НачисленияПремии Цикл
					
						// По видам премий				
						//5. Налог на травматизм с квартальной премии (сумма в составе от общей суммы налога на травматизм)
						НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
						НоваяСтрокаВзносов.МесяцНачисления = ВыборкаРезультатовНачислений.Период;
						НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыхВзносовНаТравматизм"); 
						НоваяСтрокаВзносов.ВидНачисления = СтрокаНачисление; // ПредопределенноеЗначение("Справочник.ВидыНачислений.КвартальнаяПремия");  
						НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФСС");
						
						Если СтрокаНачисление = ПредопределенноеЗначение("Справочник.ВидыНачислений.КвартальнаяПремия") Тогда
							Если Месяц(ВыборкаРезультатовНачислений.Период) = 4 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал1;
							ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 7 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал2;
							ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 10 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал3;     
							ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 1 ИЛИ Месяц(ВыборкаРезультатовНачислений.Период) = 12 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал4;
							Иначе
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.ПустаяСсылка();
							КонецЕсли;  
						КонецЕсли;	
							
						Отбор = Новый Структура();
						Отбор.Вставить("ФизическоеЛицо", ВыборкаРезультатовНачислений.ФизическоеЛицо);
						Отбор.Вставить("Организация", ВыборкаРезультатовНачислений.Организация);
						Отбор.Вставить("Подразделение", ВыборкаРезультатовНачислений.Подразделение);
						Отбор.Вставить("МестоВозникновенияЗатрат", ВыборкаРезультатовНачислений.МестоВозникновенияЗатрат);
						Отбор.Вставить("МесяцНачисления", ВыборкаРезультатовНачислений.Период);
						Отбор.Вставить("ВидНачисления", СтрокаНачисление); // Справочники.ВидыНачислений.КвартальнаяПремия);
						Отбор.Вставить("КодГрейда", ВыборкаРезультатовНачислений.КодГрейда);
						Отбор.Вставить("ПозицияШтатногоРасписания", ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания);
						НайденныеНачисления = ТаблицаНачисленийПоПериодамНачислениям.НайтиСтроки(Отбор);
						Если НайденныеНачисления.Количество() > 0 Тогда 
							Если НайденныеНачисления[0].Результат = 0 Тогда
								НоваяСтрокаВзносов.Результат = 0;
							Иначе	
								НоваяСтрокаВзносов.Результат = НайденныеНачисления[0].Результат / ВыборкаРезультатовНачислений.РезультатНакопленныйЗаМесяц 
																	* ВыборкаРезультатовНачислений.СуммаНалогаНаТравматизм;
							КонецЕсли;										
						Иначе	
							НоваяСтрокаВзносов.Результат = 0;	
						КонецЕсли;
						НоваяСтрокаВзносов.Сумма = НоваяСтрокаВзносов.Результат;
						
						НалогНаТравматизмСЗарплаты = НалогНаТравматизмСЗарплаты - НоваяСтрокаВзносов.Результат;
						
						//*******************************************************************************
					
						//6. Взносы в ФФОМС с квартальной премии (сумма в составе от общей суммы взносов в ФФОМС)
						НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
						НоваяСтрокаВзносов.МесяцНачисления = ВыборкаРезультатовНачислений.Период;
						НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВФФОМС");
						НоваяСтрокаВзносов.ВидНачисления = СтрокаНачисление; // ПредопределенноеЗначение("Справочник.ВидыНачислений.КвартальнаяПремия");  
						НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФФОМС");
						
						Если СтрокаНачисление = ПредопределенноеЗначение("Справочник.ВидыНачислений.КвартальнаяПремия") Тогда
							Если Месяц(ВыборкаРезультатовНачислений.Период) = 4 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал1;
							ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 7 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал2;
							ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 10 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал3;     
							ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 1 ИЛИ Месяц(ВыборкаРезультатовНачислений.Период) = 12 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал4;
							Иначе
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.ПустаяСсылка();
							КонецЕсли;
						КонецЕсли;	
						
						Отбор = Новый Структура();
						Отбор.Вставить("ФизическоеЛицо", ВыборкаРезультатовНачислений.ФизическоеЛицо);
						Отбор.Вставить("Организация", ВыборкаРезультатовНачислений.Организация);
						Отбор.Вставить("Подразделение", ВыборкаРезультатовНачислений.Подразделение); 
						Отбор.Вставить("МестоВозникновенияЗатрат", ВыборкаРезультатовНачислений.МестоВозникновенияЗатрат);
						Отбор.Вставить("МесяцНачисления", ВыборкаРезультатовНачислений.Период);
						Отбор.Вставить("ВидНачисления", СтрокаНачисление); // Справочники.ВидыНачислений.КвартальнаяПремия);
						Отбор.Вставить("КодГрейда", ВыборкаРезультатовНачислений.КодГрейда);
						Отбор.Вставить("ПозицияШтатногоРасписания", ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания);
						НайденныеНачисления = ТаблицаНачисленийПоПериодамНачислениям.НайтиСтроки(Отбор);
						Если ВыборкаРезультатовНачислений.РезультатНакопленныйЗаМесяц = Null
								ИЛИ ВыборкаРезультатовНачислений.СуммаВзносаВФФОМС = Null Тогда
							НоваяСтрокаВзносов.Результат = 0;	
						Иначе		
							Если НайденныеНачисления.Количество() > 0 Тогда
								Если НайденныеНачисления[0].Результат = 0 Тогда
									НоваяСтрокаВзносов.Результат = 0;
								Иначе	
									НоваяСтрокаВзносов.Результат = НайденныеНачисления[0].Результат / ВыборкаРезультатовНачислений.РезультатНакопленныйЗаМесяц
																		* ВыборкаРезультатовНачислений.СуммаВзносаВФФОМС;
								КонецЕсли;										
							Иначе	
								НоваяСтрокаВзносов.Результат = 0;	
							КонецЕсли;
						КонецЕсли;
						НоваяСтрокаВзносов.Сумма = НоваяСтрокаВзносов.Результат;
						
						ВзносыВФФОМССЗарплаты = ВзносыВФФОМССЗарплаты - НоваяСтрокаВзносов.Результат;
						
						//*******************************************************************************
					
						//7. Взносы в ПФР с квартальной премии (сумма в составе от общей суммы взносов в ПФР)
						НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
						НоваяСтрокаВзносов.МесяцНачисления = ВыборкаРезультатовНачислений.Период;
						НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВПФР");
						НоваяСтрокаВзносов.ВидНачисления = СтрокаНачисление; // ПредопределенноеЗначение("Справочник.ВидыНачислений.КвартальнаяПремия");  
						НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ПФР");
						
						Если СтрокаНачисление = ПредопределенноеЗначение("Справочник.ВидыНачислений.КвартальнаяПремия") Тогда
							Если Месяц(ВыборкаРезультатовНачислений.Период) = 4 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал1;
							ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 7 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал2;
							ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 10 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал3;     
							ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 1 ИЛИ Месяц(ВыборкаРезультатовНачислений.Период) = 12 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал4;
							Иначе
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.ПустаяСсылка();
							КонецЕсли;
						КонецЕсли;	
							
						Отбор = Новый Структура();
						Отбор.Вставить("ФизическоеЛицо", ВыборкаРезультатовНачислений.ФизическоеЛицо);
						Отбор.Вставить("Организация", ВыборкаРезультатовНачислений.Организация);
						Отбор.Вставить("Подразделение", ВыборкаРезультатовНачислений.Подразделение); 
						Отбор.Вставить("МестоВозникновенияЗатрат", ВыборкаРезультатовНачислений.МестоВозникновенияЗатрат);
						Отбор.Вставить("МесяцНачисления", ВыборкаРезультатовНачислений.Период);
						Отбор.Вставить("ВидНачисления", СтрокаНачисление); // Справочники.ВидыНачислений.КвартальнаяПремия);
						Отбор.Вставить("КодГрейда", ВыборкаРезультатовНачислений.КодГрейда);
						Отбор.Вставить("ПозицияШтатногоРасписания", ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания);
						НайденныеНачисления = ТаблицаНачисленийПоПериодамНачислениям.НайтиСтроки(Отбор);
						Если НайденныеНачисления.Количество() > 0 И СуммаВзносовВПФРТекущегоМесяца <> 0 Тогда
							Если НайденныеНачисления[0].Результат = 0 Тогда
								НоваяСтрокаВзносов.Результат = 0;	
							Иначе	
								НоваяСтрокаВзносов.Результат = НайденныеНачисления[0].Результат / ВыборкаРезультатовНачислений.РезультатНакопленныйЗаМесяц
																	* СуммаВзносовВПФРТекущегоМесяца;
							КонецЕсли;										
						Иначе	
							НоваяСтрокаВзносов.Результат = 0;	
						КонецЕсли;
						НоваяСтрокаВзносов.Сумма = НоваяСтрокаВзносов.Результат;
						
						ВзносыВПФРСЗарплаты = ВзносыВПФРСЗарплаты - НоваяСтрокаВзносов.Результат;
						
						//*******************************************************************************
					
						//8. Взносы в ФСС с квартальной премии (сумма в составе от общей суммы налога на травматизм)
						НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
						НоваяСтрокаВзносов.МесяцНачисления = ВыборкаРезультатовНачислений.Период;
						НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВФСС"); 
						НоваяСтрокаВзносов.ВидНачисления = СтрокаНачисление; // ПредопределенноеЗначение("Справочник.ВидыНачислений.КвартальнаяПремия");  
						НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФСС");
						
						Если СтрокаНачисление = ПредопределенноеЗначение("Справочник.ВидыНачислений.КвартальнаяПремия") Тогда
							Если Месяц(ВыборкаРезультатовНачислений.Период) = 4 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал1;
							ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 7 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал2;
							ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 10 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал3;     
							ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 1 ИЛИ Месяц(ВыборкаРезультатовНачислений.Период) = 12 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал4;
							Иначе
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.ПустаяСсылка();
							КонецЕсли;
						КонецЕсли;	
						
						Отбор = Новый Структура();
						Отбор.Вставить("ФизическоеЛицо", ВыборкаРезультатовНачислений.ФизическоеЛицо);
						Отбор.Вставить("Организация", ВыборкаРезультатовНачислений.Организация);
						Отбор.Вставить("Подразделение", ВыборкаРезультатовНачислений.Подразделение); 
						Отбор.Вставить("МестоВозникновенияЗатрат", ВыборкаРезультатовНачислений.МестоВозникновенияЗатрат);
						Отбор.Вставить("МесяцНачисления", ВыборкаРезультатовНачислений.Период);
						Отбор.Вставить("ВидНачисления", СтрокаНачисление); // Справочники.ВидыНачислений.КвартальнаяПремия);
						Отбор.Вставить("КодГрейда", ВыборкаРезультатовНачислений.КодГрейда);
						Отбор.Вставить("ПозицияШтатногоРасписания", ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания);
						НайденныеНачисления = ТаблицаНачисленийПоПериодамНачислениям.НайтиСтроки(Отбор);
						Если НайденныеНачисления.Количество() > 0 Тогда
							Если НайденныеНачисления[0].Результат = 0 Тогда
								НоваяСтрокаВзносов.Результат = 0;	
							Иначе	
								НоваяСтрокаВзносов.Результат = НайденныеНачисления[0].Результат / ВыборкаРезультатовНачислений.РезультатНакопленныйЗаМесяц 
																	* СуммаВзносовВФССТекущегоМесяца;
							КонецЕсли;										
						Иначе	
							НоваяСтрокаВзносов.Результат = 0;	
						КонецЕсли; 
						НоваяСтрокаВзносов.Сумма = НоваяСтрокаВзносов.Результат;
						
						ВзносыВФСССЗарплаты = ВзносыВФСССЗарплаты - НоваяСтрокаВзносов.Результат;
						
						//******************************************************************************* 
						
					КонецЦикла;	
					
	#КонецОбласти
	
	#Область РасчетВзносовСОстаткаФОТ
					
					
					НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
					НоваяСтрокаВзносов.МесяцНачисления = ВыборкаРезультатовНачислений.Период;
					НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыхВзносовНаТравматизм"); 
					НоваяСтрокаВзносов.ВидНачисления = ПредопределенноеЗначение("Справочник.ВидыНачислений.Зарплата");  
					НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФСС");
					НоваяСтрокаВзносов.Сумма 	 = НалогНаТравматизмСЗарплаты;
                    НоваяСтрокаВзносов.Результат = НалогНаТравматизмСЗарплаты;
						
					НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
					НоваяСтрокаВзносов.МесяцНачисления = ВыборкаРезультатовНачислений.Период;
					НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВФФОМС");
					НоваяСтрокаВзносов.ВидНачисления = ПредопределенноеЗначение("Справочник.ВидыНачислений.Зарплата");  
					НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФФОМС");
					НоваяСтрокаВзносов.Сумма 	 = ВзносыВФФОМССЗарплаты;					
					НоваяСтрокаВзносов.Результат = ВзносыВФФОМССЗарплаты;
						
					НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
					НоваяСтрокаВзносов.МесяцНачисления = ВыборкаРезультатовНачислений.Период;
					НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВПФР");
					НоваяСтрокаВзносов.ВидНачисления = ПредопределенноеЗначение("Справочник.ВидыНачислений.Зарплата");  
					НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ПФР");
					НоваяСтрокаВзносов.Сумма 	 = ВзносыВПФРСЗарплаты;
					НоваяСтрокаВзносов.Результат = ВзносыВПФРСЗарплаты;
						
					НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
					НоваяСтрокаВзносов.МесяцНачисления = ВыборкаРезультатовНачислений.Период;
					НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВФСС"); 
					НоваяСтрокаВзносов.ВидНачисления = ПредопределенноеЗначение("Справочник.ВидыНачислений.Зарплата");  
					НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФСС"); 
					НоваяСтрокаВзносов.Сумма 	 = ВзносыВФСССЗарплаты;
					НоваяСтрокаВзносов.Результат = ВзносыВФСССЗарплаты;
					
	#КонецОбласти					
	
				КонецЦикла;
				
		   КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;	
		
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗакончитьЗамерВремени(ИмяЗамера, Замер);	
	
КонецПроцедуры
	
Процедура РассчитатьВзносыБюджета()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяЗамера = "РасчетПоказателейБюджетовПрогнозов.РасчетВзносовБюджетов";
	Замер = НачатьЗамерВремени();
	
	НачисленияПремии = СписокНачисленийПремий();
	НачисленияФОТ = СписокНачисленийФОТ();
	
	Если РасчитанныеПоказатели.Начисления.Количество() > 0 Тогда 
		
		ТаблицаНачисленийПоПериодам = РасчитанныеПоказатели.Начисления.Скопировать();
		ТаблицаНачисленийПоПериодам.Свернуть("ФизическоеЛицо,МесяцНачисления,Организация,Подразделение,МестоВозникновенияЗатрат,ПозицияШтатногоРасписания,КодГрейда,ДатаНачала,ДатаОкончания", "Результат");
			
		ТаблицаНачисленийПоПериодамНачислениям = РасчитанныеПоказатели.Начисления.Скопировать();
		ТаблицаНачисленийПоПериодамНачислениям.Свернуть("ФизическоеЛицо,МесяцНачисления,ВидНачисления, Организация,Подразделение,МестоВозникновенияЗатрат,ПозицияШтатногоРасписания,КодГрейда,ДатаНачала,ДатаОкончания", "Результат");
		
		Если РасчитанныеПоказатели.Взносы.Количество() > 0 Тогда
			РасчитанныеПоказатели.Взносы.Очистить();	
		КонецЕсли;	
			
		Для Каждого МесяцЗначение Из МесяцыРасчета Цикл
			
			НастройкиДатаВыплатыБюджетирования = РасчетБюджетированияРасширенныйВызовСервера.СведенияОНастройкахБюджетированиеРасширенная(Организация, НачалоГода(МесяцЗначение), Сценарий);
			
			#Область СозданиеЗапроса
			
			Запрос = Новый Запрос();
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			
			Запрос.УстановитьПараметр("ТаблицаНачисленийПоПериодам", ТаблицаНачисленийПоПериодам);
			Запрос.УстановитьПараметр("ТаблицаНачисленийПоПериодамНачислениям", ТаблицаНачисленийПоПериодамНачислениям);
			
			//БазовыеНачисления = Новый Массив;
			//БазовыеНачисления.Добавить(Справочники.ВидыНачислений.Оклад);
			//БазовыеНачисления.Добавить(Справочники.ВидыНачислений.ДоплатаЗаФункционалОбразовательнойДеятельности);
			//БазовыеНачисления.Добавить(Справочники.ВидыНачислений.ДоплатаЗаПреподаваниеНаИнЯзыке);
			//БазовыеНачисления.Добавить(Справочники.ВидыНачислений.КвартальнаяПремия);
			//БазовыеНачисления.Добавить(Справочники.ВидыНачислений.ГодоваяПремия);
			//БазовыеНачисления.Добавить(Справочники.ВидыНачислений.РезервНаСреднийЗаработок);
			//БазовыеНачисления.Добавить(Справочники.ВидыНачислений.ЕжемесячнаяПремия);
			//БазовыеНачисления.Добавить(Справочники.ВидыНачислений.ПремияЗаПолугодие);
			
			Запрос.УстановитьПараметр("БазовыеНачисления", НачисленияФОТ);
			
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ТаблицаНачисленийПоПериодамНачислениям.ФизическоеЛицо КАК ФизическоеЛицо,
				|	ТаблицаНачисленийПоПериодамНачислениям.МесяцНачисления КАК МесяцНачисления,
				|	ТаблицаНачисленийПоПериодамНачислениям.ВидНачисления КАК ВидНачисления,
				|	ТаблицаНачисленийПоПериодамНачислениям.Организация КАК Организация,
				|	ТаблицаНачисленийПоПериодамНачислениям.Подразделение КАК Подразделение,
				|	ТаблицаНачисленийПоПериодамНачислениям.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
				|	ТаблицаНачисленийПоПериодамНачислениям.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
				|	ТаблицаНачисленийПоПериодамНачислениям.КодГрейда КАК КодГрейда,
				|	ТаблицаНачисленийПоПериодамНачислениям.ДатаНачала КАК ДатаНачала,
				|	ТаблицаНачисленийПоПериодамНачислениям.ДатаОкончания КАК ДатаОкончания,
				|	ТаблицаНачисленийПоПериодамНачислениям.Результат КАК Результат
				|ПОМЕСТИТЬ ВТТаблицаИсходная
				|ИЗ
				|	&ТаблицаНачисленийПоПериодамНачислениям КАК ТаблицаНачисленийПоПериодамНачислениям
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ВТТаблицаИсходная.ФизическоеЛицо КАК ФизическоеЛицо,
				|	ВТТаблицаИсходная.МесяцНачисления КАК МесяцНачисления,
				|	ВТТаблицаИсходная.Организация КАК Организация,
				|	ВТТаблицаИсходная.Подразделение КАК Подразделение,
				|	ВТТаблицаИсходная.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
				|	ВТТаблицаИсходная.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
				|	ВТТаблицаИсходная.КодГрейда КАК КодГрейда,
				|	ВТТаблицаИсходная.ДатаНачала КАК НачалоПериода,
				|	ВТТаблицаИсходная.ДатаОкончания КАК ОкончаниеПериода,
				|	СУММА(ВТТаблицаИсходная.Результат) КАК РезультатНакопленный
				|ПОМЕСТИТЬ ВТНакопленныеДанныеЗаМесяц
				|ИЗ
				|	ВТТаблицаИсходная КАК ВТТаблицаИсходная
				|ГДЕ
				|	ВТТаблицаИсходная.МесяцНачисления = &ДатаСреза
				|	И ВТТаблицаИсходная.ВидНачисления В(&БазовыеНачисления)
				|
				|СГРУППИРОВАТЬ ПО
				|	ВТТаблицаИсходная.ФизическоеЛицо,
				|	ВТТаблицаИсходная.МесяцНачисления,
				|	ВТТаблицаИсходная.Организация,
				|	ВТТаблицаИсходная.Подразделение,
				|	ВТТаблицаИсходная.МестоВозникновенияЗатрат,
				|	ВТТаблицаИсходная.ПозицияШтатногоРасписания,
				|	ВТТаблицаИсходная.КодГрейда,
				|	ВТТаблицаИсходная.ДатаНачала,
				|	ВТТаблицаИсходная.ДатаОкончания
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	НакопленныеДанныеЗаГод.ФизическоеЛицо КАК ФизическоеЛицо,
				|	НакопленныеДанныеЗаГод.Организация КАК Организация,
				|	НакопленныеДанныеЗаГод.Подразделение КАК Подразделение,
				|	НакопленныеДанныеЗаГод.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
				|	НакопленныеДанныеЗаГод.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
				|	НакопленныеДанныеЗаГод.КодГрейда КАК КодГрейда,
				|	НакопленныеДанныеЗаГод.ДатаНачала КАК НачалоПериода,
				|	НакопленныеДанныеЗаГод.ДатаОкончания КАК ОкончаниеПериода,
				|	НАЧАЛОПЕРИОДА(НакопленныеДанныеЗаГод.МесяцНачисления, ГОД) КАК ГодНакопления,
				|	СУММА(ВЫБОР
				|			КОГДА НакопленныеДанныеЗаГод.МесяцНачисления < &ДатаСреза
				|				ТОГДА НакопленныеДанныеЗаГод.Результат
				|			ИНАЧЕ 0
				|		КОНЕЦ) КАК РезультатНакопленныйПредыдущихМесяцев,
				|	СУММА(НакопленныеДанныеЗаГод.Результат) КАК РезультатНакопленный
				|ПОМЕСТИТЬ ВТНакопленныеДанныеЗаГод
				|ИЗ
				|	(ВЫБРАТЬ
				|		ВТТаблицаИсходная.ФизическоеЛицо КАК ФизическоеЛицо,
				|		ВТТаблицаИсходная.МесяцНачисления КАК МесяцНачисления,
				|		ВТТаблицаИсходная.Организация КАК Организация,
				|		ВТТаблицаИсходная.Подразделение КАК Подразделение,
				|		ВТТаблицаИсходная.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
				|		ВТТаблицаИсходная.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
				|		ВТТаблицаИсходная.КодГрейда КАК КодГрейда,
				|		ВТТаблицаИсходная.ДатаНачала КАК ДатаНачала,
				|		ВТТаблицаИсходная.ДатаОкончания КАК ДатаОкончания,
				|		ВТТаблицаИсходная.Результат КАК Результат
				|	ИЗ
				|		ВТТаблицаИсходная КАК ВТТаблицаИсходная
				|	ГДЕ
				|		ВТТаблицаИсходная.МесяцНачисления <= &ДатаСреза
				|		И НАЧАЛОПЕРИОДА(ВТТаблицаИсходная.МесяцНачисления, ГОД) = НАЧАЛОПЕРИОДА(&ДатаСреза, ГОД)
				|		И ВТТаблицаИсходная.ВидНачисления В(&БазовыеНачисления)) КАК НакопленныеДанныеЗаГод
				|
				|СГРУППИРОВАТЬ ПО
				|	НакопленныеДанныеЗаГод.ФизическоеЛицо,
				|	НакопленныеДанныеЗаГод.Организация,
				|	НакопленныеДанныеЗаГод.Подразделение,
				|	НакопленныеДанныеЗаГод.МестоВозникновенияЗатрат,
				|	НакопленныеДанныеЗаГод.ПозицияШтатногоРасписания,
				|	НакопленныеДанныеЗаГод.КодГрейда,
				|	НакопленныеДанныеЗаГод.ДатаНачала,
				|	НакопленныеДанныеЗаГод.ДатаОкончания,
				|	НАЧАЛОПЕРИОДА(НакопленныеДанныеЗаГод.МесяцНачисления, ГОД)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ВЫРАЗИТЬ(ТаблицаНачисленийПоПериодам.ФизическоеЛицо КАК Справочник.ФизическиеЛица) КАК ФизическоеЛицо,
				|	ТаблицаНачисленийПоПериодам.МесяцНачисления КАК Период,
				|	ТаблицаНачисленийПоПериодам.Организация КАК Организация,
				|	ТаблицаНачисленийПоПериодам.Подразделение КАК Подразделение,
				|	ТаблицаНачисленийПоПериодам.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
				|	ТаблицаНачисленийПоПериодам.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
				|	ТаблицаНачисленийПоПериодам.КодГрейда КАК КодГрейда,
				|	ТаблицаНачисленийПоПериодам.ДатаНачала КАК НачалоПериода,
				|	ТаблицаНачисленийПоПериодам.ДатаОкончания КАК ОкончаниеПериода,
				|	ТаблицаНачисленийПоПериодам.Результат КАК Результат
				|ПОМЕСТИТЬ ВТТаблицаПоПериодам
				|ИЗ
				|	&ТаблицаНачисленийПоПериодам КАК ТаблицаНачисленийПоПериодам
				|ГДЕ
				|	ТаблицаНачисленийПоПериодам.МесяцНачисления = &ДатаСреза
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ВТТаблицаПоПериодам.ФизическоеЛицо КАК ФизическоеЛицо,
				|	ВЫБОР
				|		КОГДА ВТТаблицаПоПериодам.ФизическоеЛицо ЕСТЬ NULL
				|				ИЛИ ВТТаблицаПоПериодам.ФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
				|			ТОГДА ЛОЖЬ
				|		ИНАЧЕ ВТТаблицаПоПериодам.ФизическоеЛицо.РезидентРФ
				|	КОНЕЦ КАК РезидентРФ,
				|	ВЫБОР
				|		КОГДА ВТТаблицаПоПериодам.ФизическоеЛицо ЕСТЬ NULL
				|				ИЛИ ВТТаблицаПоПериодам.ФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
				|			ТОГДА ЛОЖЬ
				|		ИНАЧЕ ВЫБОР
				|				КОГДА НЕ ВТТаблицаПоПериодам.ФизическоеЛицо.Гражданство ЕСТЬ NULL
				|						И НЕ ВТТаблицаПоПериодам.ФизическоеЛицо.Гражданство = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
				|						И ВТТаблицаПоПериодам.ФизическоеЛицо.Гражданство = &Белоруссия
				|					ТОГДА ИСТИНА
				|				ИНАЧЕ ЛОЖЬ
				|			КОНЕЦ
				|	КОНЕЦ КАК ЭтоБелоруссия,
				|	ВТТаблицаПоПериодам.Период КАК Период,
				|	ВТТаблицаПоПериодам.Организация КАК Организация,
				|	ВТТаблицаПоПериодам.Подразделение КАК Подразделение,
				|	ВТТаблицаПоПериодам.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
				|	ВТТаблицаПоПериодам.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
				|	ВТТаблицаПоПериодам.КодГрейда КАК КодГрейда,
				|	ВТТаблицаПоПериодам.НачалоПериода КАК НачалоПериода,
				|	ВТТаблицаПоПериодам.ОкончаниеПериода КАК ОкончаниеПериода,
				|	ВТТаблицаПоПериодам.Результат КАК Результат,
				|	ВТНакопленныеДанныеЗаГод.РезультатНакопленныйПредыдущихМесяцев КАК РезультатНакопленныйПредыдущихМесяцев,
				|	ВТНакопленныеДанныеЗаГод.РезультатНакопленный КАК РезультатНакопленныйЗаГод,
				|	ВТНакопленныеДанныеЗаМесяц.РезультатНакопленный КАК РезультатНакопленныйЗаМесяц
				|ПОМЕСТИТЬ ВТТаблицаНачисленийПоПериодам
				|ИЗ
				|	ВТТаблицаПоПериодам КАК ВТТаблицаПоПериодам
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНакопленныеДанныеЗаГод КАК ВТНакопленныеДанныеЗаГод
				|		ПО ВТТаблицаПоПериодам.ФизическоеЛицо = ВТНакопленныеДанныеЗаГод.ФизическоеЛицо
				|			И ВТТаблицаПоПериодам.Организация = ВТНакопленныеДанныеЗаГод.Организация
				|			И ВТТаблицаПоПериодам.Подразделение = ВТНакопленныеДанныеЗаГод.Подразделение
				|			И ВТТаблицаПоПериодам.МестоВозникновенияЗатрат = ВТНакопленныеДанныеЗаГод.МестоВозникновенияЗатрат
				|			И ВТТаблицаПоПериодам.ПозицияШтатногоРасписания = ВТНакопленныеДанныеЗаГод.ПозицияШтатногоРасписания
				|			И ВТТаблицаПоПериодам.КодГрейда = ВТНакопленныеДанныеЗаГод.КодГрейда
				|			И (НАЧАЛОПЕРИОДА(ВТТаблицаПоПериодам.Период, ГОД) = ВТНакопленныеДанныеЗаГод.ГодНакопления)
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНакопленныеДанныеЗаМесяц КАК ВТНакопленныеДанныеЗаМесяц
				|		ПО ВТТаблицаПоПериодам.ФизическоеЛицо = ВТНакопленныеДанныеЗаМесяц.ФизическоеЛицо
				|			И ВТТаблицаПоПериодам.Организация = ВТНакопленныеДанныеЗаМесяц.Организация
				|			И ВТТаблицаПоПериодам.Подразделение = ВТНакопленныеДанныеЗаМесяц.Подразделение
				|			И ВТТаблицаПоПериодам.МестоВозникновенияЗатрат = ВТНакопленныеДанныеЗаМесяц.МестоВозникновенияЗатрат
				|			И ВТТаблицаПоПериодам.ПозицияШтатногоРасписания = ВТНакопленныеДанныеЗаМесяц.ПозицияШтатногоРасписания
				|			И ВТТаблицаПоПериодам.КодГрейда = ВТНакопленныеДанныеЗаМесяц.КодГрейда
				|			И ВТТаблицаПоПериодам.Период = ВТНакопленныеДанныеЗаМесяц.МесяцНачисления";
			
			Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(МесяцЗначение)); 
			Запрос.УстановитьПараметр("Белоруссия", Справочники.СтраныМира.НайтиПоКоду("112")); 
			Запрос.Выполнить(); 
			
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			               |	КоэффициентыПремийТекущегоГода.Период КАК Период,
			               |	МАКСИМУМ(КоэффициентыПремийТекущегоГода.КоэффициентСтраховыхВзносовНаТравматизмТекущегоГода) КАК КоэффициентСтраховыхВзносовНаТравматизмТекущегоГода,
			               |	МАКСИМУМ(КоэффициентыПремийТекущегоГода.КоэффициентСтраховыхВзносовВФФОМСТекущегоГода) КАК КоэффициентСтраховыхВзносовВФФОМСТекущегоГода
			               |ПОМЕСТИТЬ ВТКоэффициентыПремийТекущегоГода
			               |ИЗ
			               |	(ВЫБРАТЬ
			               |		&ДатаСреза КАК Период,
			               |		ВЫБОР
			               |			КОГДА КоэффициентыНачисленийСрезПоследних.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.СтраховыхВзносовНаТравматизм)
			               |					И (КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.ПустаяСсылка)
			               |						ИЛИ КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.Год))
			               |				ТОГДА КоэффициентыНачисленийСрезПоследних.Коэффициент
			               |			ИНАЧЕ 0
			               |		КОНЕЦ КАК КоэффициентСтраховыхВзносовНаТравматизмТекущегоГода,
			               |		ВЫБОР
			               |			КОГДА КоэффициентыНачисленийСрезПоследних.ВидНачисления = ЗНАЧЕНИЕ(Справочник.ВидыНачислений.СтраховыеВзносыВФФОМС)
			               |					И (КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.ПустаяСсылка)
			               |						ИЛИ КоэффициентыНачисленийСрезПоследних.ПериодДействия = ЗНАЧЕНИЕ(Перечисление.ПериодыХраненияЗначений.Год))
			               |				ТОГДА КоэффициентыНачисленийСрезПоследних.Коэффициент
			               |			ИНАЧЕ 0
			               |		КОНЕЦ КАК КоэффициентСтраховыхВзносовВФФОМСТекущегоГода
			               |	ИЗ
			               |		РегистрСведений.КоэффициентыНачислений.СрезПоследних(&ДатаНачалаГода, Сценарий = &Сценарий) КАК КоэффициентыНачисленийСрезПоследних
			               |	
			               |	ОБЪЕДИНИТЬ ВСЕ
			               |	
			               |	ВЫБРАТЬ
			               |		&ДатаСреза,
			               |		0,
			               |		0
			               |	ИЗ
			               |		Справочник.Сценарии КАК Сценарий
			               |	ГДЕ
			               |		Сценарий.Ссылка = &Сценарий) КАК КоэффициентыПремийТекущегоГода
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	КоэффициентыПремийТекущегоГода.Период";
			
			Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(МесяцЗначение));
			Запрос.УстановитьПараметр("ДатаНачалаГода", НачалоГода(МесяцЗначение));
			Запрос.УстановитьПараметр("Сценарий",  Сценарий);
			Запрос.Выполнить();
			
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	СтавкиНалогов.Период КАК Период,
			               |	МАКСИМУМ(СтавкиНалогов.СтавкаНалогаПФР) КАК СтавкаНалогаПФР,
			               |	МАКСИМУМ(СтавкиНалогов.ГраницаНалогаПФР) КАК ГраницаНалогаПФР,
			               |	МАКСИМУМ(СтавкиНалогов.СтавкаНалогаПослеГраницыПФР) КАК СтавкаНалогаПослеГраницыПФР,
			               |	МАКСИМУМ(СтавкиНалогов.СтавкаНалогаПрочееПФР) КАК СтавкаНалогаПрочееПФР,
			               |	МАКСИМУМ(СтавкиНалогов.СтавкаНалогаКорректировкаПФР) КАК СтавкаНалогаКорректировкаПФР,
			               |	МАКСИМУМ(СтавкиНалогов.СтавкаНалогаФСС) КАК СтавкаНалогаФСС,
			               |	МАКСИМУМ(СтавкиНалогов.ГраницаНалогаФСС) КАК ГраницаНалогаФСС,
			               |	МАКСИМУМ(СтавкиНалогов.СтавкаНалогаПослеГраницыФСС) КАК СтавкаНалогаПослеГраницыФСС,
			               |	МАКСИМУМ(СтавкиНалогов.СтавкаНалогаПрочееФСС) КАК СтавкаНалогаПрочееФСС,
			               |	МАКСИМУМ(СтавкиНалогов.СтавкаНалогаКорректировкаФСС) КАК СтавкаНалогаКорректировкаФСС
			               |ПОМЕСТИТЬ ВТСтавкиНалогов
			               |ИЗ
			               |	(ВЫБРАТЬ
			               |		&ДатаСреза КАК Период,
			               |		ВЫБОР
			               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ПФР)
			               |				ТОГДА СтавкиНалоговСрезПоследних.СтавкаНалога
			               |			ИНАЧЕ 0
			               |		КОНЕЦ КАК СтавкаНалогаПФР,
			               |		ВЫБОР
			               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ПФР)
			               |				ТОГДА СтавкиНалоговСрезПоследних.ГраницаНалога
			               |			ИНАЧЕ 0
			               |		КОНЕЦ КАК ГраницаНалогаПФР,
			               |		ВЫБОР
			               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ПФР)
			               |				ТОГДА СтавкиНалоговСрезПоследних.СтавкаНалогаПослеГраницы
			               |			ИНАЧЕ 0
			               |		КОНЕЦ КАК СтавкаНалогаПослеГраницыПФР,
			               |		ВЫБОР
			               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ПФР)
			               |				ТОГДА СтавкиНалоговСрезПоследних.СтавкаНалогаПрочее
			               |			ИНАЧЕ 0
			               |		КОНЕЦ КАК СтавкаНалогаПрочееПФР,
			               |		ВЫБОР
			               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ПФР)
			               |				ТОГДА СтавкиНалоговСрезПоследних.СтавкаНалогаКорректировка
			               |			ИНАЧЕ 0
			               |		КОНЕЦ КАК СтавкаНалогаКорректировкаПФР,
			               |		ВЫБОР
			               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ФСС)
			               |				ТОГДА СтавкиНалоговСрезПоследних.СтавкаНалога
			               |			ИНАЧЕ 0
			               |		КОНЕЦ КАК СтавкаНалогаФСС,
			               |		ВЫБОР
			               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ФСС)
			               |				ТОГДА СтавкиНалоговСрезПоследних.ГраницаНалога
			               |			ИНАЧЕ 0
			               |		КОНЕЦ КАК ГраницаНалогаФСС,
			               |		ВЫБОР
			               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ФСС)
			               |				ТОГДА СтавкиНалоговСрезПоследних.СтавкаНалогаПослеГраницы
			               |			ИНАЧЕ 0
			               |		КОНЕЦ КАК СтавкаНалогаПослеГраницыФСС,
			               |		ВЫБОР
			               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ФСС)
			               |				ТОГДА СтавкиНалоговСрезПоследних.СтавкаНалогаПрочее
			               |			ИНАЧЕ 0
			               |		КОНЕЦ КАК СтавкаНалогаПрочееФСС,
			               |		ВЫБОР
			               |			КОГДА СтавкиНалоговСрезПоследних.ВидВнебюджетногоФонда = ЗНАЧЕНИЕ(Справочник.ВидыВнебюджетныхФондов.ФСС)
			               |				ТОГДА СтавкиНалоговСрезПоследних.СтавкаНалогаКорректировка
			               |			ИНАЧЕ 0
			               |		КОНЕЦ КАК СтавкаНалогаКорректировкаФСС
			               |	ИЗ
			               |		РегистрСведений.СтавкиНалогов.СрезПоследних(&ДатаСреза, Сценарий = &Сценарий) КАК СтавкиНалоговСрезПоследних
			               |	
			               |	ОБЪЕДИНИТЬ ВСЕ
			               |	
			               |	ВЫБРАТЬ
			               |		&ДатаСреза,
			               |		0,
			               |		0,
			               |		0,
			               |		0,
			               |		0,
			               |		0,
			               |		0,
			               |		0,
			               |		0,
			               |		0
			               |	ИЗ
			               |		Справочник.Сценарии КАК Сценарий
			               |	ГДЕ
			               |		Сценарий.Ссылка = &Сценарий) КАК СтавкиНалогов
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	СтавкиНалогов.Период";
			
			Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(МесяцЗначение));
			Запрос.УстановитьПараметр("Сценарий",  Сценарий);
			Запрос.Выполнить();
			
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ВТТаблицаНачисленийПоПериодам.ФизическоеЛицо КАК ФизическоеЛицо,
				|	ВТТаблицаНачисленийПоПериодам.Период КАК Период,
				|	ВТТаблицаНачисленийПоПериодам.Организация КАК Организация,
				|	ВТТаблицаНачисленийПоПериодам.Подразделение КАК Подразделение,
				|	ВТТаблицаНачисленийПоПериодам.МестоВозникновенияЗатрат КАК МестоВозникновенияЗатрат,
				|	ВТТаблицаНачисленийПоПериодам.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
				|	ВТТаблицаНачисленийПоПериодам.КодГрейда КАК КодГрейда,
				|	ВТТаблицаНачисленийПоПериодам.НачалоПериода КАК НачалоПериода,
				|	ВТТаблицаНачисленийПоПериодам.ОкончаниеПериода КАК ОкончаниеПериода,
				|	ВТТаблицаНачисленийПоПериодам.Результат КАК Результат,
				|	ВТТаблицаНачисленийПоПериодам.РезультатНакопленныйПредыдущихМесяцев КАК РезультатНакопленныйЗаПредыдущиеМесяцы,
				|	ВТТаблицаНачисленийПоПериодам.РезультатНакопленныйЗаМесяц КАК РезультатНакопленныйЗаМесяц,
				|	ВТТаблицаНачисленийПоПериодам.РезультатНакопленныйЗаГод КАК РезультатНакопленныйЗаГод,
				|	ВТКоэффициентыПремийТекущегоГода.КоэффициентСтраховыхВзносовНаТравматизмТекущегоГода КАК КоэффициентСтраховыхВзносовНаТравматизмТекущегоГода,
				|	ВТКоэффициентыПремийТекущегоГода.КоэффициентСтраховыхВзносовВФФОМСТекущегоГода КАК КоэффициентСтраховыхВзносовВФФОМСТекущегоГода,
				|	ВЫБОР
				|		КОГДА ВТСтавкиНалогов.СтавкаНалогаПФР ЕСТЬ NULL
				|			ТОГДА 0
				|		ИНАЧЕ ВТСтавкиНалогов.СтавкаНалогаПФР
				|	КОНЕЦ КАК СтавкаНалогаПФР,
				|	ВТСтавкиНалогов.ГраницаНалогаПФР КАК ГраницаНалогаПФР,
				|	ВТСтавкиНалогов.СтавкаНалогаПослеГраницыПФР КАК СтавкаНалогаПослеГраницыПФР,
				|	ВЫБОР
				|		КОГДА НЕ ВТКоэффициентыПремийТекущегоГода.КоэффициентСтраховыхВзносовНаТравматизмТекущегоГода ЕСТЬ NULL
				|				И НЕ ВТТаблицаНачисленийПоПериодам.Результат ЕСТЬ NULL
				|			ТОГДА ВТТаблицаНачисленийПоПериодам.РезультатНакопленныйЗаМесяц * ВТКоэффициентыПремийТекущегоГода.КоэффициентСтраховыхВзносовНаТравматизмТекущегоГода / 100
				|		ИНАЧЕ 0
				|	КОНЕЦ КАК СуммаНалогаНаТравматизм,
				|	ВЫБОР
				|		КОГДА ВТТаблицаНачисленийПоПериодам.РезидентРФ = ЛОЖЬ
				|				И ВТТаблицаНачисленийПоПериодам.ЭтоБелоруссия = ЛОЖЬ
				|			ТОГДА 0
				|		ИНАЧЕ ВТТаблицаНачисленийПоПериодам.РезультатНакопленныйЗаМесяц * ВТКоэффициентыПремийТекущегоГода.КоэффициентСтраховыхВзносовВФФОМСТекущегоГода / 100
				|	КОНЕЦ КАК СуммаВзносаВФФОМС,
				|	ВЫБОР
				|		КОГДА ВТТаблицаНачисленийПоПериодам.РезультатНакопленныйЗаГод < ВТСтавкиНалогов.ГраницаНалогаПФР
				|			ТОГДА ВЫБОР
				|					КОГДА ВТТаблицаНачисленийПоПериодам.РезидентРФ = ЛОЖЬ
				|							И ВТТаблицаНачисленийПоПериодам.ЭтоБелоруссия = ЛОЖЬ
				|						ТОГДА 0
				|					ИНАЧЕ ВТТаблицаНачисленийПоПериодам.РезультатНакопленныйЗаГод * ВТСтавкиНалогов.СтавкаНалогаПФР / 100
				|				КОНЕЦ
				|		ИНАЧЕ ВЫБОР
				|				КОГДА ВТТаблицаНачисленийПоПериодам.РезидентРФ = ЛОЖЬ
				|						И ВТТаблицаНачисленийПоПериодам.ЭтоБелоруссия = ЛОЖЬ
				|					ТОГДА 0
				|				ИНАЧЕ ВТСтавкиНалогов.ГраницаНалогаПФР * ВТСтавкиНалогов.СтавкаНалогаПФР / 100 + (ВТТаблицаНачисленийПоПериодам.РезультатНакопленныйЗаГод - ВТСтавкиНалогов.ГраницаНалогаПФР) * ВТСтавкиНалогов.СтавкаНалогаПослеГраницыПФР / 100
				|			КОНЕЦ
				|	КОНЕЦ КАК СуммаВзносаВПФР,
				|	ВЫБОР
				|		КОГДА ВТТаблицаНачисленийПоПериодам.РезультатНакопленныйЗаГод < ВТСтавкиНалогов.ГраницаНалогаФСС
				|			ТОГДА ВЫБОР
				|					КОГДА ВТТаблицаНачисленийПоПериодам.РезидентРФ = ЛОЖЬ
				|							И ВТТаблицаНачисленийПоПериодам.ЭтоБелоруссия = ЛОЖЬ
				|						ТОГДА 0
				|					ИНАЧЕ ВТТаблицаНачисленийПоПериодам.РезультатНакопленныйЗаГод * ВТСтавкиНалогов.СтавкаНалогаФСС / 100
				|				КОНЕЦ
				|		ИНАЧЕ ВЫБОР
				|				КОГДА ВТТаблицаНачисленийПоПериодам.РезидентРФ = ЛОЖЬ
				|						И ВТТаблицаНачисленийПоПериодам.ЭтоБелоруссия = ЛОЖЬ
				|					ТОГДА 0
				|				ИНАЧЕ ВТСтавкиНалогов.ГраницаНалогаФСС * ВТСтавкиНалогов.СтавкаНалогаФСС / 100 + (ВТТаблицаНачисленийПоПериодам.РезультатНакопленныйЗаГод - ВТСтавкиНалогов.ГраницаНалогаФСС) * ВТСтавкиНалогов.СтавкаНалогаПослеГраницыФСС / 100
				|			КОНЕЦ
				|	КОНЕЦ КАК СуммаВзносаВФСС
				|ИЗ
				|	ВТТаблицаНачисленийПоПериодам КАК ВТТаблицаНачисленийПоПериодам
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыПремийТекущегоГода КАК ВТКоэффициентыПремийТекущегоГода
				|		ПО ВТТаблицаНачисленийПоПериодам.Период = ВТКоэффициентыПремийТекущегоГода.Период
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиНалогов КАК ВТСтавкиНалогов
				|		ПО ВТТаблицаНачисленийПоПериодам.Период = ВТСтавкиНалогов.Период";
			
			РезультатНачислений = Запрос.Выполнить();
			
			УдаляемыеВТТаблицы = Новый Массив;
			УдаляемыеВТТаблицы.Добавить("ВТТаблицаИсходная");
			УдаляемыеВТТаблицы.Добавить("ВТНакопленныеДанныеЗаМесяц");
			УдаляемыеВТТаблицы.Добавить("ВТНакопленныеДанныеЗаГод");
			УдаляемыеВТТаблицы.Добавить("ВТТаблицаПоПериодам");
			УдаляемыеВТТаблицы.Добавить("ВТТаблицаНачисленийПоПериодам");
			УдаляемыеВТТаблицы.Добавить("ВТКоэффициентыПремийТекущегоГода");
			УдаляемыеВТТаблицы.Добавить("ВТСтавкиНалогов");
			
			Бюджетирование.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдаляемыеВТТаблицы); 
			
	#КонецОбласти 			
			
			Если Не РезультатНачислений.Пустой() Тогда 
				
				ВыборкаРезультатовНачислений = РезультатНачислений.Выбрать();
				Пока ВыборкаРезультатовНачислений.Следующий() Цикл
					
	#Область ОсновныеНачисленияНалогов
	
					НалогНаТравматизмСЗарплаты = 0;
					ВзносыВФФОМССЗарплаты = 0;
					ВзносыВПФРСЗарплаты = 0;
					ВзносыВФСССЗарплаты = 0;
	
					//1. Налог на травматизм
					НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений); 
					НоваяСтрокаВзносов.МесяцНачисления = ВыборкаРезультатовНачислений.Период;
					НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыхВзносовНаТравматизм");  
					НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФСС");
					НоваяСтрокаВзносов.Сумма 	 = ВыборкаРезультатовНачислений.СуммаНалогаНаТравматизм;	
					НоваяСтрокаВзносов.Результат = ВыборкаРезультатовНачислений.СуммаНалогаНаТравматизм;
					
					НалогНаТравматизмСЗарплаты = ВыборкаРезультатовНачислений.СуммаНалогаНаТравматизм;
					
					//2. Взносы в ФФОМС
					НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
					НоваяСтрокаВзносов.МесяцНачисления = ВыборкаРезультатовНачислений.Период;
					НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВФФОМС");  
					НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФФОМС");
					НоваяСтрокаВзносов.Результат = ?(ВыборкаРезультатовНачислений.СуммаВзносаВФФОМС=Null, 0, ВыборкаРезультатовНачислений.СуммаВзносаВФФОМС); 
					НоваяСтрокаВзносов.Сумма 	 = НоваяСтрокаВзносов.Результат;
					
					ВзносыВФФОМССЗарплаты = ?(ВыборкаРезультатовНачислений.СуммаВзносаВФФОМС=Null, 0, ВыборкаРезультатовНачислений.СуммаВзносаВФФОМС);
					
					//3. Взносы в ПФР **************************************************************
					
					Отбор = Новый Структура();
					Отбор.Вставить("ФизическоеЛицо", 			ВыборкаРезультатовНачислений.ФизическоеЛицо);
					Отбор.Вставить("ТипНалога", 				ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВПФР"));
					Отбор.Вставить("ВидВнебюджетногоФонда", 	ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ПФР"));
					Отбор.Вставить("ВидНачисления", 			Справочники.ВидыНачислений.ПустаяСсылка());
					Отбор.Вставить("Подразделение", 			ВыборкаРезультатовНачислений.Подразделение);
					Отбор.Вставить("МестоВозникновенияЗатрат", 	ВыборкаРезультатовНачислений.МестоВозникновенияЗатрат); 
					Отбор.Вставить("КодГрейда", 				ВыборкаРезультатовНачислений.КодГрейда);
					Отбор.Вставить("ПериодДействия", 			Перечисления.ПериодыХраненияЗначений.ПустаяСсылка()); 
					
					СуммаВзносовВПФРПредыдущихМесяцев = 0;
					СуммаВзносовВПФРТекущегоМесяца    = 0;
					
					Если РасчитанныеПоказатели.Взносы.Количество() > 0 Тогда
						НайденныеСтроки = РасчитанныеПоказатели.Взносы.НайтиСтроки(Отбор);
						Для i = 0 по НайденныеСтроки.ВГраница() Цикл
							Если Год(НайденныеСтроки[i].МесяцНачисления) = Год(ВыборкаРезультатовНачислений.Период) Тогда
						    	СуммаВзносовВПФРПредыдущихМесяцев = СуммаВзносовВПФРПредыдущихМесяцев + НайденныеСтроки[i].Результат;
							КонецЕсли;	
						КонецЦикла;
					КонецЕсли;
					
					НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
					НоваяСтрокаВзносов.МесяцНачисления = ВыборкаРезультатовНачислений.Период;
					НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВПФР");  
					НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ПФР"); 
					
					Если ВыборкаРезультатовНачислений.СуммаВзносаВПФР = Null Тогда
						СуммаВзносовВПФРТекущегоМесяца = 0 - СуммаВзносовВПФРПредыдущихМесяцев;	
					Иначе	
						СуммаВзносовВПФРТекущегоМесяца = ВыборкаРезультатовНачислений.СуммаВзносаВПФР - СуммаВзносовВПФРПредыдущихМесяцев;
					КонецЕсли;
					
					НоваяСтрокаВзносов.Сумма 	 = СуммаВзносовВПФРТекущегоМесяца;
					НоваяСтрокаВзносов.Результат = СуммаВзносовВПФРТекущегоМесяца;
					
					ВзносыВПФРСЗарплаты = СуммаВзносовВПФРТекущегоМесяца;
					
					//НоваяСтрокаНалога = ТаблицаНалогов.Добавить();
					//НоваяСтрокаНалога.ГодНачисления = НачалоГода(ВыборкаРезультатовНачислений.Период); 
					//НоваяСтрокаНалога.Период = ВыборкаРезультатовНачислений.Период; 
					//НоваяСтрокаНалога.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВПФР");
					//НоваяСтрокаНалога.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ПФР");
					//НоваяСтрокаНалога.Сумма = СуммаВзносовВПФРТекущегоМесяца;
					
					//*******************************************************************************
					
					//4. Взносы в ФСС  
					
					Отбор = Новый Структура();
					Отбор.Вставить("ФизическоеЛицо", 			ВыборкаРезультатовНачислений.ФизическоеЛицо);
					Отбор.Вставить("ТипНалога", 				ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВФСС"));
					Отбор.Вставить("ВидВнебюджетногоФонда", 	ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФСС"));
					Отбор.Вставить("ВидНачисления", 			Справочники.ВидыНачислений.ПустаяСсылка());
					Отбор.Вставить("Подразделение", 			ВыборкаРезультатовНачислений.Подразделение);
					Отбор.Вставить("МестоВозникновенияЗатрат", 	ВыборкаРезультатовНачислений.МестоВозникновенияЗатрат); 
					Отбор.Вставить("КодГрейда", 				ВыборкаРезультатовНачислений.КодГрейда);
					Отбор.Вставить("ПериодДействия", 			Перечисления.ПериодыХраненияЗначений.ПустаяСсылка()); 
					
					СуммаВзносовВФССПредыдущихМесяцев = 0;
					СуммаВзносовВФССТекущегоМесяца    = 0;
					
					Если РасчитанныеПоказатели.Взносы.Количество() > 0 Тогда
						НайденныеСтроки = РасчитанныеПоказатели.Взносы.НайтиСтроки(Отбор);
						Для i = 0 по НайденныеСтроки.ВГраница() Цикл
							Если Год(НайденныеСтроки[i].МесяцНачисления) = Год(ВыборкаРезультатовНачислений.Период) Тогда
						    	СуммаВзносовВФССПредыдущихМесяцев = СуммаВзносовВФССПредыдущихМесяцев + НайденныеСтроки[i].Сумма;
							КонецЕсли;	
						КонецЦикла;
					КонецЕсли;
					
					НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
					НоваяСтрокаВзносов.МесяцНачисления = ВыборкаРезультатовНачислений.Период;
					НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВФСС");  
					НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФСС"); 
					
					Если ВыборкаРезультатовНачислений.СуммаВзносаВФСС = Null Тогда
						СуммаВзносовВФССТекущегоМесяца = 0 - СуммаВзносовВФССПредыдущихМесяцев;
					Иначе	
						СуммаВзносовВФССТекущегоМесяца = ВыборкаРезультатовНачислений.СуммаВзносаВФСС - СуммаВзносовВФССПредыдущихМесяцев;
					КонецЕсли;                                                     
					
					НоваяСтрокаВзносов.Сумма 	 = СуммаВзносовВФССТекущегоМесяца;
					НоваяСтрокаВзносов.Результат = СуммаВзносовВФССТекущегоМесяца;
					
					ВзносыВФСССЗарплаты = СуммаВзносовВФССТекущегоМесяца;
					
					//НоваяСтрокаНалога = ТаблицаНалогов.Добавить();
					//НоваяСтрокаНалога.ГодНачисления = НачалоГода(ВыборкаРезультатовНачислений.Период);   
					//НоваяСтрокаНалога.Период = ВыборкаРезультатовНачислений.Период;
					//НоваяСтрокаНалога.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВФСС");
					//НоваяСтрокаНалога.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФСС");
					//НоваяСтрокаНалога.Сумма = СуммаВзносовВФССТекущегоМесяца;
					
					//***************************************************************************************************
					
	#КонецОбласти
	
	#Область РасчетВзносовСПремий
	
					//НалогНаТравматизмСЗарплаты = 0;
					//ВзносыВФФОМССЗарплаты = 0;
					//ВзносыВПФРСЗарплаты = 0;
					//ВзносыВФСССЗарплаты = 0;
					
	                Для Каждого СтрокаНачисление Из НачисленияПремии Цикл
					
						// По видам премий				
						//5. Налог на травматизм с квартальной премии (сумма в составе от общей суммы налога на травматизм)
						НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
						НоваяСтрокаВзносов.МесяцНачисления = ВыборкаРезультатовНачислений.Период;
						НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыхВзносовНаТравматизм"); 
						НоваяСтрокаВзносов.ВидНачисления = СтрокаНачисление; // ПредопределенноеЗначение("Справочник.ВидыНачислений.КвартальнаяПремия");  
						НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФСС");
						
						Если СтрокаНачисление = ПредопределенноеЗначение("Справочник.ВидыНачислений.КвартальнаяПремия") Тогда
							Если Месяц(ВыборкаРезультатовНачислений.Период) = 4 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал1;
							ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 7 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал2;
							ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 10 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал3;     
							ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 1 ИЛИ Месяц(ВыборкаРезультатовНачислений.Период) = 12 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал4;
							Иначе
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.ПустаяСсылка();
							КонецЕсли;  
						КонецЕсли;	
							
						Отбор = Новый Структура();
						Отбор.Вставить("ФизическоеЛицо", ВыборкаРезультатовНачислений.ФизическоеЛицо);
						Отбор.Вставить("Организация", ВыборкаРезультатовНачислений.Организация);
						Отбор.Вставить("Подразделение", ВыборкаРезультатовНачислений.Подразделение);
						Отбор.Вставить("МестоВозникновенияЗатрат", ВыборкаРезультатовНачислений.МестоВозникновенияЗатрат);
						Отбор.Вставить("МесяцНачисления", ВыборкаРезультатовНачислений.Период);
						Отбор.Вставить("ВидНачисления", СтрокаНачисление); // Справочники.ВидыНачислений.КвартальнаяПремия);
						Отбор.Вставить("КодГрейда", ВыборкаРезультатовНачислений.КодГрейда);
						Отбор.Вставить("ПозицияШтатногоРасписания", ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания);
						НайденныеНачисления = ТаблицаНачисленийПоПериодамНачислениям.НайтиСтроки(Отбор);
						Если НайденныеНачисления.Количество() > 0 Тогда 
							Если НайденныеНачисления[0].Результат = 0 Тогда
								НоваяСтрокаВзносов.Результат = 0;
							Иначе	
								НоваяСтрокаВзносов.Результат = НайденныеНачисления[0].Результат / ВыборкаРезультатовНачислений.РезультатНакопленныйЗаМесяц 
																	* ВыборкаРезультатовНачислений.СуммаНалогаНаТравматизм;
							КонецЕсли;										
						Иначе	
							НоваяСтрокаВзносов.Результат = 0;	
						КонецЕсли;
						НоваяСтрокаВзносов.Сумма = НоваяСтрокаВзносов.Результат;
						
						НалогНаТравматизмСЗарплаты = НалогНаТравматизмСЗарплаты - НоваяСтрокаВзносов.Результат;
						
						//*******************************************************************************
					
						//6. Взносы в ФФОМС с квартальной премии (сумма в составе от общей суммы взносов в ФФОМС)
						НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
						НоваяСтрокаВзносов.МесяцНачисления = ВыборкаРезультатовНачислений.Период;
						НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВФФОМС");
						НоваяСтрокаВзносов.ВидНачисления = СтрокаНачисление; // ПредопределенноеЗначение("Справочник.ВидыНачислений.КвартальнаяПремия");  
						НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФФОМС");
						
						Если СтрокаНачисление = ПредопределенноеЗначение("Справочник.ВидыНачислений.КвартальнаяПремия") Тогда
							Если Месяц(ВыборкаРезультатовНачислений.Период) = 4 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал1;
							ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 7 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал2;
							ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 10 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал3;     
							ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 1 ИЛИ Месяц(ВыборкаРезультатовНачислений.Период) = 12 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал4;
							Иначе
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.ПустаяСсылка();
							КонецЕсли;
						КонецЕсли;	
						
						Отбор = Новый Структура();
						Отбор.Вставить("ФизическоеЛицо", ВыборкаРезультатовНачислений.ФизическоеЛицо);
						Отбор.Вставить("Организация", ВыборкаРезультатовНачислений.Организация);
						Отбор.Вставить("Подразделение", ВыборкаРезультатовНачислений.Подразделение); 
						Отбор.Вставить("МестоВозникновенияЗатрат", ВыборкаРезультатовНачислений.МестоВозникновенияЗатрат);
						Отбор.Вставить("МесяцНачисления", ВыборкаРезультатовНачислений.Период);
						Отбор.Вставить("ВидНачисления", СтрокаНачисление); // Справочники.ВидыНачислений.КвартальнаяПремия);
						Отбор.Вставить("КодГрейда", ВыборкаРезультатовНачислений.КодГрейда);
						Отбор.Вставить("ПозицияШтатногоРасписания", ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания);
						НайденныеНачисления = ТаблицаНачисленийПоПериодамНачислениям.НайтиСтроки(Отбор);
						Если ВыборкаРезультатовНачислений.РезультатНакопленныйЗаМесяц = Null
								ИЛИ ВыборкаРезультатовНачислений.СуммаВзносаВФФОМС = Null Тогда
							НоваяСтрокаВзносов.Результат = 0;	
						Иначе		
							Если НайденныеНачисления.Количество() > 0 Тогда
								Если НайденныеНачисления[0].Результат = 0 Тогда
									НоваяСтрокаВзносов.Результат = 0;
								Иначе	
									НоваяСтрокаВзносов.Результат = НайденныеНачисления[0].Результат / ВыборкаРезультатовНачислений.РезультатНакопленныйЗаМесяц
																		* ВыборкаРезультатовНачислений.СуммаВзносаВФФОМС;
								КонецЕсли;										
							Иначе	
								НоваяСтрокаВзносов.Результат = 0;	
							КонецЕсли;
						КонецЕсли;
						НоваяСтрокаВзносов.Сумма = НоваяСтрокаВзносов.Результат;
						
						ВзносыВФФОМССЗарплаты = ВзносыВФФОМССЗарплаты - НоваяСтрокаВзносов.Результат;
						
						//*******************************************************************************
					
						//7. Взносы в ПФР с квартальной премии (сумма в составе от общей суммы взносов в ПФР)
						НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
						НоваяСтрокаВзносов.МесяцНачисления = ВыборкаРезультатовНачислений.Период;
						НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВПФР");
						НоваяСтрокаВзносов.ВидНачисления = СтрокаНачисление; // ПредопределенноеЗначение("Справочник.ВидыНачислений.КвартальнаяПремия");  
						НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ПФР");
						
						Если СтрокаНачисление = ПредопределенноеЗначение("Справочник.ВидыНачислений.КвартальнаяПремия") Тогда
							Если Месяц(ВыборкаРезультатовНачислений.Период) = 4 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал1;
							ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 7 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал2;
							ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 10 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал3;     
							ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 1 ИЛИ Месяц(ВыборкаРезультатовНачислений.Период) = 12 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал4;
							Иначе
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.ПустаяСсылка();
							КонецЕсли;
						КонецЕсли;	
							
						Отбор = Новый Структура();
						Отбор.Вставить("ФизическоеЛицо", ВыборкаРезультатовНачислений.ФизическоеЛицо);
						Отбор.Вставить("Организация", ВыборкаРезультатовНачислений.Организация);
						Отбор.Вставить("Подразделение", ВыборкаРезультатовНачислений.Подразделение); 
						Отбор.Вставить("МестоВозникновенияЗатрат", ВыборкаРезультатовНачислений.МестоВозникновенияЗатрат);
						Отбор.Вставить("МесяцНачисления", ВыборкаРезультатовНачислений.Период);
						Отбор.Вставить("ВидНачисления", СтрокаНачисление); // Справочники.ВидыНачислений.КвартальнаяПремия);
						Отбор.Вставить("КодГрейда", ВыборкаРезультатовНачислений.КодГрейда);
						Отбор.Вставить("ПозицияШтатногоРасписания", ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания);
						НайденныеНачисления = ТаблицаНачисленийПоПериодамНачислениям.НайтиСтроки(Отбор);
						Если НайденныеНачисления.Количество() > 0 И СуммаВзносовВПФРТекущегоМесяца <> 0 Тогда
							Если НайденныеНачисления[0].Результат = 0 Тогда
								НоваяСтрокаВзносов.Результат = 0;	
							Иначе	
								НоваяСтрокаВзносов.Результат = НайденныеНачисления[0].Результат / ВыборкаРезультатовНачислений.РезультатНакопленныйЗаМесяц
																	* СуммаВзносовВПФРТекущегоМесяца;
							КонецЕсли;										
						Иначе	
							НоваяСтрокаВзносов.Результат = 0;	
						КонецЕсли;
						НоваяСтрокаВзносов.Сумма = НоваяСтрокаВзносов.Результат;
						
						ВзносыВПФРСЗарплаты = ВзносыВПФРСЗарплаты - НоваяСтрокаВзносов.Результат;
						
						//*******************************************************************************
					
						//8. Взносы в ФСС с квартальной премии (сумма в составе от общей суммы налога на травматизм)
						НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
						НоваяСтрокаВзносов.МесяцНачисления = ВыборкаРезультатовНачислений.Период;
						НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВФСС"); 
						НоваяСтрокаВзносов.ВидНачисления = СтрокаНачисление; // ПредопределенноеЗначение("Справочник.ВидыНачислений.КвартальнаяПремия");  
						НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФСС");
						
						Если СтрокаНачисление = ПредопределенноеЗначение("Справочник.ВидыНачислений.КвартальнаяПремия") Тогда
							Если Месяц(ВыборкаРезультатовНачислений.Период) = 4 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал1;
							ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 7 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал2;
							ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 10 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал3;     
							ИначеЕсли Месяц(ВыборкаРезультатовНачислений.Период) = 1 ИЛИ Месяц(ВыборкаРезультатовНачислений.Период) = 12 Тогда
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.Квартал4;
							Иначе
								НоваяСтрокаВзносов.ПериодДействия = Перечисления.ПериодыХраненияЗначений.ПустаяСсылка();
							КонецЕсли;
						КонецЕсли;	
						
						Отбор = Новый Структура();
						Отбор.Вставить("ФизическоеЛицо", ВыборкаРезультатовНачислений.ФизическоеЛицо);
						Отбор.Вставить("Организация", ВыборкаРезультатовНачислений.Организация);
						Отбор.Вставить("Подразделение", ВыборкаРезультатовНачислений.Подразделение); 
						Отбор.Вставить("МестоВозникновенияЗатрат", ВыборкаРезультатовНачислений.МестоВозникновенияЗатрат);
						Отбор.Вставить("МесяцНачисления", ВыборкаРезультатовНачислений.Период);
						Отбор.Вставить("ВидНачисления", СтрокаНачисление); // Справочники.ВидыНачислений.КвартальнаяПремия);
						Отбор.Вставить("КодГрейда", ВыборкаРезультатовНачислений.КодГрейда);
						Отбор.Вставить("ПозицияШтатногоРасписания", ВыборкаРезультатовНачислений.ПозицияШтатногоРасписания);
						НайденныеНачисления = ТаблицаНачисленийПоПериодамНачислениям.НайтиСтроки(Отбор);
						Если НайденныеНачисления.Количество() > 0 Тогда
							Если НайденныеНачисления[0].Результат = 0 Тогда
								НоваяСтрокаВзносов.Результат = 0;	
							Иначе	
								НоваяСтрокаВзносов.Результат = НайденныеНачисления[0].Результат / ВыборкаРезультатовНачислений.РезультатНакопленныйЗаМесяц 
																	* СуммаВзносовВФССТекущегоМесяца;
							КонецЕсли;										
						Иначе	
							НоваяСтрокаВзносов.Результат = 0;	
						КонецЕсли; 
						НоваяСтрокаВзносов.Сумма = НоваяСтрокаВзносов.Результат;
						
						ВзносыВФСССЗарплаты = ВзносыВФСССЗарплаты - НоваяСтрокаВзносов.Результат;
						
						//******************************************************************************* 
						
					КонецЦикла;	
					
	#КонецОбласти
	
	#Область РасчетВзносовСОстаткаФОТ
					
					
					НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
					НоваяСтрокаВзносов.МесяцНачисления = ВыборкаРезультатовНачислений.Период;
					НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыхВзносовНаТравматизм"); 
					НоваяСтрокаВзносов.ВидНачисления = ПредопределенноеЗначение("Справочник.ВидыНачислений.Зарплата");  
					НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФСС");
					НоваяСтрокаВзносов.Сумма 	 = НалогНаТравматизмСЗарплаты;
                    НоваяСтрокаВзносов.Результат = НалогНаТравматизмСЗарплаты;
						
					НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
					НоваяСтрокаВзносов.МесяцНачисления = ВыборкаРезультатовНачислений.Период;
					НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВФФОМС");
					НоваяСтрокаВзносов.ВидНачисления = ПредопределенноеЗначение("Справочник.ВидыНачислений.Зарплата");  
					НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФФОМС");
					НоваяСтрокаВзносов.Сумма 	 = ВзносыВФФОМССЗарплаты;					
					НоваяСтрокаВзносов.Результат = ВзносыВФФОМССЗарплаты;
						
					НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
					НоваяСтрокаВзносов.МесяцНачисления = ВыборкаРезультатовНачислений.Период;
					НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВПФР");
					НоваяСтрокаВзносов.ВидНачисления = ПредопределенноеЗначение("Справочник.ВидыНачислений.Зарплата");  
					НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ПФР");
					НоваяСтрокаВзносов.Сумма 	 = ВзносыВПФРСЗарплаты;
					НоваяСтрокаВзносов.Результат = ВзносыВПФРСЗарплаты;
						
					НоваяСтрокаВзносов = РасчитанныеПоказатели.Взносы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаВзносов, ВыборкаРезультатовНачислений);
					НоваяСтрокаВзносов.МесяцНачисления = ВыборкаРезультатовНачислений.Период;
					НоваяСтрокаВзносов.ТипНалога = ПредопределенноеЗначение("Справочник.ВидыНачислений.СтраховыеВзносыВФСС"); 
					НоваяСтрокаВзносов.ВидНачисления = ПредопределенноеЗначение("Справочник.ВидыНачислений.Зарплата");  
					НоваяСтрокаВзносов.ВидВнебюджетногоФонда = ПредопределенноеЗначение("Справочник.ВидыВнебюджетныхФондов.ФСС"); 
					НоваяСтрокаВзносов.Сумма 	 = ВзносыВФСССЗарплаты;
					НоваяСтрокаВзносов.Результат = ВзносыВФСССЗарплаты;
					
	#КонецОбласти					
	
				КонецЦикла;
				
		   КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;	
		
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗакончитьЗамерВремени(ИмяЗамера, Замер);
	
КонецПроцедуры

#КонецОбласти 

 #Область СервисныеМетодыМенеджераРасчета

Функция ТаблицаПересчетаФизическихЛиц()
	
	ТаблицаПересчета = Новый ТаблицаЗначений;
	ТаблицаПересчета.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	
	ИменаНастроек = ИменаНастроекПересчетаФизическихЛиц();
	Для Каждого ИмяНастройки Из ИменаНастроек Цикл
		ТаблицаПересчета.Колонки.Добавить(ИмяНастройки, Новый ОписаниеТипов("Булево"));
	КонецЦикла;
	
	Возврат ТаблицаПересчета;
	
КонецФункции

Функция ИменаНастроекПересчетаФизическихЛиц()
	
	МассивИмен = Новый Массив;
	МассивИмен.Добавить("ПересчитыватьНачислений");
	МассивИмен.Добавить("ПересчитыватьПремии");
	МассивИмен.Добавить("ПересчитыватьВыплаты");
	МассивИмен.Добавить("ПересчитыватьВзносы");
	
	Возврат МассивИмен;
	
КонецФункции

#Область ОценкаПроизводительности

Функция ИспользоватьТехнологическиеЗамерыВремени()
	Возврат Ложь;
КонецФункции

Функция НачатьЗамерВремени()
	
	Если Не ИспользоватьТехнологическиеЗамерыВремени() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Замер = ОценкаПроизводительности.НачатьЗамерВремени();
	
	Возврат Замер;

КонецФункции

Процедура ЗакончитьЗамерВремени(ИмяЗамера, Замер)
	
	Если Не ИспользоватьТехнологическиеЗамерыВремени() Тогда
		Возврат;
	КонецЕсли;
	
	ОценкаПроизводительности.ЗакончитьЗамерВремениТехнологический(ИмяЗамера, Замер);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область Инициализация

МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
МесяцНачисления = Дата(1, 1, 1);
МесяцыРасчета = Новый Массив;
ПериодРасчета = Новый СтандартныйПериод;
ФизлицаПоПериодам = Новый ТаблицаЗначений;
ИсточникРасчета = Новый ТаблицаЗначений;
//ТаблицаНалогов = Новый ТаблицаЗначений;
Организация = Справочники.Организации.ПустаяСсылка();
ВременныйРегистратор = Документы.РасчетПоказателейБюджетовПрогнозов.ПолучитьСсылку();
ВидРасчета = Перечисления.ВидыРасчетаБюджетныхПоказателей.ПоНачислению;
ЭтоРасчетРезерва = Ложь;
Сценарий = Справочники.Сценарии.ПустаяСсылка();

ОтборВЗапросахПоПодразделению = Ложь;
ОтборВЗапросахПоМестуВозникновенияЗатрат = Ложь;
ОтборВЗапросахПоФизическимЛицам = Ложь;

НастройкиДатаВыплатыБюджетирования = Новый Структура;

ДополнительныеСвойства = Новый Структура;

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли