
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.СтатусПозиции = Перечисления.СтатусыПозицииШтатногоРасписания.ПустаяСсылка() Тогда
		
		ПараметрыПозиции = Новый Структура();
		ПараметрыПозиции.Вставить("ДатаАнализа", ТекущаяДатаСеанса());
		ПараметрыПозиции.Вставить("Позиция", 	 Объект.Ссылка);
		
		Если Бюджетирование.ПозицияШтатногоРасписанияЗанята(ПараметрыПозиции) Тогда 
			Объект.СтатусПозиции = Перечисления.СтатусыПозицииШтатногоРасписания.Штат;
		Иначе 
			Объект.СтатусПозиции = Перечисления.СтатусыПозицииШтатногоРасписания.Вакансия;
		КонецЕсли;
		
		Модифицированность = Истина;
		
	КонецЕсли;	
	
	// Обработчик подсистемы "ВерсионированиеОбъектов".
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры
